Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# dataSecurityBody
source: We prioritize the security of your personal information and implement robust measures to protect it from unauthorized access, loss, misuse, or alteration. **5.1 Technical Safeguards** - **Encryption**: All sensitive data, including personal identifiers, is encrypted in transit (using TLS 1.2 or higher) and at rest (using AES-256 encryption). - **Access Controls**: Only authorized personnel with a legitimate need can access user data, and access is restricted through role-based permissions and multi-factor authentication. - **Secure Servers**: Our servers are hosted in secure data centers with physical and digital protections, including firewalls, intrusion detection systems, and regular security patches. **5.2 Organizational Safeguards** - **Employee Training**: All employees and contractors undergo regular training on data protection and privacy best practices. - **Third-Party Audits**: We engage independent security firms to conduct regular audits of our systems and processes to identify and address vulnerabilities. - **Vendor Management**: All third-party service providers are vetted for compliance with data protection standards, and contracts include strict confidentiality clauses. **5.3 Incident Response** - In the unlikely event of a data breach, we have a comprehensive incident response plan to investigate, mitigate, and notify affected users promptly, as required by law. - We maintain detailed logs of security incidents to improve our defenses and prevent recurrence. **5.4 User Responsibilities** - You are responsible for maintaining the confidentiality of your account credentials (e.g., password, PIN). Do not share these with others. - Use strong, unique passwords and enable two-factor authentication (if available) to enhance your account security. - Report any suspected unauthorized access to your account immediately to support@schnell.com.
ar: نحن نعطي الأولوية لأمن معلوماتك الشخصية وننفذ تدابير قوية لحمايتها من الوصول غير المصرح به أو الفقدان أو سوء الاستخدام أو التغيير. **5.1 التدابير الوقائية التقنية** - **التشفير**: يتم تشفير جميع البيانات الحساسة، بما في ذلك المعرفات الشخصية، أثناء النقل (باستخدام TLS 1.2 أو أعلى) وفي حالة عدم الاستخدام (باستخدام تشفير AES-256). - **ضوابط الوصول**: يمكن فقط للموظفين المصرح لهم ذوي الحاجة المشروعة الوصول إلى بيانات المستخدم، ويتم تقييد الوصول من خلال أذونات قائمة على الأدوار والمصادقة متعددة العوامل. - **الخوادم الآمنة**: يتم استضافة خوادمنا في مراكز بيانات آمنة مع وسائل حماية مادية ورقمية، بما في ذلك جدران الحماية، وأنظمة كشف التسلل، وتصحيحات الأمان المنتظمة. **5.2 التدابير الوقائية التنظيمية** - **تدريب الموظفين**: يخضع جميع الموظفين والمقاولين لتدريب منتظم على أفضل ممارسات حماية البيانات والخصوصية. - **تدقيقات الطرف الثالث**: نتعاقد مع شركات أمن مستقلة لإجراء تدقيقات منتظمة لأنظمتنا وعملياتنا لتحديد نقاط الضعف ومعالجتها. - **إدارة البائعين**: يتم فحص جميع مزودي خدمات الأطراف الثالثة للتأكد من امتثالهم لمعايير حماية البيانات، وتتضمن العقود بنود سرية صارمة. **5.3 الاستجابة للحوادث** - في حالة حدوث خرق للبيانات غير محتمل، لدينا خطة شاملة للاستجابة للحوادث للتحقيق في المستخدمين المتأثرين وتخفيف الضرر وإخطارهم على الفور، كما يقتضي القانون. - نحتفظ بسجلات مفصلة للحوادث الأمنية لتحسين دفاعاتنا ومنع تكرارها. **5.4 مسؤوليات المستخدم** - أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك (مثل كلمة المرور، ورمز PIN). لا تشاركها مع الآخرين. - استخدم كلمات مرور قوية وفريدة وقم بتمكين المصادقة الثنائية (إن وجدت) لتعزيز أمان حسابك. - أبلغ عن أي وصول غير مصرح به إلى حسابك على الفور إلى support@shnell.com.
de: Wir legen großen Wert auf die Sicherheit Ihrer persönlichen Daten und setzen robuste Maßnahmen um, um sie vor unbefugtem Zugriff, Verlust, Missbrauch oder Veränderung zu schützen. **5.1 Technische Schutzmaßnahmen** - **Verschlüsselung**: Alle sensiblen Daten, einschließlich persönlicher Identifikatoren, werden während der Übertragung (mit TLS 1.2 oder höher) und im Ruhezustand (mit AES-256-Verschlüsselung) verschlüsselt. - **Zugriffskontrollen**: Nur autorisiertes Personal mit einem berechtigten Bedarf kann auf Nutzerdaten zugreifen, und der Zugriff ist durch rollenbasierte Berechtigungen und Multi-Faktor-Authentifizierung eingeschränkt. - **Sichere Server**: Unsere Server werden in sicheren Rechenzentren mit physischen und digitalen Schutzmaßnahmen gehostet, einschließlich Firewalls, Einbrucherkennungssystemen und regelmäßigen Sicherheitspatches. **5.2 Organisatorische Schutzmaßnahmen** - **Mitarbeiterschulungen**: Alle Mitarbeiter und Auftragnehmer werden regelmäßig in den Bereichen Datenschutz und bewährte Datenschutzpraktiken geschult. - **Prüfungen durch Dritte**: Wir beauftragen unabhängige Sicherheitsfirmen, regelmäßige Audits unserer Systeme und Prozesse durchzuführen, um Schwachstellen zu identifizieren und zu beheben. - **Lieferantenmanagement**: Alle Drittanbieter werden auf die Einhaltung von Datenschutzstandards überprüft, und Verträge enthalten strenge Vertraulichkeitsklauseln. **5.3 Reaktion auf Vorfälle** - Im unwahrscheinlichen Fall einer Datenpanne verfügen wir über einen umfassenden Notfallplan, um betroffene Nutzer umgehend zu untersuchen, abzuschwächen und zu benachrichtigen, wie gesetzlich vorgeschrieben. - Wir führen detaillierte Protokolle über Sicherheitsvorfälle, um unsere Abwehrmaßnahmen zu verbessern und ein Wiederauftreten zu verhindern. **5.4 Verantwortlichkeiten des Nutzers** - Sie sind dafür verantwortlich, die Vertraulichkeit Ihrer Kontodaten (z. B. Passwort, PIN) zu wahren. Geben Sie diese nicht an andere weiter. - Verwenden Sie starke, einzigartige Passwörter und aktivieren Sie die Zwei-Faktor-Authentifizierung (falls verfügbar), um die Sicherheit Ihres Kontos zu erhöhen. - Melden Sie jeden Verdacht auf unbefugten Zugriff auf Ihr Konto sofort an support@schnell.com.
es: Priorizamos la seguridad de su información personal e implementamos medidas sólidas para protegerla del acceso no autorizado, la pérdida, el uso indebido o la alteración. **5.1 Salvaguardas técnicas** - **Cifrado**: Todos los datos sensibles, incluidos los identificadores personales, se cifran en tránsito (utilizando TLS 1.2 o superior) y en reposo (utilizando cifrado AES-256). - **Controles de acceso**: Solo el personal autorizado con una necesidad legítima puede acceder a los datos de los usuarios, y el acceso está restringido a través de permisos basados en roles y autenticación multifactor. - **Servidores seguros**: Nuestros servidores están alojados en centros de datos seguros con protecciones físicas y digitales, incluidos cortafuegos, sistemas de detección de intrusos y parches de seguridad regulares. **5.2 Salvaguardas organizativas** - **Capacitación de empleados**: Todos los empleados y contratistas reciben capacitación regular sobre la protección de datos y las mejores prácticas de privacidad. - **Auditorías de terceros**: Contratamos a empresas de seguridad independientes para realizar auditorías regulares de nuestros sistemas y procesos para identificar y abordar las vulnerabilidades. - **Gestión de proveedores**: Todos los proveedores de servicios de terceros son examinados para verificar el cumplimiento de los estándares de protección de datos, y los contratos incluyen cláusulas de confidencialidad estrictas. **5.3 Respuesta a incidentes** - En el improbable caso de una violación de datos, tenemos un plan integral de respuesta a incidentes para investigar, mitigar y notificar a los usuarios afectados de inmediato, según lo exija la ley. - Mantenemos registros detallados de los incidentes de seguridad para mejorar nuestras defensas y evitar que se repitan. **5.4 Responsabilidades del usuario** - Usted es responsable de mantener la confidencialidad de sus credenciales de cuenta (por ejemplo, contraseña, PIN). No las comparta con otras personas. - Utilice contraseñas fuertes y únicas y habilite la autenticación de dos factores (si está disponible) para mejorar la seguridad de su cuenta. - Informe de inmediato cualquier sospecha de acceso no autorizado a su cuenta a support@shnell.com.
pt: Priorizamos a segurança das suas informações pessoais e implementamos medidas robustas para as proteger contra acesso não autorizado, perda, uso indevido ou alteração. **5.1 Salvaguardas técnicas** - **Criptografia**: Todos os dados sensíveis, incluindo informações de identificação pessoal, são criptografados em trânsito (utilizando TLS 1.2 ou superior) e em repouso (utilizando criptografia AES-256). - **Controlos de acesso**: Apenas pessoal autorizado com uma necessidade legítima pode aceder aos dados do utilizador, e o acesso é restrito por permissões baseadas em funções e autenticação multifator. - **Servidores seguros**: Os nossos servidores estão alojados em centros de dados seguros com salvaguardas físicas e digitais, incluindo firewalls, sistemas de deteção de intrusão e patches de segurança regulares. **5.2 Salvaguardas organizacionais** - **Formação de funcionários**: Todos os funcionários e contratados são submetidos a formação regular sobre proteção de dados e melhores práticas de privacidade. - **Auditorias de terceiros**: Contratamos empresas de segurança independentes para realizar auditorias regulares dos nossos sistemas e processos para identificar e abordar vulnerabilidades. - **Gestão de fornecedores**: Todos os fornecedores de serviços de terceiros são examinados quanto à conformidade com os padrões de proteção de dados, e os contratos incluem cláusulas de confidencialidade rigorosas.
zh: 我们优先保护您的个人信息安全，并实施了强大的措施来保护其免受未经授权的访问、丢失、滥用或更改。 **5.1 技术保障措施** - **加密**：所有敏感数据，包括个人身份信息，在传输过程中（使用 TLS 1.2 或更高版本）和静态存储时（使用 AES-256 加密）都会进行加密。 - **访问控制**：只有具有合法需要的授权人员才能访问用户数据，并且访问受到基于角色的权限和多因素身份验证的限制。 - **安全服务器**：我们的服务器托管在安全的配备物理和数字保护的数据中心，包括防火墙、入侵检测系统和定期安全补丁。 **5.2 组织保障措施** - **员工培训**：所有员工和承包商都会接受有关数据保护和隐私最佳实践的定期培训。 - **第三方审计**：我们聘请独立的安保公司对我们的系统和流程进行定期审计，以识别和解决漏洞。 - **供应商管理**：所有第三方服务提供商都经过审查以确保其符合数据保护标准，且合同包含严格的保密条款。

# dataRetentionHeading
source: 6. Data Retention
ar: 6. الاحتفاظ بالبيانات
de: 6. Datenaufbewahrung
es: 6. Retención de datos
pt: 6. Retenção de dados
zh: 6. 数据保留

# dataRetentionBody
source: We retain your personal information only for as long as necessary to fulfill the purposes outlined in this policy or to comply with legal, regulatory, or operational requirements. **6.1 Retention Periods** - **Customer Data**: Information related to service requests (e.g., delivery details, payment records) is retained for 5 years after the last transaction to comply with tax and accounting regulations. - **Driver Data**: Driver profiles, including certifications and transaction history, are retained for 7 years after account closure to comply with transportation and labor laws. - **Communication Data**: Support tickets and correspondence are retained for 3 years to ensure quality control and resolve disputes. - **Location Data**: Real-time location data is retained for 30 days after a delivery is completed, unless required for legal purposes or dispute resolution. - **Anonymized Data**: Aggregated, non-identifiable data may be retained indefinitely for analytics and research purposes. **6.2 Data Deletion** - Upon account cancellation, you may request the deletion of your personal data via the App or by contacting support@schnell.com. We will delete your data within 30 days, except where retention is required by law (e.g., tax records). - Anonymized data that cannot be linked to you may be retained for statistical purposes. - Backups are securely deleted after 90 days to ensure no residual data remains. **6.3 Data Archiving** - Inactive accounts (no activity for 2 years) may be archived to reduce active storage. You will be notified before archiving, and you can reactivate your account by logging in or contacting support. - Archived data is stored securely and subject to the same protections as active data.
ar: نحتفظ بمعلوماتك الشخصية فقط طالما كان ذلك ضروريًا لتحقيق الأغراض الموضحة في هذه السياسة أو للامتثال للمتطلبات القانونية أو التنظيمية أو التشغيلية. **6.1 فترات الاحتفاظ** - **بيانات العميل**: يتم الاحتفاظ بالمعلومات المتعلقة بطلبات الخدمة (مثل تفاصيل التسليم، وسجلات الدفع) لمدة 5 سنوات بعد آخر معاملة للامتثال للوائح الضرائب والمحاسبة. - **بيانات السائق**: يتم الاحتفاظ بملفات تعريف السائقين، بما في ذلك الشهادات وسجل المعاملات، لمدة 7 سنوات بعد إغلاق الحساب للامتثال لقوانين النقل والعمل. - **بيانات الاتصال**: يتم الاحتفاظ بتذاكر الدعم والمراسلات لمدة 3 سنوات لضمان مراقبة الجودة وحل النزاعات. - **بيانات الموقع**: يتم الاحتفاظ ببيانات الموقع في الوقت الفعلي لمدة 30 يومًا بعد إتمام عملية التسليم، ما لم تكن مطلوبة لأغراض قانونية أو لحل النزاعات. - **البيانات المجهولة الهوية**: يمكن الاحتفاظ بالبيانات المجمعة وغير القابلة للتحديد إلى أجل غير مسمى لأغراض التحليلات والبحث. **6.2 حذف البيانات** - عند إلغاء الحساب، يمكنك طلب حذف بياناتك الشخصية عبر التطبيق أو عن طريق الاتصال بـ support@shnell.com. سنقوم بحذف بياناتك في غضون 30 يومًا، باستثناء الحالات التي يكون فيها الاحتفاظ مطلوبًا بموجب القانون (مثل السجلات الضريبية). - يمكن الاحتفاظ بالبيانات المجهولة الهوية التي لا يمكن ربطها بك لأغراض إحصائية. - يتم حذف النسخ الاحتياطية بشكل آمن بعد 90 يومًا لضمان عدم بقاء أي بيانات متبقية. **6.3 أرشفة البيانات** - يمكن أرشفة الحسابات غير النشطة (التي لم تشهد أي نشاط لمدة سنتين) لتقليل مساحة التخزين النشطة. سيتم إخطارك قبل الأرشفة، ويمكنك إعادة تنشيط حسابك عن طريق تسجيل الدخول أو الاتصال بالدعم. - يتم تخزين البيانات المؤرشفة بشكل آمن وتخضع لنفس وسائل الحماية مثل البيانات النشطة.
de: Wir bewahren Ihre persönlichen Daten nur so lange auf, wie es zur Erfüllung der in dieser Richtlinie dargelegten Zwecke oder zur Einhaltung gesetzlicher, behördlicher oder betrieblicher Anforderungen erforderlich ist. **6.1 Aufbewahrungsfristen** - **Kundendaten**: Informationen zu Dienstanfragen (z. B. Lieferdetails, Zahlungsaufzeichnungen) werden 5 Jahre nach der letzten Transaktion aufbewahrt, um Steuer- und Buchhaltungsvorschriften einzuhalten. - **Fahrerdaten**: Fahrerprofile, einschließlich Zertifizierungen und Transaktionshistorie, werden 7 Jahre nach der Kontoschließung aufbewahrt, um Transport- und Arbeitsgesetze einzuhalten. - **Kommunikationsdaten**: Support-Tickets und Korrespondenz werden 3 Jahre lang aufbewahrt, um die Qualitätskontrolle sicherzustellen und Streitigkeiten beizulegen. - **Standortdaten**: Echtzeit-Standortdaten werden 30 Tage nach Abschluss einer Lieferung aufbewahrt, es sei denn, sie werden für rechtliche Zwecke oder zur Beilegung von Streitigkeiten benötigt. - **Anonymisierte Daten**: Aggregierte, nicht identifizierbare Daten können auf unbestimmte Zeit für Analyse- und Forschungszwecke aufbewahrt werden. **6.2 Datenlöschung** - Nach der Kontokündigung können Sie die Löschung Ihrer persönlichen Daten über die App oder durch Kontaktaufnahme mit support@schnell.com beantragen. Wir werden Ihre Daten innerhalb von 30 Tagen löschen, es sei denn, die Aufbewahrung ist gesetzlich vorgeschrieben (z. B. Steuerunterlagen). - Anonymisierte Daten, die nicht mit Ihnen verknüpft werden können, können für statistische Zwecke aufbewahrt werden. - Backups werden nach 90 Tagen sicher gelöscht, um sicherzustellen, dass keine Restdaten verbleiben. **6.3 Datenarchivierung** - Inaktive Konten (keine Aktivität für 2 Jahre) können archiviert werden, um den aktiven Speicher zu reduzieren. Sie werden vor der Archivierung benachrichtigt und können Ihr Konto reaktivieren, indem Sie sich anmelden oder den Support kontaktieren. - Archivierte Daten werden sicher gespeichert und unterliegen den gleichen Schutzmaßnahmen wie aktive Daten.
es: Conservamos su información personal solo durante el tiempo que sea necesario para cumplir con los fines descritos en esta política o para cumplir con los requisitos legales, regulatorios u operativos. **6.1 Períodos de retención** - **Datos del cliente**: La información relacionada con las solicitudes de servicio (por ejemplo, detalles de entrega, registros de pago) se conserva durante 5 años después de la última transacción para cumplir con las regulaciones fiscales y contables. - **Datos del conductor**: Los perfiles de los conductores, incluidos las certificaciones y el historial de transacciones, se conservan durante 7 años después del cierre de la cuenta para cumplir con las leyes de transporte y laborales. - **Datos de comunicación**: Los tickets de soporte y la correspondencia se conservan durante 3 años para garantizar el control de calidad y resolver disputas. - **Datos de ubicación**: Los datos de ubicación en tiempo real se conservan durante 30 días después de que se completa una entrega, a menos que sean necesarios para fines legales o para la resolución de disputas. - **Datos anonimizados**: Los datos agregados y no identificables pueden conservarse indefinidamente para fines de análisis e investigación. **6.2 Eliminación de datos** - Al cancelar su cuenta, puede solicitar la eliminación de sus datos personales a través de la Aplicación o contactando a support@shnell.com. Eliminaremos sus datos en un plazo de 30 días, excepto cuando la retención sea requerida por la ley (por ejemplo, registros fiscales). - Los datos anonimizados que no se pueden vincular a usted pueden conservarse con fines estadísticos. - Las copias de seguridad se eliminan de forma segura después de 90 días para garantizar que no queden datos residuales. **6.3 Archivo de datos** - Las cuentas inactivas (sin actividad durante 2 años) pueden archivarse para reducir el almacenamiento activo. Se le notificará antes del archivo y podrá reactivar su cuenta iniciando sesión o contactando con el soporte. - Los datos archivados se almacenan de forma segura y están sujetos a las mismas protecciones que los datos activos.
pt: Retemos as suas informações pessoais apenas pelo tempo necessário para cumprir os fins descritos nesta política ou para cumprir os requisitos legais, regulamentares ou operacionais. **6.1 Períodos de retenção** - **Dados de cliente**: As informações relacionadas com pedidos de serviço (por exemplo, detalhes de entrega, registos de pagamento) são retidas por 5 anos após a última transação para cumprir os regulamentos fiscais e contabilísticos. - **Dados do motorista**: Os perfis dos motoristas, incluindo certificações e histórico de transações, são retidos por 7 anos após o fecho da conta para cumprir as leis de transporte e trabalho. - **Dados de comunicação**: Os tickets de suporte e a correspondência são retidos por 3 anos para garantir o controlo de qualidade e resolver disputas. - **Dados de localização**: Os dados de localização em tempo real são retidos por 30 dias após a conclusão de uma entrega, a menos que sejam necessários para fins legais ou resolução de disputas. - **Dados anónimos**: Os dados agregados e não identificáveis podem ser retidos indefinidamente para fins de análise e pesquisa. **6.2 Eliminação de dados** - Após o cancelamento da conta, pode solicitar a eliminação das suas informações pessoais através da App ou contactando support@shnell.com. Eliminaremos os seus dados no prazo de 30 dias, exceto nos casos em que a retenção seja exigida por lei (por exemplo, registos fiscais). - Os dados anónimos que não podem ser vinculados a si podem ser retidos para fins estatísticos. - Os backups são eliminados de forma segura após 90 dias para garantir que não permaneçam dados residuais. **6.3 Arquivamento de dados** - Contas inativas (sem atividade durante 2 anos) podem ser arquivadas para reduzir o armazenamento ativo. Ser-lhe-á notificado antes do arquivamento e poderá reativar a sua conta iniciando sessão ou contactando o suporte. - Os dados arquivados são armazenados de forma segura e estão sujeitos às mesmas proteções que os dados ativos.
zh: 我们仅在为实现本政策中概述的目的或遵守法律、法规或运营要求所需的时间内保留您的个人信息。 **6.1 保留期限** - **客户数据**：与服务请求相关的信息（例如，投递详细信息、付款记录）将保留 5 年，以遵守税务和会计法规。 - **司机数据**：司机的个人资料（包括资格证书和交易历史）将在账户关闭后保留 7 年，以遵守运输和劳动法。 - **通信数据**：支持工单和通信将保留 3 年，以确保质量控制和解决纠纷。 - **位置数据**：实时位置数据将在投递完成后保留 30 天，除非因法律目的或纠纷解决而需要更长时间。 - **匿名数据**：聚合的、不可识别个人身份的数据可能会无限期保留用于分析和研究目的。 **6.2 数据删除** - 如果您取消账户，可以通过应用程序或联系 support@shnell.com 请求删除您的个人信息。除法律要求保留的情况（例如，税务记录）外，我们将在 30 天内删除您的数据。 - 无法与您关联的匿名数据可能会出于统计目的而保留。 - 备份将在 90 天后安全删除，以确保没有残留数据。 **6.3 数据归档** - 不活跃的账户（2 年内无活动）可能会被归档以减少活动存储。您将在归档前收到通知，并且可以通过登录或联系支持来重新激活您的账户。 - 存档的数据将安全存储，并享有与活动数据相同的保护。

# dataRightsHeading
source: 7. Your Data Protection Rights
ar: 7. حقوقك في حماية البيانات
de: 7. Ihre Datenschutzrechte
es: 7. Sus derechos de protección de datos
pt: 7. Os seus direitos de proteção de dados
zh: 7. 您的数据保护权利
