Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

source: Google API Key not configured.
ar: لم يتم تكوين مفتاح Google API.
de: Google API-Schlüssel nicht konfiguriert.
es: Clave de API de Google no configurada.
pt: Chave da API do Google não configurada.
zh: Google API密钥未配置。

# googleRequestFailed
source: Google request failed with status
ar: فشنيل طلب Google بالحالة
de: Google-Anfrage fehlgeschlagen mit Status
es: Solicitud de Google fallida con estado
pt: A solicitação do Google falhou com o status
zh: Google请求失败，状态

# googleApiError
source: Google API error: {error}
ar: خطأ في واجهة برمجة تطبيقات Google: {error}
de: Google API-Fehler: {error}
es: Error de la API de Google: {error}
pt: Erro da API do Google: {error}
zh: Google API错误：{error}

source: User not authenticated
ar: المستخدم غير مصادق
de: Benutzer nicht authentifiziert
es: Usuario no autenticado
pt: Usuário não autenticado
zh: 用户未认证

source: Driver ID missing
ar: معرف السائق مفقود
de: Fahrer-ID fehlt
es: ID del conductor no encontrado
pt: ID do motorista ausente
zh: 缺少司机ID

source: Order ID missing
ar: معرف الطلب مفقود
de: Bestell-ID fehlt
es: ID de la orden no encontrada
pt: ID do pedido ausente
zh: 缺少订单ID

# failedToParseData
source: Failed to parse order or stop data: {error}
ar: فشنيل في تحليل بيانات الطلب أو المحطة: {error}
de: Fehler beim Parsen der Bestell- oder Stoppdaten: {error}
es: No se pudieron analizar los datos de la orden o la parada: {error}
pt: Falha ao analisar os dados do pedido ou da parada: {error}
zh: 解析订单或站点数据失败：{error}

source: Delivered
ar: تم التسليم
de: Geliefert
es: Entregado
pt: Entregue
zh: 已送达

source: Not Delivered
ar: لم يتم التسليم
de: Nicht geliefert
es: No entregado
pt: Não entregue
zh: 未送达

source: Choose on Map
ar: اختر من الخريطة
de: Auf Karte wählen
es: Elegir en el mapa
pt: Escolher no mapa
zh: 在地图上选择

# locationAccessError
source: Location access error: {error}
ar: خطأ في الوصول إلى الموقع: {error}
de: Fehler beim Standortzugriff: {error}
es: Error de acceso a la ubicación: {error}
pt: Erro de acesso à localização: {error}
zh: 位置访问错误: {error}

# currencyLabel
source: TND {price}
de: {price} TND
es: {price} TND
pt: {price} TND
zh: {price} TND
