Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# suspensionBody
source: Schnell Logistics reserves the right to suspend or terminate accounts to ensure platform integrity, safety, and compliance with our Terms of Use. **12.1 Account Suspension** - **Reasons for Suspension**: Breaches of our Terms of Use, such as providing false information, engaging in harassment, or transporting prohibited items. Detected fraud, unauthorized access, or attempts to manipulate ratings or earnings. Requirements from law enforcement or regulatory bodies to suspend an account pending investigation. Drivers with consistently low ratings (below 3.0 out of 5.0 for 10 consecutive deliveries) or frequent cancellations may face suspension. Customers who frequently cancel their shipments risk temporary restrictions or account suspension. - **Process**: Suspended users receive an email and in-app notification detailing the reason, duration (e.g., 7 days, 30 days), and appeal instructions. During suspension, users cannot book or accept new services but can access their account to view history or submit appeals. Suspensions are reviewed regularly, and accounts may be reinstated upon resolution of the issue (e.g., payment clearance, policy compliance). **12.2 Account Termination** - **Reasons for Termination**: Engaging in deliberate fraud, such as falsifying delivery confirmations or payment details. Harassment, discrimination, or violence toward other users, Schnell staff, or third parties. Transporting illegal goods, violating transportation laws, or engaging in criminal conduct. Multiple suspensions without corrective action. - **Process**: Terminated users receive a detailed notice via email and in-app notification, unless prohibited by law (e.g., ongoing investigations). Upon termination, all scheduled deliveries are cancelled, and Customer refunds are processed within 7 business days. Drivers’ remaining credit balances (after commission deductions) are paid out within 30 days, subject to verification. Terminated accounts cannot be reactivated, but users may appeal for reconsideration. **12.3 Appeals Process** - Users may appeal suspensions or terminations within **14 days** of notification by emailing support@schnell.com or using the App’s “Appeal Decision” feature. Appeals must include the user’s name, account details, and any supporting evidence (e.g., delivery records, communication logs). Schnell will review appeals within 10 business days and provide a written response. Decisions are final but may be escalated to an independent mediator for Business Partners. **12.4 Performance Monitoring** - We monitor user performance to ensure quality and safety. Customers and Drivers receive ratings based on feedback from each other. Low performance (e.g., frequent cancellations, poor communication) may trigger warnings before suspension or termination. Users are notified of performance issues via email or in-app alerts and given 7 days to improve before further action.
ar: تحتفظ شركة شنيل اللوجستية بالحق في تعليق أو إنهاء الحسابات لضمان سلامة المنصة وسلامتها وامتثالها لشروط الاستخدام لدينا. **12.1 تعليق الحساب** - **أسباب التعليق**: - **انتهاكات السياسة**: انتهاكات لشروط الاستخدام لدينا، مثل تقديم معلومات كاذبة، أو الانخراط في المضايقة، أو نقل أشياء محظورة. - **النشاط المشبوه**: الاحتيال المكتشف، أو الوصول غير المصرح به، أو محاولات التلاعب بالتقييمات أو الأرباح. - **الامتثال القانوني**: متطلبات من سلطات إنفاذ القانون أو الهيئات التنظيمية لتعليق حساب ما في انتظار التحقيق. - **الأداء المنخفض**: قد يواجه السائقون الذين لديهم تقييمات منخفضة باستمرار (أقل من 3.0 من 5.0 لـ 10 عمليات تسليم متتالية) أو إلغاءات متكررة تعليقًا. - **الإلغاءات المتكررة من العميل**: العملاء الذين يلغون شحناتهم بشكل متكرر قد يتعرضون للتعليق. - **العملية**: - يتلقى المستخدمون المعلقون رسالة بريد إلكتروني وإشعارًا داخل التطبيق يوضح السبب، والمدة (مثل 7 أيام، 30 يومًا)، وتعليمات الاستئناف. - أثناء التعليق، لا يمكن للمستخدمين حجز أو قبول خدمات جديدة ولكن يمكنهم الوصول إلى حسابهم لعرض السجل أو تقديم الاستئنافات. - تتم مراجعة التعليقات بانتظام، وقد يتم إعادة الحسابات بعد حل المشكلة (مثل تسوية الدفع، والامتثال للسياسة). **12.2 إنهاء الحساب** - **أسباب الإنهاء**: - **النشاط الاحتيالي**: الانخراط في احتيال متعمد، مثل تزوير تأكيدات التسليم أو تفاصيل الدفع. - **السلوك المسيء**: التحرش أو التمييز أو العنف تجاه المستخدمين الآخرين أو موظفي شنيل أو الأطراف الثالثة. - **النشاط غير القانوني**: نقل البضائع غير القانونية، أو انتهاك قوانين النقل، أو الانخراط في سلوك إجرامي. - **الانتهاكات المتكررة**: التعليقات المتعددة دون اتخاذ إجراءات تصحيحية. - **العملية**: - يتلقى المستخدمون الذين تم إنهاء حسابهم إشعارًا مفصلاً عبر البريد الإلكتروني والإشعارات داخل التطبيق، ما لم يمنع القانون ذلك (مثل التحقيقات الجارية). - عند الإنهاء، يتم إلغاء جميع عمليات التسليم المجدولة، ويتم معالجة المبالغ المستردة للعملاء في غضون 7 أيام عمل. - يتم دفع أرصدة السائقين المتبقية (بعد خصم العمولة) في غضون 30 يومًا، رهناً بالتحقق. - لا يمكن إعادة تنشيط الحسابات التي تم إنهاؤها، ولكن يمكن للمستخدمين تقديم استئناف لإعادة النظر. **12.3 عملية الاستئناف** - يمكن للمستخدمين استئناف التعليق أو الإنهاء في غضون **14 يومًا** من الإخطار عن طريق إرسال بريد إلكتروني إلى support@shnell.com أو استخدام ميزة "الطعن في القرار" في التطبيق. - يجب أن تتضمن الاستئنافات اسم المستخدم وتفاصيل الحساب وأي دليل داعم (مثل سجلات التسليم، وسجلات الاتصال). - ستقوم شركة شنيل بمراجعة الاستئنافات في غضون 10 أيام عمل وتقديم رد كتابي. القرارات نهائية ولكن يمكن تصعيدها إلى وسيط مستقل لشركاء الأعمال. **12.4 مراقبة الأداء** - نراقب أداء المستخدم لضمان الجودة والسلامة. يتلقى العملاء والسائقون تقييمات بناءً على الملاحظات الواردة من بعضهم البعض. - قد يؤدي الأداء المنخفض (مثل الإلغاءات المتكررة، وضعف الاتصال) إلى إطلاق تحذيرات قبل التعليق أو الإنهاء. - يتم إخطار المستخدمين بمشكلات الأداء عبر البريد الإلكتروني أو التنبيهات داخل التطبيق ويتم منحهم 7 أيام للتحسين قبل اتخاذ مزيد من الإجراءات.
de: Schnell Logistics behält sich das Recht vor, Konten zu sperren oder zu kündigen, um die Integrität der Plattform, die Sicherheit und die Einhaltung unserer Nutzungsbedingungen zu gewährleisten. **12.1 Kontosperrung** - **Gründe für die Sperrung**: Verstöße gegen unsere Nutzungsbedingungen, wie z. B. die Bereitstellung falscher Informationen, die Beteiligung an Belästigungen oder der Transport verbotener Gegenstände. Erkannter Betrug, unbefugter Zugriff oder Versuche, Bewertungen oder Einnahmen zu manipulieren. Anforderungen von Strafverfolgungs- oder Aufsichtsbehörden, ein Konto während laufender Ermittlungen zu sperren. Fahrer mit konstant niedrigen Bewertungen (unter 3,0 von 5,0 für 10 aufeinanderfolgende Lieferungen) oder häufigen Stornierungen können gesperrt werden. Kunden, die ihre Sendungen häufig stornieren, riskieren vorübergehende Einschränkungen oder eine Kontosperrung. - **Prozess**: Gesperrte Nutzer erhalten eine E-Mail und eine In-App-Benachrichtigung, die den Grund, die Dauer (z. B. 7 Tage, 30 Tage) und Anweisungen für den Einspruch detailliert beschreiben. Während der Sperrung können Nutzer keine neuen Dienste buchen oder annehmen, aber auf ihr Konto zugreifen, um den Verlauf einzusehen oder Einsprüche einzureichen. Sperrungen werden regelmäßig überprüft und Konten können nach Behebung des Problems (z. B. Zahlungsfreigabe, Einhaltung der Richtlinien) wiederhergestellt werden. **12.2 Kündigung des Kontos** - **Gründe für die Kündigung**: Beteiligung an vorsätzlichem Betrug, wie z. B. der Fälschung von Lieferbestätigungen oder Zahlungsdetails. Belästigung, Diskriminierung oder Gewalt gegenüber anderen Nutzern, Schnell-Mitarbeitern oder Dritten. Transport von illegalen Gütern, Verstoß gegen Transportgesetze oder Beteiligung an kriminellen Handlungen. Mehrere Sperrungen ohne Korrekturmaßnahmen. - **Prozess**: Nutzer mit gekündigten Konten erhalten eine detaillierte Benachrichtigung per E-Mail und In-App-Benachrichtigung, es sei denn, dies ist gesetzlich verboten (z. B. laufende Ermittlungen). Bei der Kündigung werden alle geplanten Lieferungen storniert und die Rückerstattungen an die Kunden innerhalb von 7 Werktagen bearbeitet. Restguthaben der Fahrer (nach Abzug von Provisionen) werden innerhalb von 30 Tagen ausgezahlt, vorbehaltlich der Überprüfung. Gekündigte Konten können nicht reaktiviert werden, aber Nutzer können einen Einspruch zur erneuten Prüfung einlegen. **12.3 Einspruchsverfahren** - Nutzer können innerhalb von **14 Tagen** nach der Benachrichtigung gegen Sperrungen oder Kündigungen Einspruch einlegen, indem sie eine E-Mail an support@schnell.com senden oder die Funktion „Entscheidung anfechten“ in der App verwenden. Einsprüche müssen den Namen des Nutzers, die Kontodaten und alle unterstützenden Beweise (z. B. Lieferprotokolle, Kommunikationsprotokolle) enthalten. Schnell wird Einsprüche innerhalb von 10 Werktagen prüfen und eine schriftliche Antwort geben. Die Entscheidungen sind endgültig, können aber für Geschäftspartner an einen unabhängigen Mediator weitergeleitet werden. **12.4 Leistungsüberwachung** - Wir überwachen die Leistung der Nutzer, um Qualität und Sicherheit zu gewährleisten. Kunden und Fahrer erhalten Bewertungen, die auf Rückmeldungen voneinander basieren. Eine schlechte Leistung (z. B. häufige Stornierungen, schlechte Kommunikation) kann zu Warnungen vor einer Sperrung oder Kündigung führen. Nutzer werden per E-Mail oder In-App-Benachrichtigungen über Leistungsprobleme informiert und erhalten 7 Tage Zeit, sich zu verbessern, bevor weitere Maßnahmen ergriffen werden.
es: shnell Logistics se reserva el derecho de suspender o cancelar cuentas para garantizar la integridad de la plataforma, la seguridad y el cumplimiento de nuestros Términos de uso. **12.1 Suspensión de la cuenta** - **Motivos de suspensión**: Infracciones de nuestros Términos de uso, como proporcionar información falsa, participar en acoso o transportar artículos prohibidos. Detección de fraude, acceso no autorizado o intentos de manipular las calificaciones o las ganancias. Requisitos de las fuerzas del orden o los organismos reguladores para suspender una cuenta en espera de una investigación. Los conductores con calificaciones constantemente bajas (por debajo de 3.0 de 5.0 por 10 entregas consecutivas) o cancelaciones frecuentes pueden ser suspendidos. Los clientes que cancelan con frecuencia sus envíos corren el riesgo de sufrir restricciones temporales o la suspensión de la cuenta. - **Proceso**: Los usuarios suspendidos reciben un correo electrónico y una notificación en la aplicación que detallan el motivo, la duración (por ejemplo, 7 días, 30 días) y las instrucciones de apelación. Durante la suspensión, los usuarios no pueden reservar ni aceptar nuevos servicios, pero pueden acceder a su cuenta para ver el historial o enviar apelaciones. Las suspensiones se revisan periódicamente y las cuentas pueden ser restablecidas tras la resolución del problema (por ejemplo, liquidación de pagos, cumplimiento de políticas). **12.2 Terminación de la cuenta** - **Motivos de terminación**: Participar en un fraude deliberado, como falsificar confirmaciones de entrega o detalles de pago. Acoso, discriminación o violencia hacia otros usuarios, el personal de shnell o terceros. Transporte de mercancías ilegales, violación de las leyes de transporte o participación en conductas delictivas. Múltiples suspensiones sin acción correctiva. - **Proceso**: Los usuarios con cuentas terminadas reciben un aviso detallado por correo electrónico y una notificación en la aplicación, a menos que lo prohíba la ley (por ejemplo, investigaciones en curso). Al momento de la terminación, se cancelan todas las entregas programadas y los reembolsos a los clientes se procesan en un plazo de 7 días hábiles. Los saldos de crédito restantes de los conductores (después de las deducciones de comisiones) se pagan en un plazo de 30 días, sujeto a verificación. Las cuentas terminadas no se pueden reactivar, pero los usuarios pueden apelar para una reconsideración. **12.3 Proceso de apelaciones** - Los usuarios pueden apelar las suspensiones o terminaciones dentro de los **14 días** posteriores a la notificación enviando un correo electrónico a support@shnell.com o utilizando la función "Apelar decisión" de la Aplicación. Las apelaciones deben incluir el nombre del usuario, los detalles de la cuenta y cualquier evidencia de respaldo (por ejemplo, registros de entrega, registros de comunicación). shnell revisará las apelaciones en un plazo de 10 días hábiles y proporcionará una respuesta por escrito. Las decisiones son definitivas, pero pueden ser escaladas a un mediador independiente para Socios comerciales. **12.4 Supervisión del rendimiento** - Supervisamos el rendimiento de los usuarios para garantizar la calidad y la seguridad. Los Clientes y los Conductores reciben calificaciones basadas en los comentarios de los demás. Un bajo rendimiento (por ejemplo, cancelaciones frecuentes, mala comunicación) puede desencadenar advertencias antes de la suspensión o la terminación. Se notifica a los usuarios sobre los problemas de rendimiento por correo electrónico o alertas en la aplicación y se les da 7 días para mejorar antes de tomar medidas adicionales.
pt: A shnell Logistics reserva-se o direito de suspender ou rescindir contas para garantir a integridade da plataforma, a segurança e o cumprimento dos nossos Termos de Utilização. **12.1 Suspensão de conta** - **Motivos para suspensão**: Violações dos nossos Termos de Utilização, como o fornecimento de informações falsas, envolvimento em assédio ou transporte de artigos proibidos. Deteção de fraude, acesso não autorizado ou tentativas de manipular classificações ou ganhos. Pedidos de agências de aplicação da lei ou regulamentares para suspender uma conta enquanto uma investigação está em andamento. Motoristas com classificações consistentemente baixas (abaixo de 3,0 em 5,0 para 10 entregas consecutivas) ou cancelamentos frequentes podem enfrentar suspensão. Os Clientes que cancelam frequentemente os seus envios correm o risco de restrições temporárias ou suspensão da conta. - **Processo**: Os utilizadores suspensos receberão um e-mail e uma notificação na aplicação detalhando o motivo, a duração (por exemplo, 7 dias, 30 dias) e as instruções para recurso. Durante a suspensão, os utilizadores não podem reservar ou aceitar novos serviços, mas podem aceder à sua conta para ver o histórico ou submeter recursos. As suspensões são revistas regularmente e as contas podem ser restabelecidas se o problema for resolvido (por exemplo, liquidação do pagamento, conformidade com a política). **12.2 Rescisão da conta** - **Motivos para rescisão**: Envolvimento em atividades fraudulentas deliberadas, como a falsificação de confirmações de entrega ou detalhes de pagamento. Assédio, discriminação ou violência contra outros utilizadores, funcionários da shnell ou terceiros. Transporte de artigos ilegais, violação das leis de transporte ou envolvimento em conduta criminosa. Múltiplas suspensões sem ação corretiva. - **Processo**: Os utilizadores com contas rescindidas recebem uma notificação detalhada por e-mail e na aplicação, a menos que seja proibido por lei (por exemplo, uma investigação em curso). Após a rescisão, todas as entregas agendadas são canceladas e os reembolsos para os Clientes são processados no prazo de 7 dias úteis. Os saldos de crédito restantes dos Motoristas (após deduções de comissão) serão pagos no prazo de 30 dias após a verificação. As contas rescindidas não podem ser reativadas, mas os utilizadores podem apresentar um recurso para uma revisão. **12.3 Processo de recurso** - Os utilizadores podem recorrer de suspensões ou rescisões no prazo de **14 dias** a partir da notificação, enviando um e-mail para support@shnell.com ou utilizando a funcionalidade "Recorrer da decisão" da App. Os recursos devem incluir o nome de utilizador, os detalhes da conta e quaisquer provas de apoio (por exemplo, registos de entrega, registos de comunicação). A shnell irá rever o recurso no prazo de 10 dias úteis e fornecer uma resposta por escrito. A decisão é final, mas pode ser escalada para um mediador independente para Parceiros de Negócio. **12.4 Monitorização do desempenho** - Monitorizamos o desempenho do utilizador para garantir a qualidade e a segurança. Os Clientes e os Motoristas recebem classificações com base no feedback uns dos outros. O desempenho insatisfatório (por exemplo, cancelamentos frequentes, má comunicação) pode desencadear avisos antes da suspensão ou rescisão. Os utilizadores serão notificados sobre problemas de desempenho por e-mail ou alertas na aplicação e terão 7 dias para melhorar antes que sejam tomadas medidas adicionais.
zh: shnell Logistics 保留暂停或终止账户的权利，以确保平台完整性、安全性和遵守我们的使用条款。 **12.1 账户暂停** - **暂停原因**：违反我们的使用条款，例如提供虚假信息、参与骚扰或运输违禁物品。检测到欺诈、未经授权的访问或试图操纵评分或收入。执法部门或监管机构要求在调查期间暂停账户。评分持续偏低（在 10 次连续投递中低于 5.0 分中的 3.0 分）或频繁取消的司机可能会面临暂停。频繁取消发货的客户可能会面临临时限制或账户暂停的风险。 - **流程**：被暂停的用户将收到一封电子邮件和应用内通知，详细说明原因、期限（例如，7 天、30 天）和申诉说明。在暂停期间，用户无法预订或接受新服务，但可以访问其账户以查看历史记录或提交申诉。暂停会定期审查，如果问题得到解决（例如，结清款项、遵守政策），账户可能会恢复。 **12.2 账户终止** - **终止原因**：参与故意欺诈活动，例如伪造投递确认或付款详细信息。对其他用户、shnell 员工或第三方进行骚扰、歧视或暴力。运输非法物品、违反运输法律或参与犯罪活动。多次暂停而未采取纠正措施。 - **流程**：被终止的用户将通过电子邮件和应用内通知收到详细通知，除非法律禁止（例如，正在进行的调查）。终止后，所有预定的投递都将被取消，客户的退款将在 7 个工作日内处理。司机的剩余信用余额（扣除佣金后）将在验证后 30 天内支付。终止的账户无法重新激活，但用户可以提出申诉以进行重新审查。 **12.3 申诉流程** - 用户可以在通知后 **14 天内**通过向 support@shnell.com 发送电子邮件或使用应用程序中的“对决定提出申诉”功能来申诉暂停或终止。申诉必须包括用户名、账户详细信息和任何支持证据（例如，投递记录、通信日志）。shnell 将在 10 个工作日内审查申诉并提供书面答复。该决定是最终的，但对于商业合作伙伴，可以升级到独立调解员。 **12.4 性能监控** - 我们监控用户性能以确保质量和安全。客户和司机都会根据彼此的反馈获得评分。表现不佳（例如，频繁取消、沟通不畅）可能会在暂停或终止之前触发警告。用户将通过电子邮件或应用内警报收到有关性能问题的通知，并有 7 天时间进行改进，之后才会采取进一步行动。

# driverPerformanceHeading
source: 13. Driver Performance Display and Deal Acceptance
ar: 13. عرض أداء السائق وقبول الصفقات
de: 13. Anzeige der Fahrerleistung und Angebotsannahme
es: 13. Visualización del rendimiento del conductor y aceptación de ofertas
pt: 13. Visualização do desempenho do motorista e aceitação da oferta
zh: 13. 司机表现展示和接受报价

# driverPerformanceBody
source: Schnell Logistics empowers Drivers with the autonomy to make informed decisions about accepting delivery requests, supported by transparent performance data.
ar: تمنح شركة شنيل اللوجستية السائقين الاستقلالية لاتخاذ قرارات مستنيرة بشأن قبول طلبات التوصيل، مدعومة ببيانات أداء شفافة.
de: Schnell Logistics befähigt Fahrer, fundierte Entscheidungen über die Annahme von Lieferanfragen zu treffen, unterstützt durch transparente Leistungsdaten.
es: shnell Logistics capacita a los Conductores para que tomen decisiones informadas sobre la aceptación de las solicitudes de entrega, respaldadas por datos de rendimiento transparentes.
pt: A shnell Logistics capacita os Motoristas a tomar decisões informadas sobre a aceitação de pedidos de entrega, apoiadas por dados de desempenho transparentes.
zh: shnell Logistics 使司机能够根据透明的表现数据做出关于接受投递请求的明智决定。

source: Pickup Location
ar: موقع الاستلام
de: Abholort
es: Lugar de recogida
pt: Local de coleta
zh: 取货地点

# whereDoYouWantToGo
source: Where would you like to go?
ar: إلى أين تريد الذهاب؟
de: Wohin möchten Sie gehen?
es: ¿A dónde te gustaría ir?
pt: Para onde você gostaria de ir?
zh: 你想去哪里？

source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
pt: Tentar novamente
zh: 重试

# selectLocationTitle
source: Select {type} Location
ar: اختر موقع {type}
de: Standort für {type} auswählen
es: Seleccionar ubicación de {type}
pt: Selecionar local de {type}
zh: 选择 {type} 地点

source: Search for a location
ar: البحث عن موقع
de: Nach einem Ort suchen
es: Buscar una ubicación
pt: Procurar um local
zh: 搜索位置

source: Use current location
ar: استخدام الموقع الحالي
de: Aktuellen Standort verwenden
es: Usar ubicación actual
pt: Usar localização atual
zh: 使用当前位置

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
pt: Cancelar
zh: 取消

source: Pickup
ar: نقطة الانطلاق
de: Abholung
es: Recogida
pt: Retirada
zh: 取货地

source: Destination
ar: الوجهة
de: Ziel
es: Destino
pt: Destino
zh: 目的地

# destinationWithNumber
source: Destination {number}
ar: الوجهة {number}
de: Ziel {number}
es: Destino {number}
pt: Destino {number}
zh: 目的地 {number}

# osrmError
source: OSRM unavailable, trying with Google Maps: {e}
ar: OSRM غير متاح، جارٍ المحاولة باستخدام خرائط جوجل: {e}
de: OSRM nicht verfügbar, versuche es mit Google Maps: {e}
es: OSRM no disponible, intentando con Google Maps: {e}
pt: OSRM indisponível, tentando com Google Maps: {e}
zh: OSRM 不可用，正在尝试使用谷歌地图：{e}

# googleDirectionsError
source: Google Directions API Error: {error}
ar: خطأ في خدمة خرائط جوجل: {error}
de: Google Directions API-Fehler: {error}
es: Error de la API de Google Directions: {error}
pt: Erro da API Google Directions: {error}
zh: Google Directions API错误: {error}

# googleHttpError
source: HTTP Request Error: Status code {statusCode}
ar: خطأ في طلب HTTP: رمز الحالة {statusCode}
de: HTTP-Anforderungsfehler: Statuscode {statusCode}
es: Error de solicitud HTTP: Código de estado {statusCode}
pt: Erro de solicitação HTTP: Código de status {statusCode}
zh: HTTP请求错误: 状态码 {statusCode}

# googleNetworkError
source: Network Error: {error}
ar: خطأ في الشبكة: {error}
de: Netzwerkfehler: {error}
es: Error de red: {error}
pt: Erro de rede: {error}
zh: 网络错误: {error}

# locationServiceDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة.
de: Standortdienste sind deaktiviert.
es: Los servicios de ubicación están deshabilitados.
pt: Serviços de localização desabilitados.
zh: 位置服务已禁用。

source: Location permission denied.
ar: تم رفض إذن الموقع.
de: Standortberechtigung verweigert.
es: Permiso de ubicación denegado.
pt: Permissão de localização negada.
zh: 位置权限被拒绝。

source: Location permission denied forever.
ar: تم رفض إذن الموقع بشكل دائم.
de: Standortberechtigung dauerhaft verweigert.
es: Permiso de ubicación denegado permanentemente.
pt: Permissão de localização negada permanentemente.
zh: 位置权限被永久拒绝。

# locationRetrievalError
source: Error retrieving position: {e}
ar: خطأ في استرداد الموقع: {e}
de: Fehler beim Abrufen der Position: {e}
es: Error al recuperar la posición: {e}
pt: Erro ao recuperar a posição: {e}
zh: 检索位置时出错：{e}

# geocodingNetworkError
source: Network error during geocoding: {e}
ar: خطأ في الشبكة أثناء الترميز الجغرافي: {e}
de: Netzwerkfehler beim Geocoding: {e}
es: Error de red durante la geocodificación: {e}
pt: Erro de rede durante a geocodificação: {e}
zh: 地理编码时网络出错：{e}

# locationCoordinatesError
source: Could not determine location coordinates.
ar: تعذر تحديد إحداثيات الموقع.
de: Koordinaten des Standorts konnten nicht ermittelt werden.
es: No se pudieron determinar las coordenadas de la ubicación.
pt: Não foi possível determinar as coordenadas de localização.
zh: 无法确定位置坐标。

# definePickupFirst
source: Please define the pickup location first.
ar: الرجاء تحديد موقع الالتقاء أولاً.
de: Bitte definieren Sie zuerst den Abholort.
es: Por favor, defina primero el lugar de recogida.
pt: Por favor, defina o local de partida primeiro.
zh: 请先定义取货地点。

# definePreviousDestinationFirst
source: Please define the previous destination first.
ar: الرجاء تحديد الوجهة السابقة أولاً.
de: Bitte definieren Sie zuerst das vorherige Ziel.
es: Por favor, defina primero el destino anterior.
pt: Por favor, defina o destino anterior primeiro.
zh: 请先定义上一个目的地。

# maxDestinationsReached
source: Maximum of {count} destinations reached.
ar: تم الوصول إلى الحد الأقصى للوجهات وهو {count}.
de: Maximal {count} Ziele erreicht.
es: Se ha alcanzado un máximo de {count} destinos.
pt: Máximo de {count} destinos atingido.
zh: 已达到最大目的地数 {count}。

# confirmReorderTitle
source: Confirm Reordering
ar: تأكيد إعادة الترتيب
de: Neuordnung bestätigen
es: Confirmar reordenamiento
pt: Confirmar Reordenação
zh: 确认重新排序
