Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# infoCollectionBody
source: We collect various types of information to provide, improve, and personalize our services. The information we collect falls into the following categories: **2.1 Information You Provide Directly** When you interact with the App, you may provide the following types of personal information: - **Account Creation**: When registering as a Customer or Driver, you provide details such as your full name, email address, phone number, and, for Drivers, a valid national ID (e.g., CIN for Tunisian residents) or driver’s license number. Business Partners provide company details, including business name, registration number, and contact information. - **Profile Information**: Customers may provide delivery preferences and addresses. Drivers provide vehicle details (e.g., type, capacity, license plate), professional certifications, and banking information for payments. - **Service Requests**: Customers submit details about their logistics needs, such as package size, weight, pickup and delivery locations, and special instructions (e.g., fragile items or time-sensitive deliveries). - **Communication Data**: Information provided when you contact our support team via email, in-app chat, or phone, including your messages, inquiries, and feedback. - **Business Partner Data**: For B2B clients, we collect additional details such as tax identification numbers, contract details, and logistics requirements (e.g., fleet size, delivery schedules). **2.2 Information Collected Automatically** We automatically collect certain information when you use the App to enhance functionality and improve user experience: - **Device Information**: We collect data about your device, including device type (e.g., iOS or Android), operating system version, unique device identifiers (e.g., UDID or IMEI), IP address, and browser type. - **Location Data**: With your consent, we collect real-time geolocation data to enable features such as tracking shipments, matching Drivers with Customers, and optimizing delivery routes. Customers’ pickup and delivery locations are stored for service fulfillment. - **Usage Data**: We track how you interact with the App, including pages visited, features used (e.g., tracking, quote requests), time spent, and click patterns. - **Log Data**: Server logs capture technical details such as API calls, error reports, and timestamps to monitor App performance and troubleshoot issues. - **Cookies and Tracking Technologies**: Our website uses cookies, web beacons, and similar technologies to track user behavior, personalize content, and analyze traffic. You can manage cookie preferences via your browser settings. **2.3 Information from Third Parties** We may receive information from third-party sources to enhance our services or comply with legal obligations: - **Mapping Services**: Mapbox provides location-based data to optimize routing and display maps within the App. - **Analytics Providers**: Tools like Firebase Analytics provide aggregated data on user behavior and App performance. - **Verification Services**: For Drivers, we use third-party services to verify identity, driving records, and vehicle compliance with safety regulations. - **Business Partners**: B2B clients may share employee or contractor data (e.g., contact details) to facilitate logistics coordination. **2.4 Sensitive Information** We may collect sensitive information, such as national ID numbers, only with your explicit consent or as required by law. We take additional measures to protect this data, as outlined in Section 5 (Data Security).
ar: نجمع أنواعًا مختلفة من المعلومات لتقديم خدماتنا وتحسينها وتخصيصها. تندرج المعلومات التي نجمعها في الفئات التالية: **2.1 المعلومات التي تقدمها مباشرة** عندما تتفاعل مع التطبيق، قد تقدم الأنواع التالية من المعلومات الشخصية: - **إنشاء الحساب**: عند التسجيل كعميل أو سائق، فإنك تقدم تفاصيل مثل اسمك الكامل، وعنوان بريدك الإلكتروني، ورقم هاتفك، وبالنسبة للسائقين، هوية وطنية سارية (مثل بطاقة التعريف الوطنية للمقيمين التونسيين) أو رقم رخصة القيادة. يقدم شركاء الأعمال تفاصيل الشركة، بما في ذلك الاسم التجاري ورقم التسجيل ومعلومات الاتصال. - **معلومات الملف الشخصي**: قد يقدم العملاء تفضيلات وعناوين التسليم. يقدم السائقون تفاصيل السيارة (مثل النوع، السعة، لوحة الترخيص)، والشهادات المهنية، والمعلومات المصرفية للدفع. - **طلبات الخدمة**: يقدم العملاء تفاصيل حول احتياجاتهم اللوجستية، مثل حجم الطرد، والوزن، ومواقع الاستلام والتسليم، والتعليمات الخاصة (مثل الأشياء الهشة أو التسليم العاجل). - **بيانات الاتصال**: المعلومات المقدمة عندما تتصل بفريق الدعم لدينا عبر البريد الإلكتروني أو الدردشة داخل التطبيق أو الهاتف، بما في ذلك رسائلك واستفساراتك وملاحظاتك. - **بيانات شركاء الأعمال**: بالنسبة للعملاء من الشركات، نجمع تفاصيل إضافية مثل أرقام التعريف الضريبي، وتفاصيل العقد، والمتطلبات اللوجستية (مثل حجم الأسطول، وجداول التسليم). **2.2 المعلومات التي يتم جمعها تلقائيًا** نجمع تلقائيًا معلومات معينة عند استخدامك التطبيق لتحسين الوظائف وتجربة المستخدم: - **معلومات الجهاز**: نجمع بيانات حول جهازك، بما في ذلك نوع الجهاز (مثل iOS أو Android)، وإصدار نظام التشغيل، ومعرفات الجهاز الفريدة (مثل UDID أو IMEI)، وعنوان IP، ونوع المتصفح. - **بيانات الموقع**: بموافقتك، نجمع بيانات الموقع الجغرافي في الوقت الفعلي لتمكين ميزات مثل تتبع الشحنات، ومطابقة السائقين مع العملاء، وتحسين مسارات التسليم. يتم تخزين مواقع الاستلام والتسليم الخاصة بالعملاء لإتمام الخدمة. - **بيانات الاستخدام**: نتتبع كيفية تفاعلك مع التطبيق، بما في ذلك الصفحات التي تمت زيارتها، والميزات المستخدمة (مثل التتبع، وطلبات الأسعار)، والوقت الذي تقضيه، وأنماط النقرات. - **بيانات السجل**: تلتقط سجلات الخادم التفاصيل الفنية مثل استدعاءات API، وتقارير الأخطاء، والطوابع الزمنية لمراقبة أداء التطبيق واستكشاف المشكلات وإصلاحها. - **ملفات تعريف الارتباط وتقنيات التتبع**: يستخدم موقعنا الإلكتروني ملفات تعريف الارتباط، وإشارات الويب، والتقنيات المماثلة لتتبع سلوك المستخدم، وتخصيص المحتوى، وتحليل حركة المرور. يمكنك إدارة تفضيلات ملفات تعريف الارتباط عبر إعدادات متصفحك. **2.3 معلومات من أطراف ثالثة** قد نتلقى معلومات من مصادر خارجية لتحسين خدماتنا أو الامتثال للالتزامات القانونية: - **خدمات الخرائط**: توفر Mapbox بيانات قائمة على الموقع لتحسين التوجيه وعرض الخرائط داخل التطبيق. - **مقدمو التحليلات**: توفر أدوات مثل Firebase Analytics بيانات مجمعة عن سلوك المستخدم وأداء التطبيق. - **خدمات التحقق**: بالنسبة للسائقين، نستخدم خدمات طرف ثالث للتحقق من الهوية، وسجلات القيادة، وامتثال السيارة للوائح السلامة. - **شركاء الأعمال**: قد يشارك العملاء من الشركات بيانات الموظفين أو المقاولين (مثل تفاصيل الاتصال) لتسهيل التنسيق اللوجستي. **2.4 المعلومات الحساسة** قد نجمع معلومات حساسة، مثل أرقام الهوية الوطنية، فقط بموافقتك الصريحة أو كما يقتضي القانون. نتخذ تدابير إضافية لحماية هذه البيانات، كما هو موضح في القسم 5 (أمن البيانات).
de: Wir sammeln verschiedene Arten von Informationen, um unsere Dienste bereitzustellen, zu verbessern und zu personalisieren. Die von uns gesammelten Informationen fallen in die folgenden Kategorien: **2.1 Informationen, die Sie direkt bereitstellen** Wenn Sie mit der App interagieren, können Sie die folgenden Arten von persönlichen Informationen bereitstellen: - **Kontoerstellung**: Bei der Registrierung als Kunde oder Fahrer geben Sie Details wie Ihren vollständigen Namen, Ihre E-Mail-Adresse, Ihre Telefonnummer und, für Fahrer, einen gültigen nationalen Ausweis (z. B. CIN für tunesische Einwohner) oder eine Führerscheinnummer an. Geschäftspartner geben Unternehmensdetails an, einschließlich Firmenname, Registrierungsnummer und Kontaktinformationen. - **Profilinformationen**: Kunden können Lieferpräferenzen und Adressen angeben. Fahrer geben Fahrzeugdetails (z. B. Typ, Kapazität, Nummernschild), berufliche Zertifizierungen und Bankinformationen für Zahlungen an. - **Dienstanfragen**: Kunden übermitteln Details zu ihren Logistikanforderungen, wie z. B. Paketgröße, Gewicht, Abhol- und Lieferorte sowie spezielle Anweisungen (z. B. zerbrechliche Gegenstände oder zeitkritische Lieferungen). - **Kommunikationsdaten**: Informationen, die Sie bei der Kontaktaufnahme mit unserem Support-Team per E-Mail, In-App-Chat oder Telefon bereitstellen, einschließlich Ihrer Nachrichten, Anfragen und Rückmeldungen. - **Daten von Geschäftspartnern**: Für B2B-Kunden sammeln wir zusätzliche Details wie Steuernummern, Vertragsdetails und Logistikanforderungen (z. B. Fuhrparkgröße, Lieferpläne). **2.2 Automatisch gesammelte Informationen** Wir sammeln automatisch bestimmte Informationen, wenn Sie die App nutzen, um die Funktionalität zu verbessern und die Benutzererfahrung zu optimieren: - **Geräteinformationen**: Wir sammeln Daten über Ihr Gerät, einschließlich Gerätetyp (z. B. iOS oder Android), Betriebssystemversion, eindeutige Geräte-IDs (z. B. UDID oder IMEI), IP-Adresse und Browsertyp. - **Standortdaten**: Mit Ihrer Zustimmung sammeln wir Echtzeit-Geolokalisierungsdaten, um Funktionen wie die Verfolgung von Sendungen, die Zuordnung von Fahrern zu Kunden und die Optimierung von Lieferrouten zu ermöglichen. Die Abhol- und Lieferorte der Kunden werden zur Serviceerfüllung gespeichert. - **Nutzungsdaten**: Wir verfolgen, wie Sie mit der App interagieren, einschließlich besuchter Seiten, verwendeter Funktionen (z. B. Verfolgung, Angebotsanfragen), verbrachter Zeit und Klickmuster. - **Protokolldaten**: Serverprotokolle erfassen technische Details wie API-Aufrufe, Fehlerberichte und Zeitstempel, um die App-Leistung zu überwachen und Probleme zu beheben. - **Cookies und Tracking-Technologien**: Unsere Website verwendet Cookies, Web-Beacons und ähnliche Technologien, um das Nutzerverhalten zu verfolgen, Inhalte zu personalisieren und den Traffic zu analysieren. Sie können die Cookie-Einstellungen über die Einstellungen Ihres Browsers verwalten. **2.3 Informationen von Dritten** Wir können Informationen von Drittquellen erhalten, um unsere Dienste zu verbessern oder rechtlichen Verpflichtungen nachzukommen: - **Kartendienste**: Mapbox stellt standortbasierte Daten zur Verfügung, um das Routing zu optimieren und Karten in der App anzuzeigen. - **Analyseanbieter**: Tools wie Firebase Analytics stellen aggregierte Daten zum Nutzerverhalten und zur App-Leistung bereit. - **Verifizierungsdienste**: Für Fahrer nutzen wir Drittanbieterdienste, um die Identität, die Fahrhistorie und die Einhaltung der Sicherheitsvorschriften des Fahrzeugs zu überprüfen. - **Geschäftspartner**: B2B-Kunden können Mitarbeiter- oder Auftragnehmerdaten (z. B. Kontaktdaten) weitergeben, um die logistische Koordination zu erleichtern. **2.4 Sensible Informationen** Wir können sensible Informationen, wie z. B. nationale Ausweisnummern, nur mit Ihrer ausdrücklichen Zustimmung oder wie gesetzlich vorgeschrieben sammeln. Wir ergreifen zusätzliche Maßnahmen zum Schutz dieser Daten, wie in Abschnitt 5 (Datensicherheit) dargelegt.
es: Recopilamos varios tipos de información para proporcionar, mejorar y personalizar nuestros servicios. La información que recopilamos se divide en las siguientes categorías: **2.1 Información que usted proporciona directamente** Cuando interactúa con la Aplicación, puede proporcionar los siguientes tipos de información personal: - **Creación de cuenta**: Al registrarse como Cliente o Conductor, usted proporciona detalles como su nombre completo, dirección de correo electrónico, número de teléfono y, para los Conductores, una identificación nacional válida (por ejemplo, CIN para residentes tunecinos) o un número de licencia de conducir. Los Socios comerciales proporcionan detalles de la empresa, incluido el nombre comercial, el número de registro y la información de contacto. - **Información del perfil**: Los Clientes pueden proporcionar preferencias y direcciones de entrega. Los Conductores proporcionan detalles del vehículo (por ejemplo, tipo, capacidad, matrícula), certificaciones profesionales e información bancaria para los pagos. - **Solicitudes de servicio**: Los Clientes envían detalles sobre sus necesidades logísticas, como el tamaño del paquete, el peso, las ubicaciones de recogida y entrega, y las instrucciones especiales (por ejemplo, artículos frágiles o entregas urgentes). - **Datos de comunicación**: Información proporcionada cuando se pone en contacto con nuestro equipo de soporte por correo electrónico, chat en la aplicación o teléfono, incluidos sus mensajes, consultas y comentarios. - **Datos de socios comerciales**: Para los clientes B2B, recopilamos detalles adicionales como números de identificación fiscal, detalles del contrato y requisitos de logística (por ejemplo, tamaño de la flota, horarios de entrega). **2.2 Información recopilada automáticamente** Recopilamos automáticamente cierta información cuando utiliza la Aplicación para mejorar la funcionalidad y la experiencia del usuario: - **Información del dispositivo**: Recopilamos datos sobre su dispositivo, incluido el tipo de dispositivo (por ejemplo, iOS o Android), la versión del sistema operativo, los identificadores únicos del dispositivo (por ejemplo, UDID o IMEI), la dirección IP y el tipo de navegador. - **Datos de ubicación**: Con su consentimiento, recopilamos datos de geolocalización en tiempo real para habilitar funciones como el seguimiento de envíos, la asignación de Conductores a Clientes y la optimización de las rutas de entrega. Las ubicaciones de recogida y entrega de los Clientes se almacenan para la prestación del servicio. - **Datos de uso**: Hacemos un seguimiento de cómo interactúa con la Aplicación, incluidas las páginas visitadas, las funciones utilizadas (por ejemplo, seguimiento, solicitudes de presupuesto), el tiempo dedicado y los patrones de clics. - **Datos de registro**: Los registros del servidor capturan detalles técnicos como llamadas a la API, informes de errores y marcas de tiempo para supervisar el rendimiento de la Aplicación y solucionar problemas. - **Cookies y tecnologías de seguimiento**: Nuestro sitio web utiliza cookies, balizas web y tecnologías similares para rastrear el comportamiento del usuario, personalizar el contenido y analizar el tráfico. Puede administrar las preferencias de cookies a través de la configuración de su navegador. **2.3 Información de terceros** Podemos recibir información de fuentes de terceros para mejorar nuestros servicios o cumplir con las obligaciones legales: - **Servicios de mapas**: Mapbox proporciona datos basados en la ubicación para optimizar el enrutamiento y mostrar mapas dentro de la Aplicación. - **Proveedores de análisis**: Herramientas como Firebase Analytics proporcionan datos agregados sobre el comportamiento del usuario y el rendimiento de la Aplicación. - **Servicios de verificación**: Para los Conductores, utilizamos servicios de terceros para verificar la identidad, los antecedentes de conducción y el cumplimiento del vehículo con las regulaciones de seguridad. - **Socios comerciales**: Los clientes B2B pueden compartir datos de empleados o contratistas (por ejemplo, detalles de contacto) para facilitar la coordinación logística. **2.4 Información sensible** Podemos recopilar información sensible, como números de identificación nacional, solo con su consentimiento explícito o según lo exija la ley. Tomamos medidas adicionales para proteger estos datos, como se describe en la Sección 5 (Seguridad de los datos).
pt: Recolhemos vários tipos de informações para fornecer, melhorar e personalizar os nossos serviços. As informações que recolhemos enquadram-se nas seguintes categorias: **2.1 Informações que fornece diretamente** Quando interage com o App, pode fornecer os seguintes tipos de informações pessoais: - **Criação de conta**: Ao registar-se como Cliente ou Motorista, fornece detalhes como o seu nome completo, endereço de e-mail, número de telefone e, para os Motoristas, um documento de identificação nacional válido (por exemplo, CIN para residentes na Tunísia) ou o número da carta de condução. Os Parceiros de Negócio fornecem detalhes da empresa, incluindo o nome, o número de registo e as informações de contacto. - **Informações de perfil**: Os Clientes podem fornecer preferências e endereços de entrega. Os Motoristas fornecem detalhes do veículo (por exemplo, tipo, capacidade, matrícula), certificações profissionais e informações bancárias para pagamentos. - **Pedidos de serviço**: Os Clientes enviam detalhes sobre as suas necessidades de logística, como o tamanho do pacote, o peso, os locais de recolha e entrega, e instruções especiais (por exemplo, artigos frágeis ou entregas urgentes). - **Dados de comunicação**: Informações fornecidas quando contacta a nossa equipa de suporte por e-mail, chat na aplicação ou telefone. Isto inclui as suas mensagens, perguntas e feedback. - **Dados de parceiros de negócio**: Para clientes B2B, recolhemos detalhes adicionais, como números de identificação fiscal, detalhes do contrato e requisitos de logística (por exemplo, dimensão da frota, horários de entrega). **2.2 Informações recolhidas automaticamente** Para melhorar a funcionalidade da App e a experiência do utilizador, recolhemos automaticamente certas informações quando utiliza o App: - **Informações do dispositivo**: Recolhemos dados sobre o seu dispositivo, incluindo o tipo de dispositivo (por exemplo, iOS ou Android), a versão do sistema operativo, identificadores únicos do dispositivo (por exemplo, UDID ou IMEI), endereço IP e tipo de navegador. - **Dados de localização**: Com o seu consentimento, recolhemos dados de geolocalização em tempo real para ativar funcionalidades como o rastreamento de encomendas, a correspondência de Motoristas com Clientes e a otimização de rotas de entrega. Os locais de recolha e entrega dos Clientes são guardados para a execução do serviço. - **Dados de utilização**: Rastreámos a forma como interage com o App, incluindo as páginas visitadas, as funcionalidades utilizadas (por exemplo, rastreamento, pedidos de orçamento), o tempo gasto e os padrões de clique. - **Dados de registo**: Os registos do servidor capturam detalhes técnicos como chamadas de API, relatórios de erros e carimbos de data/hora para monitorizar o desempenho da App e resolver problemas. - **Cookies e tecnologias de rastreamento**: O nosso website utiliza cookies, web beacons e tecnologias semelhantes para rastrear o comportamento do utilizador, personalizar o conteúdo e analisar o tráfego. Pode gerir as suas preferências de cookies através das definições do seu navegador. **2.3 Informações de terceiros** Podemos receber informações de fontes de terceiros para melhorar os nossos serviços ou cumprir obrigações legais: - **Serviços de mapeamento**: A Mapbox fornece dados baseados na localização para otimizar o roteamento e exibir mapas dentro da App. - **Fornecedores de análise**: Ferramentas como o Firebase Analytics fornecem dados agregados sobre o comportamento do utilizador e o desempenho da App. - **Serviços de verificação**: Para os Motoristas, utilizamos serviços de terceiros para verificar a identidade, o histórico de condução e a conformidade do veículo com os regulamentos de segurança. - **Parceiros de negócio**: Os clientes B2B podem partilhar dados de funcionários ou contratados (por exemplo, detalhes de contacto) para facilitar a coordenação logística. **2.4 Informações sensíveis** Podemos recolher informações sensíveis, como números de identificação nacional, apenas com o seu consentimento explícito ou se exigido por lei. Tomamos medidas adicionais para proteger esses dados, conforme descrito na Secção 5 (Segurança dos dados).
zh: 我们收集各种类型的信息，以提供、改进和个性化我们的服务。我们收集的信息分为以下几类： **2.1 您直接提供的信息** 当您与应用程序互动时，您可能会提供以下类型的个人信息： - **账户创建**：当您注册为客户或司机时，您将提供您的全名、电子邮件地址、电话号码以及（对于司机）有效的国民身份证件（例如，突尼斯居民的 CIN）或驾驶执照号码等详细信息。商业合作伙伴将提供公司详细信息，包括公司名称、注册号和联系信息。 - **个人资料信息**：客户可能会提供投递偏好和地址。司机将提供车辆详细信息（例如，类型、容量、车牌）、专业资格和用于付款的银行信息。 - **服务请求**：客户提交其物流需求的详细信息，例如包裹尺寸、重量、取货和投递地点以及特殊说明（例如，易碎物品或限时投递）。 - **通信数据**：当您通过电子邮件、应用内聊天或电话联系我们的支持团队时提供的信息。这包括您的消息、查询和反馈。 - **商业合作伙伴数据**：对于 B2B 客户，我们收集其他详细信息，例如税务识别号、合同详细信息和物流要求（例如，车队规模、投递时间表）。 **2.2 自动收集的信息** 为了增强应用程序的功能和改善用户体验，当您使用应用程序时，我们会自动收集某些信息： - **设备信息**：我们收集有关您设备的数据，包括设备类型（例如，iOS 或 Android）、操作系统版本、唯一设备标识符（例如，UDID 或 IMEI）、IP 地址和浏览器类型。 - **位置数据**：在您同意的情况下，我们收集实时地理位置数据，以启用包裹追踪、将司机与客户匹配以及优化投递路线等功能。客户的取货和投递地点将保存以用于服务履行。 - **使用数据**：我们跟踪您如何与应用程序互动，包括访问的页面、使用的功能（例如，追踪、报价请求）、花费的时间和点击模式。 - **日志数据**：服务器日志会捕获技术详细信息，例如 API 调用、错误报告和时间戳，以监控应用程序性能和故障排除。 - **Cookie 和追踪技术**：我们的网站使用 Cookie、网络信标和类似技术来追踪用户行为、个性化内容和分析流量。您可以通过浏览器设置管理您的 Cookie 偏好。 **2.3 来自第三方的信息** 我们可能会从第三方来源接收信息，以改善我们的服务或遵守法律义务： - **地图服务**：Mapbox 提供基于位置的数据，以优化路线和在应用程序中显示地图。 - **分析提供商**：Firebase Analytics 等工具提供有关用户行为和应用程序性能的汇总数据。 - **验证服务**：对于司机，我们使用第三方服务来验证身份、驾驶记录和车辆是否符合安全法规。 - **商业合作伙伴**：B2B 客户可能会分享员工或承包商数据（例如，联系方式）以促进物流协调。 **2.4 敏感信息** 我们可能仅在获得您的明确同意或法律要求的情况下收集敏感信息，例如国民身份证号码。我们采取额外措施来保护此类数据，如第 5 节（数据安全）所述。

# infoUsageHeading
source: 3. How We Use Your Information
ar: 3. كيف نستخدم معلوماتك
de: 3. Wie wir Ihre Informationen verwenden
es: 3. Cómo utilizamos su información
pt: 3. Como utilizamos as suas informações
zh: 3. 我们如何使用您的信息
