Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# dataRightsBody
source: Depending on your location, you have certain rights regarding your personal data under applicable data protection laws, such as the GDPR, CCPA, or other regional regulations. **7.1 Right to Access** - You may request a copy of the personal data we hold about you, including details on how it is processed and shared. - To request access, contact support@schnell.com or use the “Data Request” feature in the App. We will respond within 30 days (or 45 days for complex requests). **7.2 Right to Correction** - If your personal data is inaccurate or incomplete, you may request corrections via the App’s profile settings or by contacting support. - We will update your information promptly and notify any third parties with whom the data was shared. **7.3 Right to Deletion** - You may request the deletion of your personal data, subject to legal retention requirements (e.g., tax records). - Deletion requests can be submitted via the App or by emailing support@schnell.com. We will confirm deletion within 30 days. **7.4 Right to Restrict Processing** - You may request that we limit the processing of your data (e.g., to storage only) if you contest its accuracy, lawfulness, or necessity. - Restricted data will not be used for active processing but may be retained for legal purposes. **7.5 Right to Data Portability** - You may request a machine-readable copy of your personal data (e.g., in CSV or JSON format) to transfer to another service. - We will provide this data within 30 days, free of charge, for standard requests. **7.6 Right to Object** - You may object to the processing of your data for marketing purposes or where processing is based on our legitimate interests. - To opt out of marketing, use the App’s settings or click “Unsubscribe” in promotional emails. **7.7 Right to Withdraw Consent** - Where processing is based on your consent (e.g., location data, marketing), you may withdraw consent at any time via the App or by contacting us. Withdrawal does not affect the lawfulness of prior processing. **7.8 Right to Non-Discrimination** - We will not discriminate against you for exercising your data protection rights, such as by charging higher prices or denying services. **7.9 Filing a Complaint** - If you believe we have violated your data protection rights, you may file a complaint with your local data protection authority (e.g., CNIL in France, ICO in the UK, or the California Attorney General’s office). - You may also contact us directly at support@schnell.com to resolve any concerns informally. **7.10 How to Exercise Your Rights** - Submit requests via the App’s “Data Request” feature or email support@schnell.com with your name, account details, and the specific right you wish to exercise. - We may require identity verification (e.g., a copy of your ID) to prevent unauthorized requests. - Responses will be provided in writing (via email or in-app notification) within the legally required timeframe.
ar: وفقًا لموقعك، لديك حقوق معينة فيما يتعلق ببياناتك الشخصية بموجب قوانين حماية البيانات المعمول بها، مثل اللائحة العامة لحماية البيانات (GDPR) أو قانون خصوصية المستهلك في كاليفورنيا (CCPA) أو اللوائح الإقليمية الأخرى. **7.1 الحق في الوصول** - يمكنك طلب نسخة من البيانات الشخصية التي نحتفظ بها عنك، بما في ذلك تفاصيل حول كيفية معالجتها ومشاركتها. - لطلب الوصول، اتصل بـ support@shnell.com أو استخدم ميزة "طلب البيانات" في التطبيق. سنرد في غضون 30 يومًا (أو 45 يومًا للطلبات المعقدة). **7.2 الحق في التصحيح** - إذا كانت بياناتك الشخصية غير دقيقة أو غير كاملة، يمكنك طلب تصحيحها عبر إعدادات الملف الشخصي في التطبيق أو عن طريق الاتصال بالدعم. - سنقوم بتحديث معلوماتك على الفور وإخطار أي أطراف ثالثة تمت مشاركة البيانات معها. **7.3 الحق في الحذف** - يمكنك طلب حذف بياناتك الشخصية، مع مراعاة متطلبات الاحتفاظ القانونية (مثل السجلات الضريبية). - يمكن تقديم طلبات الحذف عبر التطبيق أو عن طريق إرسال بريد إلكتروني إلى support@shnell.com. سنؤكد الحذف في غضون 30 يومًا. **7.4 الحق في تقييد المعالجة** - يمكنك أن تطلب منا تقييد معالجة بياناتك (مثل التخزين فقط) إذا كنت تعترض على دقتها أو قانونيتها أو ضرورتها. - لن يتم استخدام البيانات المقيدة للمعالجة النشطة ولكن يمكن الاحتفاظ بها لأغراض قانونية. **7.5 الحق في نقل البيانات** - يمكنك طلب نسخة قابلة للقراءة آليًا من بياناتك الشخصية (مثل بتنسيق CSV أو JSON) لنقلها إلى خدمة أخرى. - سنقدم هذه البيانات في غضون 30 يومًا، مجانًا، للطلبات القياسية. **7.6 الحق في الاعتراض** - يمكنك الاعتراض على معالجة بياناتك لأغراض التسويق أو عندما تستند المعالجة إلى مصالحنا المشروعة. - لإلغاء الاشتراك في التسويق، استخدم إعدادات التطبيق أو انقر فوق "إلغاء الاشتراك" في رسائل البريد الإلكتروني الترويجية. **7.7 الحق في سحب الموافقة** - عندما تستند المعالجة إلى موافقتك (مثل بيانات الموقع، التسويق)، يمكنك سحب الموافقة في أي وقت عبر التطبيق أو عن طريق الاتصال بنا. لا يؤثر السحب على قانونية المعالجة السابقة. **7.8 الحق في عدم التمييز** - لن نميز ضدك لممارستك حقوق حماية البيانات الخاصة بك، مثل فرض أسعار أعلى أو حرمانك من الخدمات. **7.9 تقديم شكوى** - إذا كنت تعتقد أننا انتهكنا حقوقك في حماية البيانات، يمكنك تقديم شكوى إلى هيئة حماية البيانات المحلية لديك (مثل CNIL في فرنسا، أو ICO في المملكة المتحدة، أو مكتب المدعي العام في كاليفورنيا). - يمكنك أيضًا الاتصال بنا مباشرة على support@shnell.com لحل أي مخاوف بشكل غير رسمي. **7.10 كيفية ممارسة حقوقك** - أرسل الطلبات عبر ميزة "طلب البيانات" في التطبيق أو أرسل بريدًا إلكترونيًا إلى support@shnell.com باسمك وتفاصيل حسابك والحق المحدد الذي ترغب في ممارسته. - قد نطلب التحقق من الهوية (مثل نسخة من هويتك) لمنع الطلبات غير المصرح بها. - سيتم تقديم الردود كتابة (عبر البريد الإلكتروني أو إشعار داخل التطبيق) في غضون الإطار الزمني المطلوب قانونًا.
de: Je nach Ihrem Standort haben Sie bestimmte Rechte in Bezug auf Ihre persönlichen Daten gemäß den geltenden Datenschutzgesetzen, wie z. B. der DSGVO, dem CCPA oder anderen regionalen Vorschriften. **7.1 Recht auf Zugang** - Sie können eine Kopie der persönlichen Daten anfordern, die wir über Sie gespeichert haben, einschließlich Details darüber, wie sie verarbeitet und weitergegeben werden. - Um Zugang zu beantragen, wenden Sie sich an support@schnell.com oder verwenden Sie die Funktion „Datenanfrage“ in der App. Wir werden innerhalb von 30 Tagen (oder 45 Tagen bei komplexen Anfragen) antworten. **7.2 Recht auf Berichtigung** - Wenn Ihre persönlichen Daten ungenau oder unvollständig sind, können Sie Korrekturen über die Profileinstellungen der App oder durch Kontaktaufnahme mit dem Support beantragen. - Wir werden Ihre Informationen umgehend aktualisieren und Dritte benachrichtigen, an die die Daten weitergegeben wurden. **7.3 Recht auf Löschung** - Sie können die Löschung Ihrer persönlichen Daten beantragen, vorbehaltlich der gesetzlichen Aufbewahrungsfristen (z. B. Steuerunterlagen). - Löschanträge können über die App oder per E-Mail an support@schnell.com gestellt werden. Wir werden die Löschung innerhalb von 30 Tagen bestätigen. **7.4 Recht auf Einschränkung der Verarbeitung** - Sie können verlangen, dass wir die Verarbeitung Ihrer Daten einschränken (z. B. nur auf die Speicherung), wenn Sie deren Richtigkeit, Rechtmäßigkeit oder Notwendigkeit anfechten. - Eingeschränkte Daten werden nicht für die aktive Verarbeitung verwendet, können aber für rechtliche Zwecke aufbewahrt werden. **7.5 Recht auf Datenübertragbarkeit** - Sie können eine maschinenlesbare Kopie Ihrer persönlichen Daten (z. B. im CSV- oder JSON-Format) anfordern, um sie an einen anderen Dienst zu übertragen. - Wir werden diese Daten innerhalb von 30 Tagen kostenlos für Standardanfragen bereitstellen. **7.6 Widerspruchsrecht** - Sie können der Verarbeitung Ihrer Daten zu Marketingzwecken oder, wenn die Verarbeitung auf unseren berechtigten Interessen beruht, widersprechen. - Um sich vom Marketing abzumelden, verwenden Sie die Einstellungen der App oder klicken Sie in Werbe-E-Mails auf „Abmelden“. **7.7 Recht auf Widerruf der Zustimmung** - Wenn die Verarbeitung auf Ihrer Zustimmung beruht (z. B. Standortdaten, Marketing), können Sie die Zustimmung jederzeit über die App oder durch Kontaktaufnahme mit uns widerrufen. Der Widerruf berührt nicht die Rechtmäßigkeit der vorherigen Verarbeitung. **7.8 Recht auf Nichtdiskriminierung** - Wir werden Sie nicht diskriminieren, weil Sie Ihre Datenschutzrechte ausüben, z. B. durch die Erhebung höherer Preise oder die Verweigerung von Diensten. **7.9 Einreichen einer Beschwerde** - Wenn Sie der Meinung sind, dass wir Ihre Datenschutzrechte verletzt haben, können Sie eine Beschwerde bei Ihrer lokalen Datenschutzbehörde (z. B. CNIL in Frankreich, ICO im Vereinigten Königreich oder dem Büro des kalifornischen Generalstaatsanwalts) einreichen. - Sie können uns auch direkt unter support@schnell.com kontaktieren, um Bedenken informell zu lösen. **7.10 So üben Sie Ihre Rechte aus** - Senden Sie Anfragen über die Funktion „Datenanfrage“ der App oder per E-Mail an support@schnell.com mit Ihrem Namen, Ihren Kontodaten und dem spezifischen Recht, das Sie ausüben möchten. - Wir können eine Identitätsprüfung (z. B. eine Kopie Ihres Ausweises) verlangen, um unbefugte Anfragen zu verhindern. - Die Antworten werden innerhalb des gesetzlich vorgeschriebenen Zeitrahmens schriftlich (per E-Mail oder In-App-Benachrichtigung) bereitgestellt.
es: Según su ubicación, usted tiene ciertos derechos con respecto a sus datos personales en virtud de las leyes de protección de datos aplicables, como el RGPD, el CCPA u otras regulaciones regionales. **7.1 Derecho de acceso** - Puede solicitar una copia de los datos personales que tenemos sobre usted, incluidos los detalles sobre cómo se procesan y comparten. - Para solicitar acceso, contacte a support@shnell.com o use la función "Solicitud de datos" en la Aplicación. Le responderemos en un plazo de 30 días (o 45 días para solicitudes complejas). **7.2 Derecho de rectificación** - Si sus datos personales son inexactos o incompletos, puede solicitar correcciones a través de la configuración de perfil de la Aplicación o contactando con el soporte. - Actualizaremos su información de inmediato y notificaremos a los terceros con los que se compartieron los datos. **7.3 Derecho de eliminación** - Puede solicitar la eliminación de sus datos personales, sujeto a los requisitos de retención legales (por ejemplo, registros fiscales). - Las solicitudes de eliminación se pueden enviar a través de la Aplicación o por correo electrónico a support@shnell.com. Confirmaremos la eliminación en un plazo de 30 días. **7.4 Derecho a restringir el procesamiento** - Puede solicitar que limitemos el procesamiento de sus datos (por ejemplo, solo para almacenamiento) si impugna su exactitud, legalidad o necesidad. - Los datos restringidos no se utilizarán para el procesamiento activo, pero pueden conservarse para fines legales. **7.5 Derecho a la portabilidad de los datos** - Puede solicitar una copia legible por máquina de sus datos personales (por ejemplo, en formato CSV o JSON) para transferirla a otro servicio. - Le proporcionaremos estos datos en un plazo de 30 días, de forma gratuita, para las solicitudes estándar. **7.6 Derecho de oposición** - Puede oponerse al procesamiento de sus datos con fines de marketing o cuando el procesamiento se base en nuestros intereses legítimos. - Para optar por no recibir marketing, utilice la configuración de la Aplicación o haga clic en "Cancelar suscripción" en los correos electrónicos promocionales. **7.7 Derecho a retirar el consentimiento** - Cuando el procesamiento se base en su consentimiento (por ejemplo, datos de ubicación, marketing), puede retirar el consentimiento en cualquier momento a través de la Aplicación o contactándonos. La retirada no afecta la legalidad del procesamiento anterior. **7.8 Derecho a la no discriminación** - No discriminaremos a nadie por ejercer sus derechos de protección de datos, por ejemplo, cobrando precios más altos o negando servicios. **7.9 Presentar una queja** - Si cree que hemos violado sus derechos de protección de datos, puede presentar una queja ante su autoridad local de protección de datos (por ejemplo, CNIL en Francia, ICO en el Reino Unido o la oficina del Fiscal General de California). - También puede contactarnos directamente en support@shnell.com para resolver cualquier inquietud de manera informal. **7.10 Cómo ejercer sus derechos** - Envíe las solicitudes a través de la función "Solicitud de datos" de la Aplicación o por correo electrónico a support@shnell.com con su nombre, detalles de la cuenta y el derecho específico que desea ejercer. - Podemos requerir una verificación de identidad (por ejemplo, una copia de su identificación) para evitar solicitudes no autorizadas. - Las respuestas se proporcionarán por escrito (por correo electrónico o notificación en la aplicación) dentro del plazo legalmente requerido.
pt: Dependendo da sua localização, tem certos direitos em relação aos seus dados pessoais ao abrigo das leis de proteção de dados aplicáveis, como o RGPD, a CCPA ou outras regulamentações regionais. **7.1 Direito de acesso** - Pode solicitar uma cópia dos dados pessoais que mantemos sobre si, incluindo detalhes sobre como são processados e partilhados. - Para solicitar acesso, contacte support@shnell.com ou utilize a funcionalidade "Pedido de dados" na App. Responderemos no prazo de 30 dias (45 dias para pedidos complexos). **7.2 Direito de retificação** - Se os seus dados pessoais estiverem imprecisos ou incompletos, pode solicitar correções através das definições de perfil da App ou contactando o suporte. - Atualizaremos prontamente as suas informações e notificaremos quaisquer terceiros com quem os dados tenham sido partilhados. **7.3 Direito de eliminação** - Pode solicitar a eliminação dos seus dados pessoais, sujeito aos requisitos de retenção legal (por exemplo, registos fiscais). - Os pedidos de eliminação podem ser submetidos através da App ou por e-mail para support@shnell.com. Confirmaremos a eliminação no prazo de 30 dias. **7.4 Direito de restringir o processamento** - Pode solicitar que restrinjamos o processamento dos seus dados (por exemplo, apenas para armazenamento) se contestar a sua precisão, legalidade ou necessidade. - Os dados restritos não serão utilizados para processamento ativo, mas podem ser retidos para fins legais. **7.5 Direito à portabilidade dos dados** - Pode solicitar uma cópia legível por máquina dos seus dados pessoais (por exemplo, em formato CSV ou JSON) para os transferir para outro serviço. - Para pedidos padrão, forneceremos estes dados gratuitamente no prazo de 30 dias. **7.6 Direito de oposição** - Pode opor-se ao processamento dos seus dados para fins de marketing ou onde o processamento se baseia nos nossos interesses legítimos. - Para optar por não participar no marketing, utilize as definições da App ou clique em "Anular subscrição" nos e-mails promocionais. **7.7 Direito de revogar o consentimento** - Onde o processamento se baseia no seu consentimento (por exemplo, dados de localização, marketing), pode revogar o seu consentimento a qualquer momento através da App ou contactando-nos. A revogação não afetará a legalidade do processamento anterior. **7.8 Direito à não discriminação** - Não o discriminaremos por exercer os seus direitos de proteção de dados, por exemplo, cobrando preços mais altos ou negando serviços. **7.9 Apresentar uma reclamação** - Se acredita que violámos os seus direitos de proteção de dados, pode apresentar uma reclamação à sua autoridade local de proteção de dados (por exemplo, a CNIL em França, a ICO no Reino Unido ou o gabinete do Procurador-Geral da Califórnia). - Também pode contactar-nos diretamente em support@shnell.com para resolver quaisquer preocupações informalmente. **7.10 Como exercer os seus direitos** - Submeta pedidos através da funcionalidade "Pedido de dados" da App ou envie um e-mail para support@shnell.com com o seu nome, detalhes da conta e o direito específico que pretende exercer. - Podemos solicitar a verificação da identidade (por exemplo, uma cópia do seu documento de identificação) para evitar pedidos não autorizados. - As respostas serão fornecidas por escrito (por e-mail ou notificação na aplicação) dentro do prazo legalmente exigido.
zh: 根据您所在的位置，您根据适用的数据保护法律（例如 GDPR、CCPA 或其他地区法规）对您的个人数据拥有某些权利。 **7.1 访问权** - 您可以要求提供我们持有的关于您的个人数据的副本，包括有关其如何处理和共享的详细信息。 - 要请求访问，请联系 support@shnell.com 或使用应用程序中的“数据请求”功能。我们将在 30 天内（复杂请求为 45 天）回复您。 **7.2 纠正权** - 如果您的个人数据不准确或不完整，您可以通过应用程序的个人资料设置或联系支持来请求纠正。 - 我们将及时更新您的信息，并通知已共享数据的第三方。 **7.3 删除权** - 您可以要求删除您的个人数据，但须遵守法律保留要求（例如，税务记录）。 - 删除请求可以通过应用程序或发送电子邮件至 support@shnell.com 提交。我们将在 30 天内确认删除。 **7.4 限制处理权** - 如果您对数据的准确性、合法性或必要性提出异议，您可以要求限制处理数据（例如，仅用于存储）。 - 限制的数据将不用于主动处理，但可能出于法律目的而保留。 **7.5 数据可移植性权** - 您可以要求提供您的个人数据的机器可读副本（例如，CSV 或 JSON 格式），以便将其传输到其他服务。 - 对于标准请求，我们将在 30 天内免费提供此数据。 **7.6 反对权** - 您可以反对出于营销目的处理您的数据，或反对基于我们合法利益进行的处理。 - 要选择退出营销，请使用应用程序设置或点击促销电子邮件中的“取消订阅”。 **7.7 撤回同意权** - 在处理基于您的同意的情况下（例如，位置数据、营销），您可以随时通过应用程序或联系我们撤回您的同意。撤回不会影响之前处理的合法性。 **7.8 不受歧视权** - 我们不会因您行使数据保护权利而歧视您，例如收取更高的价格或拒绝服务。 **7.9 提出投诉** - 如果您认为我们侵犯了您的数据保护权利，您可以向您当地的数据保护机构（例如，法国的 CNIL、英国的 ICO 或加利福尼亚州总检察长办公室）提出投诉。 - 您也可以直接联系 support@shnell.com 以非正式方式解决疑虑。 **7.10 如何行使您的权利** - 通过应用程序的“数据请求”功能或发送包含您的姓名、账户详细信息和您希望行使的特定权利的电子邮件至 support@shnell.com 来提交请求。 - 我们可能会要求提供身份验证（例如，您的身份证件副本）以防止未经授权的请求。 - 答复将以书面形式（通过电子邮件或应用内通知）在法律要求的时间内提供。

# thirdPartyHeading
source: 8. Third-Party Services
ar: 8. خدمات الطرف الثالث
de: 8. Drittanbieterdienste
es: 8. Servicios de terceros
pt: 8. Serviços de terceiros
zh: 8. 第三方服务
