Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# thirdPartyBody
source: The App integrates with third-party services to provide essential functionality. These services have their own privacy policies, which apply separately to their processing of your data. **8.1 Mapping and Navigation** - **Mapbox**: Provides mapping, geolocation, and routing services. Mapbox receives location data to generate maps and optimize delivery routes. See Mapbox’s Privacy Policy at www.mapbox.com/privacy. - **Analytics Providers**: Firebase Analytics and other tools receive anonymized usage data to generate insights on App performance and user behavior. Firebase may use device identifiers and usage patterns. See Google’s Privacy Policy at www.google.com/policies/privacy. - **Mixpanel**: Tracks user interactions to improve App features. Mixpanel collects anonymized data, such as click patterns and session duration. See Mixpanel’s Privacy Policy at www.mixpanel.com/legal/privacy-policy. - **Customer Support**: Zendesk manages support tickets and communication history. Zendesk stores your contact details and messages. See Zendesk’s Privacy Policy at www.zendesk.com/company/privacy. - **Verification Services**: Jumio verifies Driver identities and documents (e.g., driver’s license, national ID). Jumio processes sensitive information securely. See Jumio’s Privacy Policy at www.jumio.com/legal-information/privacy-policy. - **Onfido**: An alternative verification service for Driver onboarding. Onfido handles identity verification data. See Onfido’s Privacy Policy at www.onfido.com/privacy. - **Cloud Storage**: Amazon Web Services (AWS) stores user data securely in encrypted form. AWS does not access or process your data beyond storage services. See AWS’s Privacy Policy at aws.amazon.com/privacy. - **Google Cloud**: Provides additional cloud storage and processing capabilities. See Google’s Privacy Policy at www.google.com/policies/privacy. **8.6 User Responsibility** - You acknowledge that third-party services are governed by their respective privacy policies, and Schnell is not responsible for their practices. - We select reputable providers with strong data protection standards and ensure they comply with applicable laws.
ar: يتكامل التطبيق مع خدمات الطرف الثالث لتوفير وظائف أساسية. هذه الخدمات لديها سياسات خصوصية خاصة بها، والتي تنطبق بشكل منفصل على معالجتها لبياناتك. **8.1 الخرائط والملاحة** - **Mapbox**: يوفر خدمات الخرائط، وتحديد الموقع الجغرافي، والتوجيه. تتلقى Mapbox بيانات الموقع لإنشاء الخرائط وتحسين مسارات التسليم. راجع سياسة خصوصية Mapbox على www.mapbox.com/privacy. **8.2 التحليلات** - **Firebase Analytics**: يجمع بيانات استخدام مجهولة الهوية لتحليل أداء التطبيق وسلوك المستخدم. قد يستخدم Firebase معرفات الأجهزة وأنماط الاستخدام. راجع سياسة خصوصية Google على www.google.com/policies/privacy. - **Mixpanel**: يتتبع تفاعلات المستخدم لتحسين ميزات التطبيق. يجمع Mixpanel بيانات مجهولة الهوية، مثل أنماط النقرات ومدة الجلسة. راجع سياسة خصوصية Mixpanel على www.mixpanel.com/legal/privacy-policy. **8.3 دعم العملاء** - **Zendesk**: يدير تذاكر الدعم وسجل الاتصال. تخزن Zendesk تفاصيل الاتصال الخاصة بك والرسائل. راجع سياسة خصوصية Zendesk على www.zendesk.com/company/privacy. **8.4 خدمات التحقق** - **Jumio**: تتحقق من هويات السائقين ووثائقهم (مثل رخصة القيادة، والهوية الوطنية). تعالج Jumio المعلومات الحساسة بشكل آمن. راجع سياسة خصوصية Jumio على www.jumio.com/legal-information/privacy-policy. - **Onfido**: خدمة تحقق بديلة لإعداد السائق. تتعامل Onfido مع بيانات التحقق من الهوية. راجع سياسة خصوصية Onfido على www.onfido.com/privacy. **8.5 التخزين السحابي** - **خدمات الويب من أمازون (AWS)**: تخزن بيانات المستخدم بشكل آمن في شكل مشفر. لا تصل AWS إلى بياناتك أو تعالجها بما يتجاوز خدمات التخزين. راجع سياسة خصوصية AWS على aws.amazon.com/privacy. - **Google Cloud**: توفر قدرات تخزين ومعالجة سحابية إضافية. راجع سياسة خصوصية Google على www.google.com/policies/privacy. **8.6 مسؤولية المستخدم** - أنت تقر بأن خدمات الطرف الثالث تخضع لسياسات الخصوصية الخاصة بها، وشنيل ليست مسؤولة عن ممارساتها. - نختار مقدمي خدمات موثوقين يتمتعون بمعايير قوية لحماية البيانات ونتأكد من امتثالهم للقوانين المعمول بها.
de: Die App ist in Drittanbieterdienste integriert, um wesentliche Funktionen bereitzustellen. Diese Dienste haben ihre eigenen Datenschutzrichtlinien, die für die Verarbeitung Ihrer Daten separat gelten. **8.1 Kartierung und Navigation** - **Mapbox**: Bietet Kartierungs-, Geolokalisierungs- und Routingdienste. Mapbox erhält Standortdaten, um Karten zu erstellen und Lieferrouten zu optimieren. Siehe die Datenschutzrichtlinie von Mapbox unter www.mapbox.com/privacy. **8.2 Analyse** - **Firebase Analytics**: Sammelt anonymisierte Nutzungsdaten, um Einblicke in die App-Leistung und das Nutzerverhalten zu gewinnen. Firebase kann Geräte-IDs und Nutzungsmuster verwenden. Siehe die Datenschutzrichtlinie von Google unter www.google.com/policies/privacy. - **Mixpanel**: Verfolgt Nutzerinteraktionen zur Verbesserung der App-Funktionen. Mixpanel sammelt anonymisierte Daten, wie z. B. Klickmuster und Sitzungsdauer. Siehe die Datenschutzrichtlinie von Mixpanel unter www.mixpanel.com/legal/privacy-policy. **8.3 Kundensupport** - **Zendesk**: Verwaltet Support-Tickets und Kommunikationsverlauf. Zendesk speichert Ihre Kontaktdaten und Nachrichten. Siehe die Datenschutzrichtlinie von Zendesk unter www.zendesk.com/company/privacy. **8.4 Verifizierungsdienste** - **Jumio**: Verifiziert die Identität und Dokumente von Fahrern (z. B. Führerschein, nationaler Ausweis). Jumio verarbeitet sensible Informationen sicher. Siehe die Datenschutzrichtlinie von Jumio unter www.jumio.com/legal-information/privacy-policy. - **Onfido**: Ein alternativer Verifizierungsdienst für die Einarbeitung von Fahrern. Onfido verarbeitet Identitätsverifizierungsdaten. Siehe die Datenschutzrichtlinie von Onfido unter www.onfido.com/privacy. **8.5 Cloud-Speicher** - **Amazon Web Services (AWS)**: Speichert Nutzerdaten sicher in verschlüsselter Form. AWS greift nicht auf Ihre Daten zu oder verarbeitet sie über die Speicherdienste hinaus. Siehe die Datenschutzrichtlinie von AWS unter aws.amazon.com/privacy. - **Google Cloud**: Bietet zusätzliche Speicher- und Verarbeitungsfunktionen in der Cloud. Siehe die Datenschutzrichtlinie von Google unter www.google.com/policies/privacy. **8.6 Verantwortung des Nutzers** - Sie erkennen an, dass Drittanbieterdienste durch ihre jeweiligen Datenschutzrichtlinien geregelt sind und Schnell nicht für ihre Praktiken verantwortlich ist. - Wir wählen seriöse Anbieter mit starken Datenschutzstandards aus und stellen sicher, dass sie die geltenden Gesetze einhalten.
es: La Aplicación se integra con servicios de terceros para proporcionar funcionalidades esenciales. Estos servicios tienen sus propias políticas de privacidad, que se aplican por separado a su procesamiento de sus datos. **8.1 Mapeo y navegación** - **Mapbox**: Proporciona servicios de mapeo, geolocalización y enrutamiento. Mapbox recibe datos de ubicación para generar mapas y optimizar las rutas de entrega. Consulte la Política de privacidad de Mapbox en www.mapbox.com/privacy. **8.2 Análisis** - **Firebase Analytics**: Recopila datos de uso anonimizados para analizar el rendimiento de la Aplicación y el comportamiento de los usuarios. Firebase puede usar identificadores de dispositivo y patrones de uso. Consulte la Política de privacidad de Google en www.google.com/policies/privacy. - **Mixpanel**: Realiza un seguimiento de las interacciones de los usuarios para mejorar las funciones de la Aplicación. Mixpanel recopila datos anonimizados, como patrones de clics y la duración de la sesión. Consulte la Política de privacidad de Mixpanel en www.mixpanel.com/legal/privacy-policy. **8.3 Atención al cliente** - **Zendesk**: Gestiona los tickets de soporte y el historial de comunicación. Zendesk almacena sus datos de contacto y sus mensajes. Consulte la Política de privacidad de Zendesk en www.zendesk.com/company/privacy. **8.4 Servicios de verificación** - **Jumio**: Verifica las identidades y los documentos de los conductores (por ejemplo, licencia de conducir, identificación nacional). Jumio procesa información sensible de forma segura. Consulte la Política de privacidad de Jumio en www.jumio.com/legal-information/privacy-policy. - **Onfido**: Un servicio de verificación alternativo para la incorporación de conductores. Onfido maneja los datos de verificación de identidad. Consulte la Política de privacidad de Onfido en www.onfido.com/privacy. **8.5 Almacenamiento en la nube** - **Amazon Web Services (AWS)**: Almacena los datos de los usuarios de forma segura en formato cifrado. AWS no accede ni procesa sus datos más allá de los servicios de almacenamiento. Consulte la Política de privacidad de AWS en aws.amazon.com/privacy. - **Google Cloud**: Proporciona capacidades adicionales de almacenamiento y procesamiento en la nube. Consulte la Política de privacidad de Google en www.google.com/policies/privacy. **8.6 Responsabilidad del usuario** - Usted reconoce que los servicios de terceros se rigen por sus respectivas políticas de privacidad y que shnell no es responsable de sus prácticas. - Seleccionamos proveedores de confianza con sólidos estándares de protección de datos y nos aseguramos de que cumplan con las leyes aplicables.
pt: A App integra-se com serviços de terceiros para fornecer funcionalidades essenciais. Estes serviços têm as suas próprias políticas de privacidade, que se aplicam independentemente ao seu tratamento dos seus dados. **8.1 Mapeamento e navegação** - **Mapbox**: Fornece serviços de mapeamento, geolocalização e roteamento. A Mapbox recebe dados de localização para gerar mapas e otimizar rotas de entrega. Consulte a Política de Privacidade da Mapbox em www.mapbox.com/privacy. **8.2 Análise** - **Firebase Analytics**: Recolhe dados de utilização anónimos para gerar insights sobre o desempenho da App e o comportamento do utilizador. A Firebase pode utilizar identificadores de dispositivo e padrões de utilização. Consulte a Política de Privacidade da Google em www.google.com/policies/privacy. - **Mixpanel**: Rastreia as interações do utilizador para melhorar as funcionalidades da App. A Mixpanel recolhe dados anónimos, como padrões de clique e duração da sessão. Consulte a Política de Privacidade da Mixpanel em www.mixpanel.com/legal/privacy-policy. **8.3 Suporte ao cliente** - **Zendesk**: Gere tickets de suporte e o histórico de comunicação. A Zendesk armazena as suas informações de contacto e mensagens. Consulte a Política de Privacidade da Zendesk em www.zendesk.com/company/privacy. **8.4 Serviços de verificação** - **Jumio**: Verifica a identidade e os documentos dos motoristas (por exemplo, carta de condução, documento de identificação nacional). A Jumio processa informações sensíveis de forma segura. Consulte a Política de Privacidade da Jumio em www.jumio.com/legal-information/privacy-policy. - **Onfido**: Um serviço de verificação alternativo para a integração de motoristas. A Onfido processa dados de verificação de identidade. Consulte a Política de Privacidade da Onfido em www.onfido.com/privacy. **8.5 Armazenamento na nuvem** - **Amazon Web Services (AWS)**: Armazena de forma segura os dados do utilizador num formato encriptado. A AWS não acede ou processa os seus dados para além dos seus serviços de armazenamento. Consulte a Política de Privacidade da AWS em aws.amazon.com/privacy. - **Google Cloud**: Fornece funcionalidades adicionais de armazenamento e processamento na nuvem. Consulte a Política de Privacidade da Google em www.google.com/policies/privacy. **8.6 Responsabilidade do utilizador** - Reconhece que os serviços de terceiros são regidos pelas respetivas políticas de privacidade e que a shnell não é responsável pelas suas práticas. - Selecionamos fornecedores de boa reputação com fortes padrões de proteção de dados e garantimos que cumprem as leis aplicáveis.
zh: 本应用程序与第三方服务集成以提供基本功能。这些服务有其自己的隐私政策，这些政策独立适用于它们对您数据的处理。 **8.1 地图和导航** - **Mapbox**：提供地图、地理定位和路线规划服务。Mapbox 接收位置数据以生成地图和优化投递路线。请参阅 Mapbox 的隐私政策，网址为 www.mapbox.com/privacy。 **8.2 分析** - **Firebase Analytics**：收集匿名使用数据以生成有关应用程序性能和用户行为的洞察。Firebase 可能会使用设备标识符和使用模式。请参阅 Google 的隐私政策，网址为 www.google.com/policies/privacy。 - **Mixpanel**：跟踪用户交互以改进应用程序功能。Mixpanel 收集匿名数据，例如点击模式和会话持续时间。请参阅 Mixpanel 的隐私政策，网址为 www.mixpanel.com/legal/privacy-policy。 **8.3 客户支持** - **Zendesk**：管理支持工单和通信历史。Zendesk 存储您的联系信息和消息。请参阅 Zendesk 的隐私政策，网址为 www.zendesk.com/company/privacy。 **8.4 验证服务** - **Jumio**：验证司机的身份和文件（例如，驾驶执照、国民身份证件）。Jumio 安全地处理敏感信息。请参阅 Jumio 的隐私政策，网址为 www.jumio.com/legal-information/privacy-policy。 - **Onfido**：用于司机入职的替代验证服务。Onfido 处理身份验证数据。请参阅 Onfido 的隐私政策，网址为 www.onfido.com/privacy。 **8.5 云存储** - **Amazon Web Services (AWS)**：以加密形式安全地存储用户数据。AWS 不会超出其存储服务范围访问或处理您的数据。请参阅 AWS 的隐私政策，网址为 aws.amazon.com/privacy。 - **Google Cloud**：提供额外的云存储和处理功能。请参阅 Google 的隐私政策，网址为 www.google.com/policies/privacy。 **8.6 用户责任** - 您承认第三方服务受其各自隐私政策的管辖，shnell 对其做法不承担任何责任。 - 我们选择信誉良好且具有强大数据保护标准的提供商，并确保其遵守适用的法律。

# childrenPrivacyHeading
source: 9. Children's Privacy
ar: 9. خصوصية الأطفال
de: 9. Datenschutz von Kindern
es: 9. Privacidad de los niños
pt: 9. Privacidade das crianças
zh: 9. 儿童隐私

# childrenPrivacyBody
source: The App is not intended for users under 18 years of age. We do not knowingly collect personal information from children under 18. **9.1 Age Restrictions** - Users must be at least 18 years old to create an account or use our services. - Drivers must meet additional age and licensing requirements as specified in our Terms of Use (e.g., minimum age of 21 for certain vehicle types). **9.2 Parental Consent** - If we become aware that a user under 18 has provided personal information without verifiable parental consent, we will delete the information promptly. - Parents or guardians who believe their child has submitted data to the App should contact support@schnell.com immediately. **9.3 COPPA Compliance** - For U.S. users, we comply with the Children’s Online Privacy Protection Act (COPPA). We do not collect, use, or share data from children under 13 without parental consent.
ar: التطبيق غير مخصص للمستخدمين الذين تقل أعمارهم عن 18 عامًا. نحن لا نجمع عن علم معلومات شخصية من الأطفال دون سن 18 عامًا. **9.1 القيود العمرية** - يجب أن يكون عمر المستخدمين 18 عامًا على الأقل لإنشاء حساب أو استخدام خدماتنا. - يجب أن يفي السائقون بمتطلبات العمر والترخيص الإضافية المحددة في شروط الاستخدام لدينا (مثل الحد الأدنى للسن وهو 21 عامًا لأنواع معينة من المركبات). **9.2 موافقة الوالدين** - إذا علمنا أن مستخدمًا دون سن 18 عامًا قد قدم معلومات شخصية دون موافقة الوالدين القابلة للتحقق، فسنقوم بحذف المعلومات على الفور. - يجب على الآباء أو الأوصياء الذين يعتقدون أن طفلهم قد قدم بيانات إلى التطبيق الاتصال بـ support@shnell.com على الفور. **9.3 الامتثال لقانون حماية خصوصية الأطفال على الإنترنت (COPPA)** - بالنسبة للمستخدمين في الولايات المتحدة، فإننا نمتثل لقانون حماية خصوصية الأطفال على الإنترنت (COPPA). لا نقوم بجمع أو استخدام أو مشاركة بيانات من الأطفال دون سن 13 عامًا دون موافقة الوالدين.
de: Die App ist nicht für Nutzer unter 18 Jahren gedacht. Wir sammeln nicht wissentlich persönliche Informationen von Kindern unter 18 Jahren. **9.1 Altersbeschränkungen** - Nutzer müssen mindestens 18 Jahre alt sein, um ein Konto zu erstellen oder unsere Dienste zu nutzen. - Fahrer müssen zusätzliche Alters- und Lizenzanforderungen erfüllen, die in unseren Nutzungsbedingungen festgelegt sind (z. B. Mindestalter von 21 Jahren für bestimmte Fahrzeugtypen). **9.2 Elterliche Zustimmung** - Wenn wir feststellen, dass ein Nutzer unter 18 Jahren persönliche Informationen ohne nachweisbare elterliche Zustimmung bereitgestellt hat, werden wir die Informationen umgehend löschen. - Eltern oder Erziehungsberechtigte, die glauben, dass ihr Kind Daten an die App übermittelt hat, sollten sich sofort an support@schnell.com wenden. **9.3 COPPA-Konformität** - Für US-Nutzer halten wir uns an den Children’s Online Privacy Protection Act (COPPA). Wir sammeln, verwenden oder teilen keine Daten von Kindern unter 13 Jahren ohne elterliche Zustimmung.
es: La Aplicación no está destinada a usuarios menores de 18 años. No recopilamos a sabiendas información personal de niños menores de 18 años. **9.1 Restricciones de edad** - Los usuarios deben tener al menos 18 años para crear una cuenta o utilizar nuestros servicios. - Los Conductores deben cumplir con los requisitos adicionales de edad y licencia especificados en nuestros Términos de uso (por ejemplo, edad mínima de 21 años para ciertos tipos de vehículos). **9.2 Consentimiento parental** - Si nos damos cuenta de que un usuario menor de 18 años ha proporcionado información personal sin un consentimiento parental verificable, eliminaremos la información de inmediato. - Los padres o tutores que crean que su hijo ha enviado datos a la Aplicación deben contactar a support@shnell.com de inmediato. **9.3 Cumplimiento de la COPPA** - Para los usuarios de EE. UU., cumplimos con la Ley de Protección de la Privacidad en Línea para Niños (COPPA). No recopilamos, usamos ni compartimos datos de niños menores de 13 años sin el consentimiento de los padres.
pt: A App não se destina a utilizadores com menos de 18 anos de idade. Não recolhemos intencionalmente informações pessoais de crianças com menos de 18 anos de idade. **9.1 Restrições de idade** - Os utilizadores devem ter pelo menos 18 anos para criar uma conta ou utilizar os nossos serviços. - Os Motoristas devem cumprir os requisitos adicionais de idade e licença especificados nos nossos Termos de Utilização (por exemplo, idade mínima de 21 anos para certos tipos de veículos). **9.2 Consentimento dos pais** - Se soubermos que um utilizador com menos de 18 anos forneceu informações pessoais sem o consentimento verificável dos pais, eliminaremos prontamente as informações. - Pais ou tutores que acreditam que o seu filho submeteu dados para a App devem contactar imediatamente support@schnnell.com. **9.3 Conformidade com a COPPA** - Para utilizadores dos EUA, estamos em conformidade com a Lei de Proteção da Privacidade Online das Crianças (COPPA). Não recolhemos, utilizamos ou partilhamos dados de crianças com menos de 13 anos sem o consentimento dos pais.
zh: 本应用程序不面向 18 岁以下的用户。我们不会故意从 18 岁以下的儿童那里收集个人信息。 **9.1 年龄限制** - 用户必须年满 18 岁才能创建账户或使用我们的服务。 - 司机必须满足我们使用条款中规定的额外年龄和许可证要求（例如，某些类型车辆的最低年龄为 21 岁）。 **9.2 父母同意** - 如果我们得知未满 18 岁的用户在没有可验证的父母同意的情况下提供了个人信息，我们将立即删除这些信息。 - 认为其子女已向应用程序提交数据的父母或监护人应立即联系 support@shnell.com。 **9.3 符合 COPPA** - 对于美国用户，我们遵守《儿童在线隐私保护法》（COPPA）。我们不会在未经父母同意的情况下收集、使用或共享 13 岁以下儿童的数据。

# commissionHeading
source: 10. Commission Structure
ar: 10. هيكل العمولة
de: 10. Provisionsstruktur
es: 10. Estructura de comisión
pt: 10. Estrutura de comissões
zh: 10. 佣金结构
