Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# reorderWarning
source: Manual reordering can increase route distance. Continue?
ar: قد تزيد إعادة الترتيب اليدوية من مسافة المسار. هل تريد المتابعة؟
de: Manuelles Neuanordnen kann die Entfernung der Route erhöhen. Fortfahren?
es: El reordenamiento manual puede aumentar la distancia de la ruta. ¿Continuar?
pt: A reordenação manual pode aumentar a distância da rota. Continuar?
zh: 手动重新排序可能会增加路线距离。是否继续？

source: Confirm
ar: تأكيد
de: Bestätigen
es: Confirmar
pt: Confirmar
zh: 确认

# selectAtLeastOneDestination
source: Please select at least one destination.
ar: الرجاء اختيار وجهة واحدة على الأقل.
de: Bitte wählen Sie mindestens ein Ziel.
es: Por favor, selecciona al menos un destino.
pt: Por favor, selecione pelo menos um destino.
zh: 请至少选择一个目的地。

# routeGenerationError
source: Could not generate the route. Please try again.
ar: تعذر إنشاء المسار. الرجاء المحاولة مرة أخرى.
de: Die Route konnte nicht generiert werden. Bitte versuchen Sie es erneut.
es: No se pudo generar la ruta. Por favor, inténtelo de nuevo.
pt: Não foi possível gerar a rota. Por favor, tente novamente.
zh: 无法生成路线。请重试。

# searchLocationHint
source: Search for a {type} location
ar: البحث عن موقع {type}
de: Suche nach einem {type}-Standort
es: Buscar una ubicación de {type}
pt: Procurar um local de {type}
zh: 搜索 {type} 地点

# customerInfo
source: Customer Information
ar: معلومات العميل
de: Kundeninformationen
es: Información del cliente
pt: Informações do Cliente
zh: 客户信息

source: Customer Name
ar: اسم العميل
de: Kundenname
es: Nombre del cliente
pt: Nome do Cliente
zh: 客户姓名

source: Optional
ar: اختياري
es: Opcional
pt: Opcional
zh: 可选

# customerPhone
source: Phone Number
ar: رقم الهاتف
de: Telefonnummer
es: Número de teléfono
pt: Número de Telefone
zh: 电话号码

# continueText
source: Continue
ar: متابعة
de: Weiter
es: Continuar
pt: Continuar
zh: 继续

source: Add destination
ar: إضافة وجهة
de: Ziel hinzufügen
es: Agregar destino
pt: Adicionar destino
zh: 添加目的地

source: Current Location
ar: الموقع الحالي
de: Aktueller Standort
es: Ubicación actual
pt: Localização atual
zh: 当前位置

# untitledSection
source: Untitled
ar: بدون عنوان
de: Ohne Titel
es: Sin título
pt: Sem título
zh: 无标题

source: No content available
ar: لا يوجد محتوى
de: Keine Inhalte verfügbar
es: No hay contenido disponible
pt: Nenhum conteúdo disponível
zh: 暂无内容

# signInPrompt
source: Please sign in to view your history.
ar: الرجاء تسجيل الدخول لعرض سجلك.
de: Bitte melden Sie sich an, um Ihren Verlauf anzuzeigen.
es: Inicie sesión para ver su historial.
pt: Faça login para ver seu histórico.
zh: 请登录以查看您的历史记录。

# allTab
source: All
ar: الكل
de: Alle
es: Todas
pt: Todos
zh: 所有

# ongoingTab
source: Ongoing
ar: قيد التنفيذ
de: Laufend
es: En curso
pt: Em andamento
zh: 进行中

# completedTab
source: Completed
ar: مكتملة
de: Abgeschlossen
es: Completadas
pt: Concluídos
zh: 已完成

# canceledTab
source: Canceled
ar: ملغاة
de: Storniert
es: Canceladas
pt: Cancelados
zh: 已取消

# historyTitle
source: History
ar: السجل
de: Verlauf
es: Historial
pt: Histórico
zh: 历史记录

# errorText
source: An error occurred: {error}
ar: حدث خطأ: {error}
de: Ein Fehler ist aufgetreten: {error}
es: Ocurrió un error: {error}
pt: Ocorreu um erro: {error}
zh: 发生错误: {error}

# noHistoryItems
source: No trips in your history.
ar: لا توجد رحلات في سجلك.
de: Keine Fahrten in Ihrem Verlauf.
es: No hay viajes en su historial.
pt: Nenhuma viagem em seu histórico.
zh: 您的历史记录中没有行程。

# noCategoryItems
source: No items in this category.
ar: لا توجد عناصر في هذه الفئة.
de: Keine Elemente in dieser Kategorie.
es: No hay elementos en esta categoría.
pt: Nenhum item nesta categoria.
zh: 此类别中没有项目。

# statusOngoing
source: Ongoing
ar: قيد التنفيذ
de: Laufend
es: En curso
pt: Em andamento
zh: 进行中

# statusCompleted
source: Completed
ar: مكتملة
de: Abgeschlossen
es: Completada
pt: Concluído
zh: 已完成

# statusCanceled
source: Canceled
ar: ملغاة
de: Storniert
es: Cancelada
pt: Cancelado
zh: 已取消

# statusUnknown
source: Unknown
ar: غير معروف
de: Unbekannt
es: Desconocido
pt: Desconhecido
zh: 未知

# priceLabel
source: Price:
ar: السعر:
de: Preis:
es: Precio:
pt: Preço:
zh: 价格:

# scheduledLabel
source: Scheduled
ar: مجدول
de: Geplant
es: Programado
pt: Agendado
zh: 已安排

# tripIdLabel
source: Trip ID:
ar: معرف الرحلة:
de: Fahrt-ID:
es: ID del viaje:
pt: ID da viagem:
zh: 行程ID:

# idCopiedText
source: Trip ID copied!
ar: تم نسخ معرف الرحلة!
de: Fahrt-ID kopiert!
es: ¡ID del viaje copiado!
pt: ID da viagem copiado!
zh: 行程ID已复制！

source: User not logged in.
ar: المستخدم غير مسجل الدخول. الرجاء تسجيل الدخول.
de: Benutzer nicht angemeldet.
es: Usuario no ha iniciado sesión. Por favor, inicia sesión.
pt: Usuário não está logado. Por favor, faça login.
zh: 用户未登录。请登录。

# accountTitle
source: Account
ar: الحساب
de: Konto
es: Cuenta
pt: Conta
zh: 帐户

source: General Settings
ar: الإعدادات العامة
de: Allgemeine Einstellungen
es: Configuración general
pt: Configurações gerais
zh: 常规设置

source: Dark Mode
ar: الوضع الداكن
de: Dunkelmodus
es: Modo oscuro
pt: Modo escuro
zh: 深色模式

source: Change Language
ar: تغيير اللغة
de: Sprache ändern
es: Cambiar idioma
pt: Mudar idioma
zh: 更改语言

source: Information
ar: المعلومات
es: Información
pt: Informação
zh: 信息

# aboutUsAndPolicy
source: About Us & Policy
ar: حولنا والسياسة
de: Über uns & Richtlinie
es: Sobre nosotros y política
pt: Sobre nós e política
zh: 关于我们和政策

source: Account Actions
ar: إجراءات الحساب
de: Konto-Aktionen
es: Acciones de la cuenta
pt: Ações da conta
zh: 帐户操作

# deleteAccountWarning
source: This action is permanent and cannot be undone.
ar: هذا الإجراء دائم ولا يمكن التراجع عنه.
de: Diese Aktion ist permanent und kann nicht rückgängig gemacht werden.
es: Esta acción es permanente y no se puede deshacer.
pt: Esta ação é permanente e não pode ser desfeita.
zh: 此操作是永久性的，无法撤消。

source: Delete
ar: حذف
de: Löschen
es: Eliminar
pt: Excluir
zh: 删除

# failedToUpdate
source: Failed to update: {error}
ar: فشنيل التحديث: {error}
de: Fehler beim Aktualisieren: {error}
es: Error al actualizar: {error}
pt: Falha ao atualizar: {error}
zh: 更新失败：{error}

# errorDeletingAccount
source: Error deleting account: {error}
ar: خطأ في حذف الحساب: {error}
de: Fehler beim Löschen des Kontos: {error}
es: Error al eliminar la cuenta: {error}
pt: Erro ao excluir a conta: {error}
zh: 删除帐户时出错：{error}

# drawerGuest
source: Guest
ar: ضيف
de: Gast
es: Invitado
pt: Convidado
zh: 访客

# drawerUser
source: User
ar: المستخدم
de: Benutzer
es: Usuario
pt: Usuário
zh: 用户

# drawerUpdateApp
source: Update App
ar: تحديث التطبيق
de: App aktualisieren
es: Actualizar aplicación
pt: Atualizar aplicativo
zh: 更新应用

# drawerHelpAndSupport
source: Help & Support
ar: المساعدة والدعم
de: Hilfe & Support
es: Ayuda y soporte
pt: Ajuda e suporte
zh: 帮助与支持

# drawerErrorLoadingUser
source: Error loading user data
ar: خطأ في تحميل بيانات المستخدم
de: Fehler beim Laden der Benutzerdaten
es: Error al cargar los datos del usuario
pt: Erro ao carregar dados do usuário
zh: 加载用户数据时出错

# drawerUserDataNotFound
source: User data not found
ar: بيانات المستخدم غير موجودة
de: Benutzerdaten nicht gefunden
es: Datos del usuario no encontrados
pt: Dados do usuário não encontrados
zh: 找不到用户数据

# drawerAccountSettings
source: Account Settings
ar: إعدادات الحساب
de: Kontoeinstellungen
es: Configuración de la cuenta
pt: Configurações da conta
zh: 账户设置

# drawerMyServices
source: My Services
ar: خدماتي
de: Meine Dienste
es: Mis servicios
pt: Meus serviços
zh: 我的服务

# drawerSearchingCouriers
source: Searching Couriers
ar: البحث عن سعاة
de: Kuriersuche
es: Buscando mensajeros
pt: Procurando por entregadores
zh: 正在搜索快递员

source: Choose loading position
ar: اختر موقع التحميل
de: Ladeposition wählen
es: Elegir posición de carga
pt: Escolha a posição de carregamento
zh: 选择装货位置

source: Loading...
ar: جاري التحميل...
de: Lädt...
es: Cargando...
pt: A carregar...
zh: 加载中...

source: Back
ar: رجوع
de: Zurück
es: Atrás
pt: Voltar
zh: 返回

source: Confirm position
ar: تأكيد
de: Position bestätigen
es: Confirmar posición
pt: Confirmar posição
zh: 确认位置

source: Home
ar: الرئيسية
de: Startseite
es: Inicio
pt: Início
zh: 主页

source: History
ar: السجل
de: Verlauf
es: Historial
pt: Histórico
zh: 历史记录

source: Account
ar: الحساب
de: Konto
es: Cuenta
pt: Conta
zh: 账户

source: Cancel Order?
ar: إلغاء الطلب؟
de: Bestellung stornieren?
es: ¿Cancelar pedido?
pt: Cancelar pedido?
zh: 取消订单？

# cancelOrderMessage
source: Are you sure you want to permanently cancel this order?
ar: هل أنت متأكد أنك تريد إلغاء هذا الطلب نهائيًا؟
de: Sind Sie sicher, dass Sie diese Bestellung dauerhaft stornieren möchten?
es: ¿Estás seguro de que deseas cancelar permanentemente este pedido?
pt: Tem certeza de que deseja cancelar permanentemente este pedido?
zh: 您确定要永久取消此订单吗？

source: Keep Order
ar: الاحتفاظ بالطلب
de: Bestellung behalten
es: Mantener pedido
pt: Manter pedido
zh: 保留订单

source: Yes, Cancel
ar: نعم، إلغاء
de: Ja, stornieren
es: Sí, cancelar
pt: Sim, cancelar
zh: 是的，取消

# orderCanceledSuccess
source: Order successfully canceled.
ar: تم إلغاء الطلب بنجاح.
de: Bestellung erfolgreich storniert.
es: Pedido cancelado exitosamente.
pt: Pedido cancelado com sucesso.
zh: 订单已成功取消。

# orderCancelFailed
source: Failed to cancel order: {error}
ar: فشنيل في إلغاء الطلب: {error}
de: Bestellung konnte nicht storniert werden: {error}
es: No se pudo cancelar el pedido: {error}
pt: Falha ao cancelar o pedido: {error}
zh: 取消订单失败：{error}

source: Connecting...
ar: جارٍ الاتصال...
de: Verbinde...
es: Conectando...
pt: Conectando...
zh: 连接中...

# error
source: Error: {error}
ar: خطأ
de: Fehler: {error}
es: Error
pt: Erro
zh: 错误

source: Order not found
ar: الطلب غير موجود
de: Bestellung nicht gefunden
es: Orden no encontrada
pt: Pedido não encontrado
zh: 未找到订单

# searchingForDrivers
source: Searching for Nearby Drivers...
ar: البحث عن سائقين قريبين...
de: Suche nach Fahrern in der Nähe...
es: Buscando conductores cercanos...
pt: Procurando motoristas próximos...
zh: 正在搜索附近的司机...

source: Final Drop-off
ar: موقع الإنزال النهائي
de: Endgültiger Ablageort
es: Lugar de destino final
pt: Local de entrega final
zh: 最终下车地点

source: Drop-off {number}
ar: إنزال {number}
de: Ablage {number}
es: Destino {number}
pt: Entrega {number}
zh: 下车点 {number}

source: Cancel Search
ar: إلغاء البحث
de: Suche abbrechen
es: Cancelar búsqueda
pt: Cancelar busca
zh: 取消搜索

source: {distance} km
ar: {distance} كم
zh: {distance} 公里

# tndPrice
source: {price} TND
ar: {price} د.ت

source: Vehicle Type
ar: نوع المركبة
de: Fahrzeugtyp
es: Tipo de Vehículo
pt: Tipo de Veículo
zh: 车辆类型

source: Light Vehicles
ar: مركبات خفيفة
de: Leichte Fahrzeuge
es: Vehículos Ligeros
pt: Veículos Leves
zh: 轻型车辆

source: Heavy Vehicles
ar: مركبات ثقيلة
de: Schwere Fahrzeuge
es: Vehículos Pesados
pt: Veículos Pesados
zh: 重型车辆

source: Moto
ar: دراجة نارية
de: Motorrad
es: Motocicleta
zh: 摩托车

source: Small Utility
ar: مركبة نفعية صغيرة
de: Kleiner Transporter
es: Vehículo Utilitario Pequeño
pt: Pequena Utilitária
zh: 小型货车

source: Van
ar: شاحنة صغيرة
de: Lieferwagen
es: Furgoneta
pt: Furgonete
zh: 厢式货车

source: Van 3.5T
ar: شاحنة صغيرة 3.5 طن
de: Lieferwagen 3.5T
es: Furgoneta 3.5T
pt: Furgonete 3.5T
zh: 3.5吨厢式货车

source: Large Van
ar: شاحنة كبيرة
de: Großer Transporter
es: Furgón Grande
pt: Furgão Grande
zh: 大型货车

source: Heavy Truck
ar: شاحنة ثقيلة
de: Schwerlastwagen
es: Camión Pesado
pt: Caminhão Pesado
zh: 重型卡车

source: Super Heavy Truck
ar: شاحنة ثقيلة جداً
de: Superschwerer Lastwagen
es: Camión súper pesado
pt: Caminhão Super Pesado
zh: 超重型卡车

# weightUpTo
source: Up to {weight}
ar: حتى {weight}
de: Bis zu {weight}
es: Hasta {weight}
pt: Até {weight}
zh: 承重 {weight}

# idealForSmallVolumes
source: Ideal for small volumes and speed
ar: مثالي للأحجام الصغيرة والسرعة
de: Ideal für kleine Volumina und Geschwindigkeit
es: Ideal para pequeños volúmenes y velocidad
pt: Ideal para pequenos volumes e velocidade
zh: 适用于小件物品和快速运输

# idealForAppliances
source: Ideal for appliances or a few pieces of furniture
ar: مثالي للأجهزة المنزلية أو بعض الأثاث
de: Ideal für Haushaltsgeräte oder wenige Möbelstücke
es: Ideal para electrodomésticos o algunos muebles
pt: Ideal para eletrodomésticos ou alguns móveis
zh: 适用于家电或少量家具

# perfectForMaterials
source: Perfect for materials or small moves
ar: مثالي للمواد أو الانتقالات الصغيرة
de: Perfekt für Materialien oder kleine Umzüge
es: Perfecto para materiales o pequeñas mudanzas
pt: Perfeito para materiais ou pequenas mudanças
zh: 适用于建材或小型搬家

# forFullStudioMove
source: For a full studio move
ar: للنقل الكامل لشقة استوديو
de: Für einen kompletten Studio-Umzug
es: Para una mudanza de estudio completa
pt: Para uma mudança completa de estúdio
zh: 适用于整套单间搬家

source: For larger moves
ar: للانتقالات الكبيرة
de: Für größere Umzüge
es: Para mudanzas más grandes
pt: Para mudanças maiores
zh: 适用于大型搬家

# forLargeVolumes
source: For large volumes and goods
ar: للأحجام الكبيرة والبضائع
de: Für große Volumina und Güter
es: Para grandes volúmenes y mercancías
pt: Para grandes volumes e mercadorias
zh: 适用于大件物品和货物

source: For exceptional transports
ar: للنقل الاستثنائي
de: Für außergewöhnliche Transporte
es: Para transportes excepcionales
pt: Para transportes excepcionais
zh: 适用于特殊运输

# fastestTag
source: Fastest
ar: الأسرع
de: Am schnellsten
es: Más rápido
pt: O mais rápido
zh: 最快

# mostEconomicalTag
source: Most economical
ar: الأكثر اقتصادًا
de: Am wirtschaftlichsten
es: Más económico
pt: O mais econômico
zh: 最经济

# mostPopularTag
source: Most popular
ar: الأكثر شيوعًا
de: Am beliebtesten
es: Más popular
pt: O mais popular
zh: 最受欢迎

# mostEfficientTag
source: Most efficient
ar: الأكثر كفاءة
de: Am effizientesten
es: Más eficiente
pt: O mais eficiente
zh: 最有效

# bestValueTag
source: Best value
ar: أفضل قيمة
de: Bestes Preis-Leistungs-Verhältnis
es: Mejor relación calidad-precio
pt: Melhor valor
zh: 性价比最高

# heavyCapacityTag
source: Heavy capacity
ar: سعة حمولة ثقيلة
de: Schwere Kapazität
es: Capacidad pesada
pt: Capacidade pesada
zh: 重型容量

# maximumCapacityTag
source: Maximum capacity
ar: أقصى سعة
de: Maximale Kapazität
es: Capacidad máxima
pt: Capacidade máxima
zh: 最大容量

# notSureVehicle
source: Not sure about the vehicle? Calculate your volume here
ar: لست متأكدًا من المركبة؟ احسب حجمك هنا
de: Nicht sicher, welches Fahrzeug? Berechnen Sie hier Ihr Volumen
es: ¿No está seguro del vehículo? Calcule su volumen aquí
pt: Não tem certeza do veículo? Calcule seu volume aqui
zh: 不确定车辆类型？在此处计算您的体积

# continueButton
source: Continue
ar: متابعة
de: Weiter
es: Continuar
pt: Continuar
zh: 继续

source: Create
ar: إنشاء
de: Erstellen
es: Crear
pt: Criar
zh: 创建

source: Delivery
ar: توصيل
de: Lieferung
es: Entrega
pt: Entrega
zh: 正在派送

source: Pending
ar: قيد الانتظار
de: Ausstehend
es: Pendiente
pt: Pendente
zh: 待处理

# errorLoadingDeals
source: Error loading deals: {error}
ar: خطأ في تحميل العروض: {error}
de: Fehler beim Laden der Lieferungen: {error}
es: Error al cargar las entregas: {error}
pt: Erro ao carregar entregas: {error}
zh: 加载交易错误：{error}

# errorLoadingOrders
source: Error loading orders: {error}
ar: خطأ في تحميل الطلبات: {error}
de: Fehler beim Laden der Bestellungen: {error}
es: Error al cargar los pedidos: {error}
pt: Erro ao carregar pedidos: {error}
zh: 加载订单错误：{error}

source: Invalid deal ID
ar: معرف الصفقة غير صالح
de: Ungültige Deal-ID
es: ID de acuerdo no válido
pt: ID de negócio inválido
zh: 无效的交易ID

# failedToLoadDetails
source: Failed to load delivery details: {error}
ar: فشنيل في تحميل تفاصيل التسليم: {error}
de: Fehler beim Laden der Lieferdetails: {error}
es: Error al cargar los detalles de la entrega: {error}
pt: Falha ao carregar detalhes da entrega: {error}
zh: 加载配送详情失败：{error}

source: Deal not found
ar: الصفقة غير موجودة
de: Deal nicht gefunden
es: Acuerdo no encontrado
pt: Negócio não encontrado
zh: 未找到交易

# driverNotFound
source: Driver user data not found
ar: بيانات مستخدم السائق غير موجودة
de: Fahrer-Benutzerdaten nicht gefunden
es: Datos de usuario del conductor no encontrados
pt: Dados de usuário do motorista não encontrados
zh: 未找到司机的用户数据

# missingDriverOrOrderId
source: Driver or Order ID missing
ar: معرف السائق أو الطلب مفقود
de: Fahrer- oder Bestell-ID fehlt
es: Falta el ID del conductor o del pedido
pt: ID do motorista ou do pedido faltando
zh: 缺少司机或订单ID

source: Driver location unavailable.
ar: موقع السائق غير متاح.
de: Fahrerstandort nicht verfügbar.
es: Ubicación del conductor no disponible.
pt: Localização do motorista indisponível.
zh: 司机位置不可用。

# failedToLoadRoute
source: Failed to load route: {error}
ar: فشنيل في تحميل المسار: {error}
de: Fehler beim Laden der Route: {error}
es: No se pudo cargar la ruta: {error}
pt: Falha ao carregar a rota: {error}
zh: 加载路线失败：{error}

# deliveryCanceled
source: Delivery has been canceled.
ar: تم إلغاء التسليم.
de: Lieferung wurde storniert.
es: La entrega ha sido cancelada.
pt: A entrega foi cancelada.
zh: 配送已取消。

# phoneAppLaunchFailed
source: Could not launch phone app.
ar: تعذر تشغيل تطبيق الهاتف.
de: Telefon-App konnte nicht gestartet werden.
es: No se pudo iniciar la aplicación de teléfono.
pt: Não foi possível iniciar o aplicativo de telefone.
zh: 无法启动电话应用程序。

source: Distance
ar: المسافة
de: Entfernung
es: DISTANCIA
pt: DISTÂNCIA
zh: 距离

source: Time
ar: الوقت
de: Zeit
es: Tiempo
pt: Tempo
zh: 时间

# driverOnTheWayToPickup
source: Driver is on the way to pickup
ar: السائق في الطريق للاستلام
de: Fahrer ist auf dem Weg zur Abholung
es: El conductor está en camino a la recogida
pt: O motorista está a caminho da coleta
zh: 司机正在前往取货

# driverHasItemsOnTheWay
source: Driver has the items and is on the way
ar: السائق لديه الأغراض وفي الطريق
de: Fahrer hat die Artikel und ist unterwegs
es: El conductor tiene los artículos y está en camino
pt: O motorista está com os itens e a caminho
zh: 司机已取件并正在路上

source: Delivery completed!
ar: اكتمل التسليم!
de: Lieferung abgeschlossen!
es: ¡Entrega completada!
pt: Entrega concluída!
zh: 配送已完成！

source: Delivery Route
ar: مسار التسليم
de: Lieferroute
es: Ruta de entrega
pt: Rota de entrega
zh: 配送路线

source: Could not launch phone app.
ar: تعذر تشغيل تطبيق الهاتف.
de: Telefon-App konnte nicht gestartet werden.
es: No se pudo iniciar la aplicación de teléfono.
pt: Não foi possível iniciar o aplicativo de telefone.
zh: 无法启动电话应用程序。

# enterValidPhoneNumber
source: Please enter a valid phone number to search.
ar: الرجاء إدخال رقم هاتف صالح للبحث.
de: Bitte geben Sie eine gültige Telefonnummer ein, um zu suchen.
es: Por favor, introduce un número de teléfono válido para buscar.
pt: Por favor, insira um número de telefone válido para pesquisar.
zh: 请输入有效的电话号码进行搜索。

# noOrderFoundForPhone
source: No order found for this phone number.
ar: لم يتم العثور على طلب لهذا الرقم.
de: Keine Bestellung für diese Telefonnummer gefunden.
es: No se encontró ninguna orden para este número de teléfono.
pt: Nenhum pedido encontrado para este número de telefone.
zh: 未找到该电话号码的订单。

# noActiveDealsFound
source: No active deals found for this order.
ar: لم يتم العثور على طلبات نشطة لهذا الرقم.
de: Keine aktiven Deals für diese Bestellung gefunden.
es: No se encontraron acuerdos activos para esta orden.
pt: Nenhum negócio ativo encontrado para este pedido.
zh: 该订单没有找到活跃交易。

# errorSearchingOrder
source: Error searching for the order: {error}
ar: حدث خطأ أثناء البحث عن الطلب: {error}
de: Fehler bei der Suche nach der Bestellung: {error}
es: Error al buscar la orden: {error}
pt: Erro ao pesquisar o pedido: {error}
zh: 搜索订单时出错：{error}

source: On the way
ar: في الطريق
de: Unterwegs
es: En camino
pt: A caminho
zh: 在路上

source: Returned
ar: تم الإرجاع
de: Zurückgegeben
es: Devuelto
pt: Devolvido
zh: 已退回

source: Delivered successfully
ar: تم التسليم بنجاح
de: Erfolgreich zugestellt
es: Entregado con éxito
pt: Entregue com sucesso
zh: 成功送达

source: Track Your Courier
ar: تتبع ساعيك
de: Verfolgen Sie Ihren Kurier
es: Rastrea tu mensajero
pt: Rastreie seu Mensageiro
zh: 追踪您的快递员

source: Your courier awaits!
ar: ساعيك في انتظارك!
de: Ihr Kurier wartet!
es: ¡Tu mensajero te espera!
pt: Seu mensageiro está à espera!
zh: 您的快递员正在等待！

# enterCustomerPhoneNumber
source: Enter your phone number
ar: أدخل رقم هاتفك
de: Geben Sie Ihre Telefonnummer ein
es: Introduce tu número de teléfono
pt: Digite seu número de telefone
zh: 输入您的电话号码

source: Search
ar: بحث
de: Suchen
es: Buscar
pt: Pesquisar
zh: 搜索

# noResultsFound
source: No results to display. Try searching with a phone number.
ar: لا توجد نتائج للعرض. حاول البحث باستخدام رقم هاتف.
de: Keine Ergebnisse anzuzeigen. Versuchen Sie, mit einer Telefonnummer zu suchen.
es: No se encontraron resultados. Intenta buscar con un número de teléfono.
pt: Nenhum resultado para exibir. Tente pesquisar com um número de telefone.
zh: 没有结果可显示。请尝试使用电话号码进行搜索。

source: Status
ar: الحالة
es: Estado
zh: 状态

source: View Courier on Live Map
ar: عرض الساعي على الخريطة المباشرة
de: Kurier auf der Live-Karte ansehen
es: Ver mensajero en el mapa en vivo
pt: Ver Mensageiro no Mapa ao Vivo
zh: 在实时地图上查看快递员

# trackingNotAvailable
source: Tracking is not available at this moment.
ar: التتبع غير متاح في الوقت الحالي.
de: Die Sendungsverfolgung ist derzeit nicht verfügbar.
es: El seguimiento no está disponible en este momento.
pt: O rastreamento não está disponível no momento.
zh: 目前无法进行追踪。

# failedToUpdateDealStatus
source: Failed to update deal status: {error}
ar: فشنيل في تحديث حالة الصفقة: {error}
de: Fehler beim Aktualisieren des Deal-Status: {error}
es: No se pudo actualizar el estado del acuerdo: {error}
pt: Falha ao atualizar o status do negócio: {error}
zh: 更新交易状态失败：{error}

# failedToUpdateOrder
source: Failed to update order: {error}
ar: فشنيل في تحديث الطلب: {error}
de: Fehler beim Aktualisieren der Bestellung: {error}
es: No se pudo actualizar la orden: {error}
pt: Falha ao atualizar o pedido: {error}
zh: 更新订单失败：{error}

# failedToUpdateStops
source: Failed to update stops: {error}
ar: فشنيل في تحديث المحطات: {error}
de: Fehler beim Aktualisieren der Stopps: {error}
es: No se pudo actualizar las paradas: {error}
pt: Falha ao atualizar as paradas: {error}
zh: 更新站点失败：{error}

# failedToCenterOnDriver
source: Failed to center on driver: {error}
ar: فشنيل في التمركز على السائق: {error}
de: Fehler beim Zentrieren auf den Fahrer: {error}
es: No se pudo centrar en el conductor: {error}
pt: Falha ao centralizar no motorista: {error}
zh: 无法居中显示司机位置：{error}

source: Confirm Cancellation
ar: تأكيد الإلغاء
de: Stornierung bestätigen
es: Confirmar cancelación
pt: Confirmar Cancelamento
zh: 确认取消

# areYouSureToCancel
source: Are you sure you want to cancel this delivery?
ar: هل أنت متأكد أنك تريد إلغاء هذا التسليم؟
de: Sind Sie sicher, dass Sie diese Lieferung stornieren möchten?
es: ¿Estás seguro de que deseas cancelar esta entrega?
pt: Tem certeza de que deseja cancelar esta entrega?
zh: 您确定要取消此配送吗？

# noButton
source: No
ar: لا
de: Nein
pt: Não
zh: 否

# yesCancelButton
source: Yes, Cancel
ar: نعم، إلغاء
de: Ja, stornieren
es: Sí, cancelar
pt: Sim, Cancelar
zh: 是，取消

# deliveryStatusUpdatedSuccessfully
source: Delivery {status} successfully.
ar: تم تحديث حالة التسليم بنجاح.
de: Lieferung {status} erfolgreich.
es: Entrega {status} con éxito.
pt: Entrega {status} com sucesso.
zh: 配送状态已成功更新。

# failedToUpdateStatus
source: Failed to update status: {error}
ar: فشنيل في تحديث الحالة: {error}
de: Fehler beim Aktualisieren des Status: {error}
es: No se pudo actualizar el estado: {error}
pt: Falha ao atualizar o status: {error}
zh: 更新状态失败：{error}

# osrmServerError
source: OSRM server error with status
ar: خطأ في خادم OSRM بالحالة
de: OSRM-Serverfehler mit Status
es: Error del servidor de enrutamiento (OSRM) con estado
pt: Erro de servidor OSRM com status
zh: OSRM服务器错误，状态

# osrmApiError
source: OSRM API Error: {error}
ar: خطأ في واجهة برمجة تطبيقات OSRM: {error}
de: OSRM-API-Fehler: {error}
es: Error de la API de OSRM: {error}
pt: Erro da API OSRM: {error}
zh: OSRM API错误：{error}
