Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# infoSharingBody
source: We may share your information with specific parties to deliver our services, comply with legal obligations, or improve the App. We ensure that any sharing is conducted responsibly and in accordance with applicable laws. **4.1 Sharing with Other Users** - **Customer-Driver Interactions**: When a Customer submits a service request, their name, contact details (e.g., phone number), pickup/delivery locations, and package details are shared with the assigned Driver to facilitate the delivery. - **Driver Performance Display**: Customers can view Driver performance metrics, such as ratings (based on reliability, communication, and delivery success) and years of experience, before confirming a booking. - **B2B Coordination**: For Business Partners, we may share logistics-related data (e.g., delivery schedules, employee contact details) with Drivers or third-party providers to fulfill contracts. **4.2 Sharing with Service Providers** We engage trusted third-party service providers to support our operations. These providers are contractually obligated to protect your data and use it only for the purposes we specify: - **Mapping and Navigation**: Mapbox receives location data to provide mapping, routing, and geolocation services within the App. - **Analytics Providers**: Firebase Analytics and other tools receive anonymized usage data to generate insights on App performance and user behavior. - **Cloud Storage**: We use secure cloud providers (e.g., AWS, Google Cloud) to store user data, with encryption and access controls in place. - **Verification Services**: Third-party services verify Driver identities, driving records, and vehicle compliance to ensure safety and regulatory compliance. - **Customer Support Tools**: Platforms like Zendesk manage support tickets and store communication data to assist users effectively. **4.3 Legal and Regulatory Sharing** - We may share your information with government authorities, law enforcement, or regulatory bodies when required by law, such as in response to subpoenas, court orders, or tax audits. - In cases of suspected fraud, abuse, or illegal activity, we may share relevant data with authorities to investigate or prevent harm. **4.4 Business Transfers** - If Schnell Logistics is involved in a merger, acquisition, or asset sale, your information may be transferred to the acquiring entity. You will be notified of any such transfer and given the opportunity to opt out where applicable. - We will ensure that any transferee agrees to protect your data in accordance with this policy or a comparable standard. **4.5 Anonymized Data Sharing** - We may share aggregated or anonymized data (e.g., delivery trends, user demographics) with partners, researchers, or advertisers. This data does not identify individuals and is used for statistical or marketing purposes. **4.6 Consent-Based Sharing** - We will not share your personal information with third parties for marketing purposes without your explicit consent. You can withdraw consent at any time via the App or by contacting us.
ar: قد نشارك معلوماتك مع أطراف محددة لتقديم خدماتنا، أو الامتثال للالتزامات القانونية، أو تحسين التطبيق. نضمن أن أي مشاركة تتم بمسؤولية ووفقًا للقوانين المعمول بها. **4.1 المشاركة مع المستخدمين الآخرين** - **تفاعلات العميل-السائق**: عندما يقدم العميل طلب خدمة، تتم مشاركة اسمه وتفاصيل الاتصال (مثل رقم الهاتف) ومواقع الاستلام/التسليم وتفاصيل الطرد مع السائق المخصص لتسهيل عملية التسليم. - **عرض أداء السائق**: يمكن للعملاء عرض مقاييس أداء السائق، مثل التقييمات (بناءً على الموثوقية، والتواصل، ونجاح التسليم) وسنوات الخبرة، قبل تأكيد الحجز. - **التنسيق بين الشركات**: بالنسبة لشركاء الأعمال، قد نشارك البيانات المتعلقة بالخدمات اللوجستية (مثل جداول التسليم، وتفاصيل الاتصال بالموظفين) مع السائقين أو مقدمي الخدمات من الأطراف الثالثة لإتمام العقود. **4.2 المشاركة مع مقدمي الخدمات** نحن نتعاقد مع مقدمي خدمات موثوق بهم من الأطراف الثالثة لدعم عملياتنا. يلتزم هؤلاء المقدمون تعاقديًا بحماية بياناتك واستخدامها فقط للأغراض التي نحددها: - **الخرائط والملاحة**: تتلقى Mapbox بيانات الموقع لتوفير خدمات الخرائط والتوجيه وتحديد الموقع الجغرافي داخل التطبيق. - **مقدمو التحليلات**: تتلقى Firebase Analytics وغيرها من الأدوات بيانات استخدام مجهولة الهوية لتوليد رؤى حول أداء التطبيق وسلوك المستخدم. - **التخزين السحابي**: نستخدم مزودي خدمات سحابية آمنين (مثل AWS، وGoogle Cloud) لتخزين بيانات المستخدم، مع وجود تشفير وضوابط وصول. - **خدمات التحقق**: تتحقق خدمات الأطراف الثالثة من هويات السائقين، وسجلات القيادة، وامتثال السيارة لضمان السلامة والامتثال التنظيمي. - **أدوات دعم العملاء**: تدير منصات مثل Zendesk تذاكر الدعم وتخزن بيانات الاتصال لمساعدة المستخدمين بشكل فعال. **4.3 المشاركة القانونية والتنظيمية** - قد نشارك معلوماتك مع السلطات الحكومية أو سلطات إنفاذ القانون أو الهيئات التنظيمية عندما يقتضي القانون ذلك، مثل الرد على مذكرات الاستدعاء أو أوامر المحكمة أو التدقيقات الضريبية. - في حالات الاحتيال المشتبه به أو الإساءة أو النشاط غير القانوني، قد نشارك البيانات ذات الصلة مع السلطات للتحقيق أو منع الضرر. **4.4 تحويلات الأعمال** - إذا كانت شركة شنيل اللوجستية متورطة في اندماج أو استحواذ أو بيع أصول، فقد يتم نقل معلوماتك إلى الكيان المستحوذ. سيتم إخطارك بأي نقل من هذا القبيل ومنحك الفرصة لرفض المشاركة عند الاقتضاء. - سنتأكد من أن أي جهة منقول إليها توافق على حماية بياناتك وفقًا لهذه السياسة أو معيار مماثل. **4.5 مشاركة البيانات المجهولة الهوية** - قد نشارك بيانات مجمعة أو مجهولة الهوية (مثل اتجاهات التسليم، والتركيبة السكانية للمستخدمين) مع الشركاء أو الباحثين أو المعلنين. لا تحدد هذه البيانات الأفراد وتستخدم لأغراض إحصائية أو تسويقية. **4.6 المشاركة القائمة على الموافقة** - لن نشارك معلوماتك الشخصية مع أطراف ثالثة لأغراض التسويق دون موافقتك الصريحة. يمكنك سحب الموافقة في أي وقت عبر التطبيق أو عن طريق الاتصال بنا.
de: Wir können Ihre Informationen an bestimmte Parteien weitergeben, um unsere Dienste bereitzustellen, rechtlichen Verpflichtungen nachzukommen oder die App zu verbessern. Wir stellen sicher, dass jede Weitergabe verantwortungsvoll und in Übereinstimmung mit den geltenden Gesetzen erfolgt. **4.1 Weitergabe an andere Nutzer** - **Kunden-Fahrer-Interaktionen**: Wenn ein Kunde eine Dienstanfrage sendet, werden sein Name, seine Kontaktdaten (z. B. Telefonnummer), Abhol-/Lieferorte und Paketdetails an den zugewiesenen Fahrer weitergegeben, um die Lieferung zu erleichtern. - **Anzeige der Fahrerleistung**: Kunden können die Leistungskennzahlen des Fahrers, wie z. B. Bewertungen (basierend auf Zuverlässigkeit, Kommunikation und Liefererfolg) und Dienstjahre, einsehen, bevor sie eine Buchung bestätigen. - **B2B-Koordination**: Für Geschäftspartner können wir logistikbezogene Daten (z. B. Lieferpläne, Kontaktdaten von Mitarbeitern) an Fahrer oder Drittanbieter weitergeben, um Verträge zu erfüllen. **4.2 Weitergabe an Dienstleister** Wir beauftragen vertrauenswürdige Drittanbieter, um unsere Operationen zu unterstützen. Diese Anbieter sind vertraglich verpflichtet, Ihre Daten zu schützen und sie nur für die von uns festgelegten Zwecke zu verwenden: - **Kartierung und Navigation**: Mapbox erhält Standortdaten, um Karten-, Routing- und Geolokalisierungsdienste innerhalb der App bereitzustellen. - **Analyseanbieter**: Firebase Analytics und andere Tools erhalten anonymisierte Nutzungsdaten, um Einblicke in die App-Leistung und das Nutzerverhalten zu gewinnen. - **Cloud-Speicher**: Wir verwenden sichere Cloud-Anbieter (z. B. AWS, Google Cloud), um Nutzerdaten zu speichern, wobei Verschlüsselung und Zugriffskontrollen vorhanden sind. - **Verifizierungsdienste**: Drittanbieterdienste überprüfen die Identität von Fahrern, die Fahrhistorie und die Einhaltung der Fahrzeugvorschriften, um Sicherheit und behördliche Einhaltung zu gewährleisten. - **Kundensupport-Tools**: Plattformen wie Zendesk verwalten Support-Tickets und speichern Kommunikationsdaten, um Nutzer effektiv zu unterstützen. **4.3 Rechtliche und behördliche Weitergabe** - Wir können Ihre Informationen an Regierungsbehörden, Strafverfolgungsbehörden oder Aufsichtsbehörden weitergeben, wenn dies gesetzlich vorgeschrieben ist, z. B. als Reaktion auf Vorladungen, Gerichtsbeschlüsse oder Steuerprüfungen. - In Fällen von vermutetem Betrug, Missbrauch oder illegalen Aktivitäten können wir relevante Daten an Behörden weitergeben, um Ermittlungen durchzuführen oder Schaden zu verhindern. **4.4 Geschäftsübertragungen** - Wenn Schnell Logistics an einer Fusion, einem Erwerb oder einem Vermögensverkauf beteiligt ist, können Ihre Informationen an die erwerbende Einheit übertragen werden. Sie werden über eine solche Übertragung benachrichtigt und erhalten, falls zutreffend, die Möglichkeit, sich abzumelden. - Wir werden sicherstellen, dass jeder Übernehmer zustimmt, Ihre Daten gemäß dieser Richtlinie oder einem vergleichbaren Standard zu schützen. **4.5 Weitergabe von anonymisierten Daten** - Wir können aggregierte oder anonymisierte Daten (z. B. Liefertrends, Nutzerdemografie) an Partner, Forscher oder Werbetreibende weitergeben. Diese Daten identifizieren keine Einzelpersonen und werden für statistische oder Marketingzwecke verwendet. **4.6 Zustimmungsbasierte Weitergabe** - Wir werden Ihre persönlichen Daten nicht ohne Ihre ausdrückliche Zustimmung zu Marketingzwecken an Dritte weitergeben. Sie können die Zustimmung jederzeit über die App oder durch Kontaktaufnahme mit uns widerrufen.
es: Podemos compartir su información con partes específicas para prestar nuestros servicios, cumplir con las obligaciones legales o mejorar la Aplicación. Nos aseguramos de que cualquier intercambio se realice de manera responsable y de acuerdo con las leyes aplicables. **4.1 Compartir con otros usuarios** - **Interacciones cliente-conductor**: Cuando un Cliente envía una solicitud de servicio, su nombre, datos de contacto (por ejemplo, número de teléfono), ubicaciones de recogida/entrega y detalles del paquete se comparten con el Conductor asignado para facilitar la entrega. - **Visualización de rendimiento del conductor**: Los Clientes pueden ver las métricas de rendimiento del Conductor, como las calificaciones (basadas en la fiabilidad, la comunicación y el éxito de la entrega) y los años de experiencia, antes de confirmar una reserva. - **Coordinación B2B**: Para los Socios comerciales, podemos compartir datos relacionados con la logística (por ejemplo, horarios de entrega, datos de contacto de los empleados) con Conductores o proveedores de terceros para cumplir con los contratos. **4.2 Compartir con proveedores de servicios** Contratamos a proveedores de servicios de terceros de confianza para apoyar nuestras operaciones. Estos proveedores están contractualmente obligados a proteger sus datos y a utilizarlos únicamente para los fines que especificamos: - **Mapeo y navegación**: Mapbox recibe datos de ubicación para proporcionar servicios de mapeo, enrutamiento y geolocalización dentro de la Aplicación. - **Proveedores de análisis**: Firebase Analytics y otras herramientas reciben datos de uso anonimizados para generar información sobre el rendimiento de la Aplicación y el comportamiento del usuario. - **Almacenamiento en la nube**: Utilizamos proveedores de la nube seguros (por ejemplo, AWS, Google Cloud) para almacenar los datos de los usuarios, con cifrado y controles de acceso implementados. - **Servicios de verificación**: Los servicios de terceros verifican las identidades de los conductores, los antecedentes de conducción y el cumplimiento de los vehículos para garantizar la seguridad y el cumplimiento normativo. - **Herramientas de atención al cliente**: Plataformas como Zendesk gestionan los tickets de soporte y almacenan los datos de comunicación para ayudar a los usuarios de manera efectiva. **4.3 Compartir legal y regulatorio** - Podemos compartir su información con las autoridades gubernamentales, las fuerzas del orden o los organismos reguladores cuando lo exija la ley, por ejemplo, en respuesta a citaciones, órdenes judiciales o auditorías fiscales. - En casos de sospecha de fraude, abuso o actividad ilegal, podemos compartir los datos relevantes con las autoridades para investigar o prevenir daños. **4.4 Transferencias de negocio** - Si shnell Logistics está involucrada en una fusión, adquisición o venta de activos, su información puede ser transferida a la entidad adquirente. Se le notificará sobre dicha transferencia y se le dará la oportunidad de optar por no participar cuando corresponda. - Nos aseguraremos de que cualquier cesionario acepte proteger sus datos de acuerdo con esta política o un estándar comparable. **4.5 Compartir datos anonimizados** - Podemos compartir datos agregados o anonimizados (por ejemplo, tendencias de entrega, demografía del usuario) con socios, investigadores o anunciantes. Estos datos no identifican a las personas y se utilizan con fines estadísticos o de marketing. **4.6 Compartir basado en el consentimiento** - No compartiremos su información personal con terceros con fines de marketing sin su consentimiento explícito. Puede retirar su consentimiento en cualquier momento a través de la Aplicación o contactándonos.
pt: Podemos partilhar as suas informações com certas partes para fornecer os nossos serviços, cumprir obrigações legais ou melhorar a App. Garantimos que qualquer partilha é realizada de forma responsável e em conformidade com as leis aplicáveis. **4.1 Partilha com outros utilizadores** - **Interações entre Cliente e Motorista**: Quando um Cliente submete um pedido de serviço, o seu nome, detalhes de contacto (por exemplo, número de telefone), locais de recolha/entrega e detalhes da encomenda são partilhados com o Motorista atribuído para facilitar a entrega. - **Visualização do desempenho do motorista**: Os Clientes podem visualizar as métricas de desempenho do Motorista, como classificações (baseadas na fiabilidade, comunicação e sucesso da entrega) e anos de experiência, antes de confirmar uma reserva. - **Coordenação B2B**: Para Parceiros de Negócio, podemos partilhar dados relacionados com a logística (por exemplo, horários de entrega, detalhes de contacto de funcionários) com Motoristas ou fornecedores de terceiros para cumprir contratos. **4.2 Partilha com fornecedores de serviços** Contratamos fornecedores de serviços de terceiros de confiança para apoiar as nossas operações. Estes fornecedores são contratualmente obrigados a proteger os seus dados e a utilizá-los apenas para os fins que especificamos: - **Mapeamento e navegação**: A Mapbox recebe dados de localização para fornecer serviços de mapeamento, roteamento e geolocalização dentro da App. - **Fornecedores de análise**: O Firebase Analytics e outras ferramentas recebem dados de utilização anónimos para gerar insights sobre o desempenho da App e o comportamento do utilizador. - **Armazenamento na nuvem**: Utilizamos fornecedores de nuvem seguros (por exemplo, AWS, Google Cloud) para armazenar os dados do utilizador de forma segura em formato encriptado, com controlos de acesso em vigor. - **Serviços de verificação**: Os serviços de terceiros verificam a identidade dos Motoristas, o histórico de condução e a conformidade dos veículos para garantir a segurança e a conformidade regulamentar. - **Ferramentas de suporte ao cliente**: Plataformas como a Zendesk gerem tickets de suporte e o histórico de comunicação para ajudar os utilizadores de forma eficaz. **4.3 Partilha legal e regulamentar** - Podemos partilhar as suas informações com autoridades governamentais, agências de aplicação da lei ou organismos reguladores quando exigido por lei, como em resposta a intimações, ordens judiciais ou auditorias fiscais. - Em casos de suspeita de fraude, abuso ou atividade ilegal, podemos partilhar dados relevantes com as autoridades para investigar ou prevenir danos. **4.4 Transferências de negócios** - Se a shnell Logistics estiver envolvida numa fusão, aquisição ou venda de ativos, as suas informações podem ser transferidas para a entidade adquirente. Ser-lhe-á notificado de tal transferência e, quando aplicável, ser-lhe-á dada a oportunidade de optar por não participar. - Garantiremos que qualquer cessionário concorde em proteger os seus dados de acordo com esta política ou um padrão comparável. **4.5 Partilha de dados anónimos** - Podemos partilhar dados agregados ou anónimos (por exemplo, tendências de entrega, dados demográficos dos utilizadores) com parceiros, investigadores ou anunciantes. Estes dados não identificam indivíduos e são utilizados para fins estatísticos ou de marketing. **4.6 Partilha baseada no consentimento** - Não partilharemos as suas informações pessoais com terceiros para fins de marketing sem o seu consentimento explícito. Pode revogar o seu consentimento a qualquer momento através da App ou contactando-nos.
zh: 我们可能会与某些方共享您的信息，以提供我们的服务、遵守法律义务或改进应用程序。我们确保任何共享都是以负责任的方式并遵守适用法律进行的。 **4.1 与其他用户的共享** - **客户与司机的互动**：当客户提交服务请求时，他们的姓名、联系方式（例如，电话号码）、取货/投递地点和包裹详细信息将与指定的司机共享，以方便投递。 - **司机表现展示**：客户在确认预订之前可以查看司机的表现指标，例如评分（基于可靠性、沟通和成功投递）和经验年限。 - **B2B 协调**：对于商业合作伙伴，我们可能会与司机或第三方提供商共享与物流相关的数据（例如，投递时间表、员工联系方式）以履行合同。 **4.2 与服务提供商的共享** 我们与值得信赖的第三方服务提供商合作以支持我们的运营。这些提供商有合同义务保护您的数据并仅将其用于我们指定的目的： - **地图和导航**：Mapbox 接收位置数据以在应用程序内提供地图、路线规划和地理位置服务。 - **分析提供商**：Firebase Analytics 和其他工具接收匿名的使用数据，以生成有关应用程序性能和用户行为的洞察。 - **云存储**：我们使用安全的云提供商（例如，AWS、Google Cloud）以加密形式存储用户数据，并实施访问控制。 - **验证服务**：第三方服务验证司机的身份、驾驶记录和车辆合规性，以确保安全和法规遵从。 - **客户支持工具**：Zendesk 等平台管理支持工单和通信历史，以有效协助用户。 **4.3 法律和法规共享** - 当法律要求时，我们可能会与政府当局、执法部门或监管机构共享您的信息，例如响应传票、法庭命令或税务审计。 - 在怀疑存在欺诈、滥用或非法活动的情况下，我们可能会与当局共享相关数据以进行调查或防止损害。 **4.4 业务转让** - 如果 shnell Logistics 参与合并、收购或资产出售，您的信息可能会被转移给收购实体。您将收到此类转让的通知，并将在适用的情况下获得选择退出的机会。 - 我们将确保任何受让人同意根据本政策或同等标准保护您的数据。 **4.5 匿名数据的共享** - 我们可能会与合作伙伴、研究人员或广告商共享聚合或匿名数据（例如，投递趋势、用户人口统计数据）。这些数据不会识别个人身份，用于统计或营销目的。 **4.6 基于同意的共享** - 未经您的明确同意，我们不会将您的个人信息共享给第三方用于营销目的。您可以随时通过应用程序或联系我们来撤回您的同意。

# dataSecurityHeading
source: 5. Data Security
ar: 5. أمن البيانات
de: 5. Datensicherheit
es: 5. Seguridad de los datos
pt: 5. Segurança dos dados
zh: 5. 数据安全
