Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# infoUsageBody
source: We use the information we collect to operate, improve, and personalize the App’s services. The primary purposes include: **3.1 Service Delivery** - **Matching Customers and Drivers**: We use Customer location and service request data to match them with suitable Drivers based on proximity, vehicle capacity, and availability. - **Order Fulfillment**: Information such as package details, pickup and delivery locations, and special instructions is used to ensure accurate and timely deliveries. - **Tracking and Updates**: Real-time location data enables shipment tracking for Customers and route optimization for Drivers. **3.2 Improving User Experience** - **Personalization**: We analyze usage data to tailor the App experience, such as suggesting preferred services or displaying relevant promotions. - **Performance Monitoring**: Device and log data help us identify and fix technical issues, ensuring a smooth user experience. - **Analytics**: Aggregated data from Firebase Analytics and similar tools informs feature enhancements and service improvements. **3.3 Communication** - **Notifications**: We send in-app, email, or SMS notifications about order statuses, account updates, promotions, or policy changes. You can manage notification preferences in the App settings. - **Customer Support**: Your contact details and communication history are used to respond to inquiries, resolve issues, and provide assistance. **3.4 Driver Management** - **Performance Display**: Before accepting a delivery request, Drivers can view Customer performance metrics, such as average rating (based on punctuality, communication, and payment history) and order frequency. This helps Drivers make informed decisions. - **Deal Acceptance**: Drivers have the autonomy to accept or reject delivery requests based on the displayed information, with no penalty for rejections unless they violate our Terms of Use. - **Account Management**: Driver information, including vehicle details and certifications, is used to verify eligibility and manage account status. - **Driver Responsibility**: Drivers are responsible for the goods from the moment they confirm pickup until delivery confirmation. **3.5 Legal and Regulatory Compliance** - **Tax Reporting**: Transaction data may be used to comply with tax obligations, such as reporting Driver earnings to relevant authorities. - **Fraud Prevention**: We analyze usage patterns and third-party data to detect and prevent fraudulent activities, such as unauthorized account access or payment fraud. - **Legal Obligations**: We may use your data to respond to legal requests, such as court orders or regulatory investigations. **3.6 Marketing and Promotions** - With your consent, we use your contact information to send promotional offers, newsletters, or updates about new services. You can opt out at any time via the App or by contacting us. - We may use aggregated, anonymized data to create marketing insights or case studies without identifying individual users. **3.7 Research and Development** - We use anonymized data to conduct research, develop new features, and improve our algorithms for matching, routing, and pricing. - Feedback provided through surveys or support interactions helps us enhance the App’s functionality and user satisfaction.
ar: نستخدم المعلومات التي نجمعها لتشغيل خدمات التطبيق وتحسينها وتخصيصها. تشمل الأغراض الأساسية ما يلي: **3.1 تقديم الخدمة** - **مطابقة العملاء والسائقين**: نستخدم بيانات موقع العميل وطلبات الخدمة لمطابقتهم بالسائقين المناسبين بناءً على القرب، وسعة السيارة، والتوافر. - **إتمام الطلب**: تُستخدم معلومات مثل تفاصيل الطرد، ومواقع الاستلام والتسليم، والتعليمات الخاصة لضمان عمليات التسليم الدقيقة وفي الوقت المناسب. - **التتبع والتحديثات**: تتيح بيانات الموقع في الوقت الفعلي تتبع الشحنات للعملاء وتحسين المسار للسائقين. **3.2 تحسين تجربة المستخدم** - **التخصيص**: نحلل بيانات الاستخدام لتخصيص تجربة التطبيق، مثل اقتراح الخدمات المفضلة أو عرض العروض الترويجية ذات الصلة. - **مراقبة الأداء**: تساعدنا بيانات الجهاز والسجل على تحديد المشكلات الفنية وإصلاحها، مما يضمن تجربة مستخدم سلسة. - **التحليلات**: توفر البيانات المجمعة من Firebase Analytics والأدوات المماثلة معلومات حول تحسينات الميزات وتحسينات الخدمة. **3.3 التواصل** - **الإشعارات**: نرسل إشعارات داخل التطبيق أو عبر البريد الإلكتروني أو الرسائل النصية القصيرة حول حالات الطلبات أو تحديثات الحساب أو العروض الترويجية أو تغييرات السياسة. يمكنك إدارة تفضيلات الإشعارات في إعدادات التطبيق. - **دعم العملاء**: تُستخدم تفاصيل الاتصال وسجل الاتصالات الخاص بك للرد على الاستفسارات وحل المشكلات وتقديم المساعدة. **3.4 إدارة السائق** - **عرض الأداء**: قبل قبول طلب التوصيل، يمكن للسائقين عرض مقاييس أداء العميل، مثل متوسط التقييم (بناءً على الالتزام بالمواعيد، والتواصل، وسجل الدفع) وتكرار الطلب. يساعد هذا السائقين على اتخاذ قرارات مستنيرة. - **قبول الصفقات**: يتمتع السائقون بالاستقلالية لقبول أو رفض طلبات التوصيل بناءً على المعلومات المعروضة، دون أي عقوبة على الرفض ما لم ينتهكوا شروط الاستخدام لدينا. - **إدارة الحساب**: تُستخدم معلومات السائق، بما في ذلك تفاصيل السيارة والشهادات، للتحقق من الأهلية وإدارة حالة الحساب. - **مسؤولية السائق**: يتحمل السائقون مسؤولية البضائع من لحظة تأكيد الاستلام حتى تأكيد التسليم. **3.5 الامتثال القانوني والتنظيمي** - **التقارير الضريبية**: يمكن استخدام بيانات المعاملات للامتثال للالتزامات الضريبية، مثل الإبلاغ عن أرباح السائقين للسلطات المختصة. - **منع الاحتيال**: نحلل أنماط الاستخدام وبيانات الطرف الثالث للكشف عن الأنشطة الاحتيالية ومنعها، مثل الوصول غير المصرح به إلى الحساب أو الاحتيال في الدفع. - **الالتزامات القانونية**: قد نستخدم بياناتك للرد على الطلبات القانونية، مثل أوامر المحكمة أو التحقيقات التنظيمية. **3.6 التسويق والعروض الترويجية** - بموافقتك، نستخدم معلومات الاتصال الخاصة بك لإرسال عروض ترويجية أو رسائل إخبارية أو تحديثات حول الخدمات الجديدة. يمكنك إلغاء الاشتراك في أي وقت عبر التطبيق أو عن طريق الاتصال بنا. - قد نستخدم بيانات مجمعة ومجهولة الهوية لإنشاء رؤى تسويقية أو دراسات حالة دون تحديد هويات المستخدمين الأفراد. **3.7 البحث والتطوير** - نستخدم بيانات مجهولة الهوية لإجراء الأبحاث وتطوير ميزات جديدة وتحسين خوارزمياتنا للمطابقة والتوجيه والتسعير. - تساعدنا الملاحظات المقدمة من خلال الاستطلاعات أو تفاعلات الدعم على تعزيز وظائف التطبيق ورضا المستخدم.
de: Wir verwenden die von uns gesammelten Informationen, um die Dienste der App zu betreiben, zu verbessern und zu personalisieren. Die Hauptzwecke sind: **3.1 Servicebereitstellung** - **Zuordnung von Kunden und Fahrern**: Wir verwenden Standort- und Dienstanfragedaten von Kunden, um sie mit geeigneten Fahrern basierend auf Nähe, Fahrzeugkapazität und Verfügbarkeit zu verknüpfen. - **Auftragserfüllung**: Informationen wie Paketdetails, Abhol- und Lieferorte sowie spezielle Anweisungen werden verwendet, um genaue und pünktliche Lieferungen sicherzustellen. - **Verfolgung und Aktualisierungen**: Echtzeit-Standortdaten ermöglichen die Sendungsverfolgung für Kunden und die Routenoptimierung für Fahrer. **3.2 Verbesserung der Benutzererfahrung** - **Personalisierung**: Wir analysieren Nutzungsdaten, um das App-Erlebnis anzupassen, z. B. durch Vorschlagen bevorzugter Dienste oder Anzeigen relevanter Werbeaktionen. - **Leistungsüberwachung**: Geräte- und Protokolldaten helfen uns, technische Probleme zu identifizieren und zu beheben, um eine reibungslose Benutzererfahrung zu gewährleisten. - **Analyse**: Aggregierte Daten von Firebase Analytics und ähnlichen Tools dienen der Verbesserung von Funktionen und Diensten. **3.3 Kommunikation** - **Benachrichtigungen**: Wir senden In-App-, E-Mail- oder SMS-Benachrichtigungen über den Status von Bestellungen, Kontoaktualisierungen, Werbeaktionen oder Richtlinienänderungen. Sie können die Benachrichtigungseinstellungen in den App-Einstellungen verwalten. - **Kundensupport**: Ihre Kontaktdaten und Ihr Kommunikationsverlauf werden verwendet, um auf Anfragen zu antworten, Probleme zu lösen und Unterstützung zu leisten. **3.4 Fahrermanagement** - **Leistungsanzeige**: Bevor Fahrer eine Lieferanfrage annehmen, können sie Leistungskennzahlen des Kunden einsehen, wie z. B. die durchschnittliche Bewertung (basierend auf Pünktlichkeit, Kommunikation und Zahlungsverlauf) und die Häufigkeit der Bestellungen. Dies hilft Fahrern, fundierte Entscheidungen zu treffen. - **Angebotsannahme**: Fahrer haben die Autonomie, Lieferanfragen basierend auf den angezeigten Informationen anzunehmen oder abzulehnen, ohne dass bei Ablehnungen eine Strafe verhängt wird, es sei denn, sie verstoßen gegen unsere Nutzungsbedingungen. - **Kontoverwaltung**: Fahrerinformationen, einschließlich Fahrzeugdetails und Zertifizierungen, werden zur Überprüfung der Berechtigung und zur Verwaltung des Kontostatus verwendet. - **Fahrerhaftung**: Fahrer sind für die Ware vom Moment der Abholbestätigung bis zur Lieferbestätigung verantwortlich. **3.5 Einhaltung von Gesetzen und Vorschriften** - **Steuerberichterstattung**: Transaktionsdaten können zur Erfüllung von Steuerpflichten verwendet werden, z. B. zur Meldung der Fahrereinnahmen an die zuständigen Behörden. - **Betrugsprävention**: Wir analysieren Nutzungsmuster und Daten von Dritten, um betrügerische Aktivitäten zu erkennen und zu verhindern, wie z. B. unbefugten Kontozugriff oder Zahlungsbetrug. - **Rechtliche Verpflichtungen**: Wir können Ihre Daten verwenden, um auf rechtliche Anfragen zu reagieren, wie z. B. Gerichtsbeschlüsse oder behördliche Ermittlungen. **3.6 Marketing und Werbeaktionen** - Mit Ihrer Zustimmung verwenden wir Ihre Kontaktinformationen, um Werbeangebote, Newsletter oder Updates zu neuen Diensten zu senden. Sie können sich jederzeit über die App oder durch Kontaktaufnahme mit uns abmelden. - Wir können aggregierte, anonymisierte Daten verwenden, um Marketingerkenntnisse oder Fallstudien zu erstellen, ohne einzelne Nutzer zu identifizieren. **3.7 Forschung und Entwicklung** - Wir verwenden anonymisierte Daten, um Forschung zu betreiben, neue Funktionen zu entwickeln und unsere Algorithmen für die Zuordnung, das Routing und die Preisgestaltung zu verbessern. - Rückmeldungen, die über Umfragen oder Support-Interaktionen bereitgestellt werden, helfen uns, die Funktionalität der App und die Benutzerzufriedenheit zu verbessern.
es: Utilizamos la información que recopilamos para operar, mejorar y personalizar los servicios de la Aplicación. Los fines principales incluyen: **3.1 Prestación de servicios** - **Asignación de clientes y conductores**: Utilizamos los datos de ubicación y solicitud de servicio del Cliente para asignarlos a Conductores adecuados en función de la proximidad, la capacidad del vehículo y la disponibilidad. - **Cumplimiento de pedidos**: La información como los detalles del paquete, las ubicaciones de recogida y entrega y las instrucciones especiales se utiliza para garantizar entregas precisas y puntuales. - **Seguimiento y actualizaciones**: Los datos de ubicación en tiempo real permiten el seguimiento de los envíos para los Clientes y la optimización de las rutas para los Conductores. **3.2 Mejora de la experiencia del usuario** - **Personalización**: Analizamos los datos de uso para adaptar la experiencia de la Aplicación, como sugerir servicios preferidos o mostrar promociones relevantes. - **Supervisión del rendimiento**: Los datos del dispositivo y de los registros nos ayudan a identificar y solucionar problemas técnicos, lo que garantiza una experiencia de usuario fluida. - **Análisis**: Los datos agregados de Firebase Analytics y herramientas similares informan las mejoras de las funciones y los servicios. **3.3 Comunicación** - **Notificaciones**: Enviamos notificaciones en la aplicación, por correo electrónico o por SMS sobre el estado de los pedidos, las actualizaciones de la cuenta, las promociones o los cambios de política. Puede gestionar las preferencias de notificación en la configuración de la Aplicación. - **Atención al cliente**: Sus datos de contacto e historial de comunicación se utilizan para responder a consultas, resolver problemas y proporcionar asistencia. **3.4 Gestión de conductores** - **Visualización de rendimiento**: Antes de aceptar una solicitud de entrega, los conductores pueden ver métricas de rendimiento del cliente, como la calificación promedio (basada en la puntualidad, la comunicación y el historial de pagos) y la frecuencia de los pedidos. Esto ayuda a los conductores a tomar decisiones informadas. - **Aceptación de ofertas**: Los conductores tienen la autonomía de aceptar o rechazar las solicitudes de entrega en función de la información mostrada, sin penalización por rechazos a menos que violen nuestros Términos de uso. - **Gestión de cuentas**: La información del conductor, incluidos los detalles del vehículo y las certificaciones, se utiliza para verificar la elegibilidad y gestionar el estado de la cuenta. - **Responsabilidad del conductor**: Los conductores son responsables de la mercancía desde el momento en que confirman la recogida hasta la confirmación de la entrega. **3.5 Cumplimiento legal y normativo** - **Informes fiscales**: Los datos de las transacciones pueden utilizarse para cumplir con las obligaciones fiscales, como informar las ganancias de los conductores a las autoridades pertinentes. - **Prevención del fraude**: Analizamos los patrones de uso y los datos de terceros para detectar y prevenir actividades fraudulentas, como el acceso no autorizado a la cuenta o el fraude de pagos. - **Obligaciones legales**: Podemos usar sus datos para responder a solicitudes legales, como órdenes judiciales o investigaciones regulatorias. **3.6 Marketing y promociones** - Con su consentimiento, utilizamos su información de contacto para enviar ofertas promocionales, boletines o actualizaciones sobre nuevos servicios. Puede optar por no participar en cualquier momento a través de la Aplicación o contactándonos. - Podemos utilizar datos agregados y anonimizados para crear información de marketing o estudios de casos sin identificar a los usuarios individuales. **3.7 Investigación y desarrollo** - Utilizamos datos anonimizados para realizar investigaciones, desarrollar nuevas funciones y mejorar nuestros algoritmos de asignación, enrutamiento y precios. - Los comentarios proporcionados a través de encuestas o interacciones de soporte nos ayudan a mejorar la funcionalidad de la Aplicación y la satisfacción del usuario.
pt: Utilizamos as informações que recolhemos para operar, melhorar e personalizar os serviços da App. Os principais propósitos incluem: **3.1 Fornecimento de serviços** - **Correspondência de Clientes e Motoristas**: Utilizamos a localização do cliente e os dados do pedido de serviço para corresponder Motoristas adequados com os Clientes com base na proximidade, capacidade do veículo e disponibilidade. - **Execução de pedidos**: Informações como detalhes do pacote, locais de recolha e entrega, e instruções especiais são utilizadas para garantir entregas precisas e atempadas. - **Rastreamento e atualizações**: Os dados de localização em tempo real permitem o rastreamento de encomendas para os Clientes e a otimização da rota para os Motoristas. **3.2 Melhorar a experiência do utilizador** - **Personalização**: Analisamos os dados de utilização para personalizar a experiência da App, por exemplo, sugerindo serviços preferidos ou mostrando promoções relevantes. - **Monitorização do desempenho**: Os dados do dispositivo e de registo ajudam-nos a identificar e corrigir problemas técnicos, garantindo uma experiência de utilizador fluida. - **Análise**: Os dados agregados do Firebase Analytics e de ferramentas semelhantes informam os melhoramentos de funcionalidades e serviços. **3.3 Comunicação** - **Notificações**: Enviamos notificações na aplicação, e-mails ou SMS sobre o estado do pedido, atualizações da conta, promoções ou alterações de políticas. Pode gerir as suas preferências de notificação nas definições da App. - **Suporte ao cliente**: As suas informações de contacto e o histórico de comunicação são utilizados para responder a perguntas, resolver problemas e fornecer assistência. **3.4 Gestão de motoristas** - **Visualização do desempenho do motorista**: Antes de aceitar um pedido de entrega, os Motoristas podem visualizar as métricas de desempenho do Cliente, como a classificação média (baseada em pontualidade, comunicação e histórico de pagamento) e a frequência de pedidos. Isso ajuda os Motoristas a tomar decisões informadas. - **Aceitação da oferta**: Os Motoristas têm a autonomia de aceitar ou rejeitar pedidos de entrega com base nas informações exibidas, sem penalidades por recusa, a menos que viole os nossos Termos de Utilização. - **Gestão de conta**: As informações do Motorista, incluindo os detalhes do veículo e as qualificações, são utilizadas para verificar a elegibilidade e gerir o estado da conta. - **Responsabilidade do motorista**: Os Motoristas são responsáveis pela mercadoria desde o momento em que confirmam a recolha até à confirmação da entrega. **3.5 Conformidade legal e regulamentar** - **Relatórios fiscais**: Os dados de transações podem ser utilizados para cumprir as obrigações fiscais, como a declaração dos rendimentos dos Motoristas às autoridades relevantes. - **Prevenção de fraude**: Analisamos padrões de utilização e dados de terceiros para detetar e prevenir atividades fraudulentas, como acesso não autorizado à conta ou fraude de pagamento. - **Obrigações legais**: Os seus dados podem ser utilizados para responder a pedidos legais, como ordens judiciais ou investigações regulamentares. **3.6 Marketing e promoções** - Com o seu consentimento, utilizamos as suas informações de contacto para enviar ofertas promocionais, newsletters ou atualizações sobre novos serviços. Pode optar por não participar a qualquer momento através da App ou contactando-nos. - Podemos utilizar dados agregados e anónimos para criar insights de marketing ou estudos de caso sem identificar indivíduos. **3.7 Pesquisa e desenvolvimento** - Utilizamos dados anónimos para conduzir pesquisas, desenvolver novas funcionalidades e melhorar os nossos algoritmos de correspondência, roteamento e preços. - O feedback fornecido através de inquéritos e interações de suporte ajuda-nos a melhorar a funcionalidade da App e a satisfação do utilizador.
zh: 我们使用收集到的信息来运营、改进和个性化应用程序的服务。主要目的包括： **3.1 服务提供** - **匹配客户和司机**：我们使用客户位置和请求服务数据，根据距离、车辆容量和可用性将合适的司机与客户匹配。 - **订单履行**：包裹详细信息、取货和投递地点以及特殊说明等信息用于确保准确及时的投递。 - **追踪和更新**：实时位置数据可为客户提供包裹追踪，并为司机提供路线优化。 **3.2 增强用户体验** - **个性化**：我们分析使用数据以定制应用程序体验，例如建议首选服务或显示相关促销活动。 - **性能监控**：设备和日志数据有助于识别和修复技术问题，确保流畅的用户体验。 - **分析**：来自 Firebase Analytics 和类似工具的汇总数据有助于改进功能和服务。 **3.3 通信** - **通知**：我们发送应用内、电子邮件或短信通知，告知您订单状态、账户更新、促销活动或政策变更。您可以在应用程序设置中管理您的通知偏好。 - **客户支持**：您的联系方式和通信历史记录用于回复查询、解决问题和提供帮助。 **3.4 司机管理** - **司机表现展示**：在接受投递请求之前，司机可以查看客户的表现指标，例如平均评分（基于准时性、沟通和付款历史）和订单频率。这有助于司机做出明智的决定。 - **接受报价**：司机可以根据显示的信息自主决定接受或拒绝投递请求，除非拒绝违反我们的使用条款，否则不会受到处罚。 - **账户管理**：司机的车辆详细信息和资格信息用于验证资格和管理账户状态。 - **司机责任**：司机从确认取货的那一刻起，到确认投递为止，对货物负有责任。 **3.5 法律和法规合规** - **税务报告**：交易数据可能用于遵守税务义务，例如向相关当局报告司机的收入。 - **欺诈预防**：我们分析使用模式和第三方数据，以检测和预防欺诈活动，例如未经授权的账户访问或支付欺诈。 - **法律义务**：您的数据可能用于回应法律要求，例如法庭命令或监管调查。 **3.6 营销和促销** - 在您同意的情况下，我们使用您的联系方式发送有关新服务的促销优惠、时事通讯或更新。您可以随时通过应用程序或联系我们来选择退出。 - 我们可能会使用聚合的、匿名的数据来创建营销洞察或案例研究，而无需识别个人身份。 **3.7 研究与开发** - 我们使用匿名数据进行研究、开发新功能并改进我们的匹配、路线规划和定价算法。 - 通过调查和支持互动提供的反馈有助于提高应用程序的功能和用户满意度。

# infoSharingHeading
source: 4. How We Share Your Information
ar: 4. كيف نشارك معلوماتك
de: 4. Wie wir Ihre Informationen weitergeben
es: 4. Cómo compartimos su información
pt: 4. Como partilhamos as suas informações
zh: 4. 我们如何共享您的信息
