Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# commissionBody
source: Schnell Logistics operates on a transparent commission-based model to ensure fair compensation for Drivers and sustainable operations for the platform. **10.1 Commission Rate** - **Standard Commission**: Schnell deducts a **7% commission** from the total fare of each completed delivery or service. This commission covers platform maintenance, customer support, and operational costs. - **Example**: If a delivery fare is 100 TND (Tunisian Dinar), Schnell deducts 7 TND as commission, and the Driver receives 93 TND. - **Transparency**: The commission is clearly displayed to Drivers before accepting a delivery request and in the transaction history within the App. **10.2 Additional Fees** - **Service Fees**: Customers may incur additional fees for premium services, such as express delivery or secure transport. These fees are disclosed during the booking process and do not affect the Driver’s commission. - **Taxes**: Applicable taxes (e.g., VAT, sales tax) are calculated and added to the fare based on local regulations. Taxes are separate from the commission and are clearly itemized in receipts. - **Surge Pricing**: During high-demand periods, fares may increase due to surge pricing. The 7% commission applies to the surged fare, increasing Driver earnings proportionally. **10.3 Payment Processing** - Customer payments are processed via in-office cash payments or mandat payments for account recharges, as online payments are not currently supported. - Driver payouts are processed weekly (every Monday) to the Driver’s registered bank account or digital wallet, after deducting the 7% commission and any applicable taxes. - Drivers can view their earnings, commission deductions, and payout schedules in the App’s “Earnings” section. **10.4 Disputes** - If a Customer disputes a charge, Schnell will investigate and may temporarily hold the Driver’s payout until the dispute is resolved. - Drivers will be notified of any disputes via email or in-app notifications and can provide evidence (e.g., delivery confirmation, photos) to support their case. - Resolved disputes in favor of the Driver will result in immediate payout, minus the standard 7% commission.
ar: تعمل شركة شنيل اللوجستية على نموذج قائم على العمولة لضمان تعويض عادل للسائقين وعمليات مستدامة للمنصة. **10.1 معدل العمولة** - **العمولة القياسية**: تقتطع شركة شنيل **عمولة بنسبة 9%** من إجمالي أجرة كل عملية تسليم أو خدمة مكتملة. تغطي هذه العمولة صيانة المنصة، ودعم العملاء، والتكاليف التشغيلية. - **مثال**: إذا كانت أجرة التوصيل 100 دينار تونسي، فإن شركة شنيل تقتطع 9 دنانير كعمولة، ويتلقى السائق 91 دينارًا. - **الشفافية**: يتم عرض العمولة بوضوح للسائقين قبل قبول طلب التوصيل وفي سجل المعاملات داخل التطبيق. **10.2 الرسوم الإضافية** - **رسوم الخدمة**: قد يتحمل العملاء رسومًا إضافية مقابل الخدمات المتميزة، مثل التوصيل السريع أو النقل الآمن. يتم الكشف عن هذه الرسوم أثناء عملية الحجز ولا تؤثر على عمولة السائق. - **الضرائب**: يتم حساب الضرائب المطبقة (مثل ضريبة القيمة المضافة، وضريبة المبيعات) وإضافتها إلى الأجرة بناءً على اللوائح المحلية. الضرائب منفصلة عن العمولة ويتم تحديدها بوضوح في الإيصالات. - **التسعير المتزايد**: خلال فترات الذروة، قد تزيد الأجرة بسبب التسعير المتزايد. تنطبق عمولة 9% على الأجرة المتزايدة، مما يزيد أرباح السائق بشكل متناسب. **10.3 معالجة الدفع** - تتم معالجة مدفوعات العملاء عبر المدفوعات النقدية في المكتب أو المدفوعات عن طريق أمر دفع لإعادة شحن الحساب، حيث لا يتم دعم المدفوعات عبر الإنترنت حاليًا. - تتم معالجة مدفوعات السائقين أسبوعيًا (كل يوم اثنين) إلى الحساب المصرفي المسجل للسائق أو المحفظة الرقمية، بعد خصم عمولة 9% وأي ضرائب مطبقة. - يمكن للسائقين عرض أرباحهم، وخصومات العمولة، وجداول الدفع في قسم "الأرباح" في التطبيق. **10.4 النزاعات** - إذا اعترض العميل على رسوم، فستقوم شركة شنيل بالتحقيق وقد تحتفظ مؤقتًا بمدفوعات السائق حتى يتم حل النزاع. - سيتم إخطار السائقين بأي نزاعات عبر البريد الإلكتروني أو الإشعارات داخل التطبيق ويمكنهم تقديم دليل (مثل تأكيد التسليم، والصور) لدعم قضيتهم. - ستؤدي النزاعات التي يتم حلها لصالح السائق إلى دفع فوري، بعد خصم العمولة القياسية البالغة 9%.
de: Schnell Logistics arbeitet mit einem transparenten, provisionsbasierten Modell, um eine faire Vergütung für Fahrer und nachhaltige Abläufe für die Plattform zu gewährleisten. **10.1 Provisionssatz** - **Standardprovision**: Schnell zieht eine **7%ige Provision** vom Gesamtpreis jeder abgeschlossenen Lieferung oder Dienstleistung ab. Diese Provision deckt die Wartung der Plattform, den Kundensupport und die Betriebskosten. - **Beispiel**: Wenn der Preis einer Lieferung 100 TND (tunesischer Dinar) beträgt, zieht Schnell 7 TND als Provision ab und der Fahrer erhält 93 TND. - **Transparenz**: Die Provision wird den Fahrern klar angezeigt, bevor sie eine Lieferanfrage annehmen, und im Transaktionsverlauf in der App. **10.2 Zusätzliche Gebühren** - **Servicegebühren**: Kunden können zusätzliche Gebühren für Premium-Dienste wie Expresslieferungen oder sichere Transporte erheben. Diese Gebühren werden während des Buchungsvorgangs offengelegt und beeinflussen nicht die Provision des Fahrers. - **Steuern**: Anfallende Steuern (z. B. Mehrwertsteuer, Umsatzsteuer) werden gemäß den örtlichen Vorschriften berechnet und zum Preis hinzugefügt. Steuern sind von der Provision getrennt und werden in den Belegen klar aufgeführt. - **Dynamische Preise**: In Zeiten hoher Nachfrage können die Preise aufgrund dynamischer Preise steigen. Die 7%ige Provision gilt für den erhöhten Preis, was die Einnahmen des Fahrers proportional erhöht. **10.3 Zahlungsabwicklung** - Kundenzahlungen werden über Bareinzahlungen im Büro oder Mandatszahlungen für Kontoguthaben abgewickelt, da Online-Zahlungen derzeit nicht unterstützt werden. - Fahrerauszahlungen werden wöchentlich (jeden Montag) auf das registrierte Bankkonto oder die digitale Geldbörse des Fahrers überwiesen, nach Abzug der 7%igen Provision und aller anfallenden Steuern. - Fahrer können ihre Einnahmen, Provisionsabzüge und Auszahlungspläne im Abschnitt „Einnahmen“ der App einsehen. **10.4 Streitigkeiten** - Wenn ein Kunde eine Gebühr anficht, wird Schnell dies untersuchen und die Auszahlung des Fahrers vorübergehend einbehalten, bis der Streit beigelegt ist. - Fahrer werden über Streitigkeiten per E-Mail oder In-App-Benachrichtigungen informiert und können Beweise (z. B. Lieferbestätigung, Fotos) zur Unterstützung ihres Falles vorlegen. - Gelöste Streitigkeiten zugunsten des Fahrers führen zu einer sofortigen Auszahlung, abzüglich der standardmäßigen 7%igen Provision.
es: shnell Logistics opera con un modelo transparente basado en comisiones para garantizar una compensación justa para los Conductores y operaciones sostenibles para la plataforma. **10.1 Tasa de comisión** - **Comisión estándar**: shnell deduce una **comisión del 7 %** de la tarifa total de cada entrega o servicio completado. Esta comisión cubre el mantenimiento de la plataforma, el soporte al cliente y los costos operativos. - **Ejemplo**: Si la tarifa de una entrega es de 100 TND (dinar tunecino), shnell deduce 9 TND como comisión y el Conductor recibe 91 TND. - **Transparencia**: La comisión se muestra claramente a los Conductores antes de aceptar una solicitud de entrega y en el historial de transacciones dentro de la Aplicación. **10.2 Tarifas adicionales** - **Tarifas de servicio**: Los Clientes pueden incurrir en tarifas adicionales por servicios premium, como la entrega exprés o el transporte seguro. Estas tarifas se divulgan durante el proceso de reserva y no afectan la comisión del Conductor. - **Impuestos**: Los impuestos aplicables (por ejemplo, IVA, impuesto sobre las ventas) se calculan y se agregan a la tarifa según las regulaciones locales. Los impuestos son independientes de la comisión y se detallan claramente en los recibos. - **Precios dinámicos**: Durante los períodos de alta demanda, las tarifas pueden aumentar debido a los precios dinámicos. La comisión del 9% se aplica a la tarifa aumentada, lo que aumenta las ganancias del Conductor proporcionalmente. **10.3 Procesamiento de pagos** - Los pagos de los Clientes se procesan a través de pagos en efectivo en la oficina o pagos por mandato para las recargas de la cuenta, ya que los pagos en línea no son compatibles actualmente. - Los pagos a los Conductores se procesan semanalmente (todos los lunes) a la cuenta bancaria o a la billetera digital registrada del Conductor, después de deducir la comisión del 9% y los impuestos aplicables. - Los Conductores pueden ver sus ganancias, las deducciones de comisiones y los cronogramas de pago en la sección "Ganancias" de la Aplicación. **10.4 Disputas** - Si un Cliente disputa un cargo, shnell investigará y podrá retener temporalmente el pago del Conductor hasta que se resuelva la disputa. - Los Conductores serán notificados de cualquier disputa por correo electrónico o notificaciones en la aplicación y pueden proporcionar evidencia (por ejemplo, confirmación de entrega, fotos) para respaldar su caso. - Las disputas resueltas a favor del Conductor darán como resultado un pago inmediato, menos la comisión estándar del 9%.
pt: A shnell Logistics opera com um modelo transparente baseado em comissões para garantir uma remuneração justa para os Motoristas e operações sustentáveis para a plataforma. **10.1 Taxa de comissão** - **Comissão padrão**: A shnell retém uma **comissão de 9%** da tarifa total de cada entrega ou serviço concluído. Esta comissão cobre a manutenção da plataforma, o suporte ao cliente e os custos operacionais. - **Exemplo**: Se a tarifa de uma entrega for de 100 TND (dinar tunisino), a shnell retém 9 TND como comissão e o Motorista recebe 91 TND. - **Transparência**: A comissão é claramente exibida aos Motoristas antes de aceitar um pedido de entrega e no histórico de transações dentro da App. **10.2 Taxas adicionais** - **Taxas de serviço**: Os Clientes podem incorrer em taxas adicionais por serviços premium, como entrega expresso ou transporte seguro. Estas taxas são divulgadas durante o processo de reserva e não afetam a comissão do Motorista. - **Impostos**: Os impostos aplicáveis (por exemplo, IVA, imposto sobre vendas) são calculados e adicionados à tarifa com base nos regulamentos locais. Os impostos são separados da comissão e são claramente detalhados nos recibos. - **Preços dinâmicos**: Durante os períodos de alta procura, as tarifas podem aumentar devido aos preços dinâmicos. A comissão de 9% aplicar-se-á à tarifa aumentada, aumentando proporcionalmente os ganhos do Motorista. **10.3 Processamento de pagamentos** - Os pagamentos dos Clientes são processados por pagamentos em dinheiro no escritório ou pagamentos por cheque para recargas de conta, uma vez que os pagamentos online não são atualmente suportados. - Os pagamentos aos Motoristas são processados semanalmente (todas as segundas-feiras) para a conta bancária registada ou carteira digital do Motorista, após a dedução da comissão de 9% e dos impostos aplicáveis. - Os Motoristas podem ver os seus ganhos, deduções de comissão e horários de pagamento na secção "Ganhos" da App. **10.4 Disputas** - Se um Cliente contestar uma cobrança, a shnell irá investigar e pode reter temporariamente o pagamento do Motorista até que a disputa seja resolvida. - Os Motoristas serão notificados sobre disputas por e-mail ou notificações na aplicação e podem fornecer provas (por exemplo, confirmação de entrega, fotos) para apoiar o seu caso. - As disputas resolvidas a favor do Motorista resultarão num pagamento imediato, menos a comissão padrão de 9%.
zh: shnell Logistics 采用透明的佣金模式运营，以确保司机获得公平的报酬并确保平台的可持续运营。 **10.1 佣金率** - **标准佣金**：shnell 从每次已完成的投递或服务总运费中扣除 **9% 的佣金**。此佣金用于支付平台维护、客户支持和运营成本。 - **示例**：如果投递运费为 100 突尼斯第纳尔 (TND)，shnell 将扣除 9 TND 作为佣金，司机将收到 91 TND。 - **透明度**：在接受投递请求之前以及在应用程序的交易历史中，佣金会清楚地显示给司机。 **10.2 附加费** - **服务费**：客户可能需要为高级服务支付额外费用，例如快速投递或安全运输。这些费用在预订过程中会披露，并且不会影响司机的佣金。 - **税费**：根据当地法规计算并添加到运费中的适用税费（例如，增值税、销售税）。税费与佣金是分开的，并在收据中明确列出。 - **高峰期定价**：在需求旺盛期间，高峰期定价可能会增加运费。9% 的佣金将适用于高峰期价格，从而按比例增加司机的收入。 **10.3 支付处理** - 客户付款通过办公室现金支付或用于账户充值的支票支付进行处理，因为目前不支持在线支付。 - 司机的付款将每周（每周一）处理到司机注册的银行账户或数字钱包中，并扣除 9% 的佣金和适用的税费。 - 司机可以在应用程序的“收入”部分查看他们的收入、佣金扣除和支付时间表。 **10.4 纠纷** - 如果客户对收费提出异议，shnell 将进行调查，并可能暂时保留司机的付款，直到纠纷解决。 - 司机将通过电子邮件或应用内通知收到有关纠纷的通知，并可以提供证据（例如，投递确认、照片）来支持他们的案子。 - 解决后对司机有利的纠纷将立即支付，并扣除标准的 9% 佣金。

# cancellationHeading
source: 11. Cancellation Policy
ar: 11. سياسة الإلغاء
de: 11. Stornierungsrichtlinie
es: 11. Política de cancelación
pt: 11. Política de cancelamento
zh: 11. 取消政策

# cancellationBody
source: Schnell Logistics has a clear cancellation policy to ensure fairness for Customers, Drivers, and the platform. Cancellations are handled differently based on the party initiating the cancellation and the timing. **11.1 Customer Cancellations** - **Before Driver Acceptance**: Customers may cancel a service request at any time before a Driver accepts it, with no penalty or fee. - **After Driver Acceptance**: If a Customer cancels after a Driver has accepted the request but before pickup, a cancellation fee of 20% of the estimated fare (minimum 5 TND) may apply to compensate the Driver for time and fuel. - **After Pickup**: Cancellations after the Driver has picked up the package are not permitted unless the Driver agrees or there is a valid reason (e.g., unsafe conditions). A full fare may be charged. - **Process**: Customers can cancel via the App’s “Cancel Order” button or by contacting support@schnell.com. Refunds for cancellation fees are processed within 7 business days. - **Frequent Cancellations**: Customers who frequently cancel their shipments risk temporary restrictions or account suspension. **11.2 Driver Cancellations** - **Before Pickup**: Drivers may not cancel a request after acceptance unless they arrive at the pickup location and wait 12 minutes without the Customer appearing. In such cases, Drivers are free to cancel without penalty. - **After Pickup**: Drivers must complete the delivery unless there is a valid reason (e.g., safety concerns, Customer misconduct). Unauthorized cancellations after pickup may result in a penalty (e.g., 10 TND deduction from credits) and a lower performance rating. - **Process**: Drivers cancel via the App’s “Cancel Delivery” feature, and Customers are notified immediately with an option to rebook with another Driver. **11.3 Schnell-Initiated Cancellations** - **System Errors**: If a technical issue (e.g., server downtime, mapping errors) prevents service fulfillment, Schnell may cancel the request. Customers receive a full refund, and Drivers are not penalized. - **Policy Violations**: Schnell may cancel requests involving fraudulent activity, prohibited items (e.g., hazardous materials), or violations of our Terms of Use. Affected parties will be notified with details. - **Manual Cancellations**: Shipments accepted but not completed within 24 hours may be manually canceled by the admin, with penalties applied to both the Driver and Customer. - **Force Majeure**: Cancellations due to unforeseen events (e.g., natural disasters, government restrictions) are exempt from fees, and both parties are notified promptly. **11.4 Refunds** - Refunds for Customer cancellations are processed to the original payment method within 7 business days. - Drivers are not charged commissions for cancelled deliveries unless they are at fault (e.g., unauthorized cancellation after pickup). - Refund disputes can be escalated to support@schnell.com for review. **11.5 Notifications** - All cancellations trigger automatic notifications to affected parties via email, SMS, or in-app alerts. - Customers and Drivers can track cancellation history in the App’s “Order History” or “Earnings” sections.
ar: لدى شركة شنيل اللوجستية سياسة إلغاء واضحة لضمان العدالة للعملاء، والسائقين، والمنصة. يتم التعامل مع عمليات الإلغاء بشكل مختلف بناءً على الطرف الذي يبدأ الإلغاء والتوقيت. **11.1 إلغاءات العميل** - **قبل قبول السائق**: يمكن للعملاء إلغاء طلب الخدمة في أي وقت قبل أن يقبله السائق، دون أي عقوبة أو رسوم. - **بعد قبول السائق**: إذا ألغى العميل بعد أن قبل السائق الطلب ولكن قبل الاستلام، فقد يتم تطبيق رسوم إلغاء بنسبة 20% من الأجرة المقدرة (بحد أدنى 5 دنانير) لتعويض السائق عن الوقت والوقود. - **بعد الاستلام**: لا يُسمح بالإلغاء بعد أن يستلم السائق الطرد ما لم يوافق السائق أو يكون هناك سبب وجيه (مثل ظروف غير آمنة). قد يتم فرض أجرة كاملة. - **العملية**: يمكن للعملاء الإلغاء عبر زر "إلغاء الطلب" في التطبيق أو عن طريق الاتصال بـ support@shnell.com. تتم معالجة المبالغ المستردة لرسوم الإلغاء في غضون 7 أيام عمل. - **الإلغاءات المتكررة**: العملاء الذين يلغون شحناتهم بشكل متكرر قد يتعرضون لقيود مؤقتة أو تعليق للحساب. **11.2 إلغاءات السائق** - **قبل الاستلام**: لا يجوز للسائقين إلغاء الطلب بعد القبول ما لم يصلوا إلى موقع الاستلام وينتظروا 12 دقيقة دون ظهور العميل. في هذه الحالات، يكون السائقون أحرارًا في الإلغاء دون عقوبة. - **بعد الاستلام**: يجب على السائقين إتمام عملية التسليم ما لم يكن هناك سبب وجيه (مثل مخاوف تتعلق بالسلامة، سوء سلوك العميل). قد يؤدي الإلغاء غير المصرح به بعد الاستلام إلى عقوبة (مثل خصم 10 دنانير من الأرصدة) وتقييم أداء أقل. - **العملية**: يقوم السائقون بالإلغاء عبر ميزة "إلغاء التوصيل" في التطبيق، ويتم إخطار العملاء على الفور مع خيار إعادة الحجز مع سائق آخر. **11.3 الإلغاءات التي تبدأها شركة شنيل** - **أخطاء النظام**: إذا كانت هناك مشكلة فنية (مثل تعطل الخادم، وأخطاء في الخرائط) تمنع إتمام الخدمة، فقد تقوم شركة شنيل بإلغاء الطلب. يتلقى العملاء استردادًا كاملاً، ولا يتم معاقبة السائقين. - **انتهاكات السياسة**: قد تقوم شركة شنيل بإلغاء الطلبات التي تنطوي على نشاط احتيالي، أو أشياء محظورة (مثل المواد الخطرة)، أو انتهاكات لشروط الاستخدام لدينا. سيتم إخطار الأطراف المتأثرة بالتفاصيل. - **الإلغاءات اليدوية**: قد يتم إلغاء الشحنات التي تم قبولها ولكن لم يتم إكمالها في غضون 24 ساعة يدويًا من قبل المسؤول، مع تطبيق عقوبات على كل من السائق والعميل. - **القوة القاهرة**: الإلغاءات بسبب أحداث غير متوقعة (مثل الكوارث الطبيعية، والقيود الحكومية) معفاة من الرسوم، ويتم إخطار كلا الطرفين على الفور. **11.4 المبالغ المستردة** - تتم معالجة المبالغ المستردة لإلغاءات العميل إلى طريقة الدفع الأصلية في غضون 7 أيام عمل. - لا يتم فرض عمولات على السائقين مقابل عمليات التسليم الملغاة ما لم يكونوا هم المخطئون (مثل الإلغاء غير المصرح به بعد الاستلام). - يمكن تصعيد نزاعات استرداد الأموال إلى support@shnell.com للمراجعة.
de: Schnell Logistics hat eine klare Stornierungsrichtlinie, um Fairness für Kunden, Fahrer und die Plattform zu gewährleisten. Stornierungen werden je nach der Partei, die die Stornierung initiiert, und dem Zeitpunkt unterschiedlich behandelt. **11.1 Stornierungen durch den Kunden** - **Vor der Annahme durch den Fahrer**: Kunden können eine Dienstanfrage jederzeit stornieren, bevor ein Fahrer sie annimmt, ohne Strafe oder Gebühr. - **Nach der Annahme durch den Fahrer**: Wenn ein Kunde nach der Annahme der Anfrage durch einen Fahrer, aber vor der Abholung storniert, kann eine Stornogebühr von 20 % des geschätzten Preises (mindestens 5 TND) anfallen, um den Fahrer für Zeit und Kraftstoff zu entschädigen. - **Nach der Abholung**: Stornierungen nach der Abholung des Pakets durch den Fahrer sind nicht gestattet, es sei denn, der Fahrer stimmt zu oder es gibt einen triftigen Grund (z. B. unsichere Bedingungen). Der volle Preis kann in Rechnung gestellt werden. - **Prozess**: Kunden können über die Schaltfläche „Bestellung stornieren“ in der App oder durch Kontaktaufnahme mit support@schnell.com stornieren. Rückerstattungen für Stornogebühren werden innerhalb von 7 Werktagen bearbeitet. - **Häufige Stornierungen**: Kunden, die ihre Sendungen häufig stornieren, riskieren vorübergehende Einschränkungen oder eine Kontosperrung.
es: shnell Logistics tiene una política de cancelación clara para garantizar la equidad para los Clientes, los Conductores y la plataforma. Las cancelaciones se manejan de manera diferente según la parte que las inicie y el momento. **11.1 Cancelaciones del cliente** - **Antes de la aceptación del conductor**: Los Clientes pueden cancelar una solicitud de servicio en cualquier momento antes de que un Conductor la acepte, sin penalización ni tarifa. - **Después de la aceptación del conductor**: Si un Cliente cancela después de que un Conductor ha aceptado la solicitud pero antes de la recogida, se puede aplicar una tarifa de cancelación del 20% de la tarifa estimada (mínimo 5 TND) para compensar al Conductor por el tiempo y el combustible. - **Después de la recogida**: Las cancelaciones después de que el Conductor ha recogido el paquete no están permitidas a menos que el Conductor esté de acuerdo o haya una razón válida (por ejemplo, condiciones inseguras). Se puede cobrar una tarifa completa. - **Proceso**: Los Clientes pueden cancelar a través del botón "Cancelar pedido" de la Aplicación o contactando a support@shnell.com. Los reembolsos de las tarifas de cancelación se procesan en un plazo de 7 días hábiles. - **Cancelaciones frecuentes**: Los Clientes que cancelan con frecuencia sus envíos corren el riesgo de sufrir restricciones temporales o la suspensión de la cuenta.
pt: A shnell Logistics tem uma política de cancelamento clara para garantir a equidade para Clientes, Motoristas e a plataforma. Os cancelamentos são tratados de forma diferente dependendo de quem os inicia e quando. **11.1 Cancelamentos do cliente** - **Antes da aceitação do motorista**: Os Clientes podem cancelar um pedido de serviço a qualquer momento antes que um Motorista o aceite. Não há penalidades ou taxas por isso. - **Após a aceitação do motorista**: Se um Cliente cancelar depois que um Motorista aceitou o pedido, mas antes da recolha, pode ser aplicada uma taxa de cancelamento de 20% da tarifa estimada (mínimo 5 TND) para compensar o tempo e o combustível do Motorista. - **Após a recolha**: O cancelamento após a recolha do pacote pelo Motorista não é permitido, a menos que o Motorista concorde ou haja uma razão válida (por exemplo, condições inseguras). A tarifa completa pode ser cobrada. - **Processo**: Os Clientes podem cancelar através do botão "Cancelar pedido" na App ou contactando support@shnell.com. Os reembolsos para taxas de cancelamento são processados no prazo de 7 dias úteis. - **Cancelamentos frequentes**: Os Clientes que cancelam frequentemente os seus envios correm o risco de restrições temporárias ou suspensão da conta.
zh: shnell Logistics 制定了明确的取消政策，以确保客户、司机和平台的公平性。取消的处理方式因发起方和时间而异。 **11.1 客户取消** - **在司机接受之前**：客户可以在司机接受之前随时取消服务请求。此操作没有罚款或费用。 - **在司机接受之后**：如果客户在司机接受请求后但在取货之前取消，则可能会收取相当于预估费用的 20%（最低 5 TND）的取消费用，以补偿司机的时间和燃料。 - **在取货之后**：司机取货后，除非司机同意或有正当理由（例如，不安全的环境），否则不允许取消。在这种情况下可能会收取全额费用。 - **流程**：客户可以通过应用程序中的“取消订单”按钮或联系 support@shnell.com 进行取消。取消费的退款将在 7 个工作日内处理。 - **频繁取消**：频繁取消发货的客户可能会面临临时限制或账户暂停的风险。

# suspensionHeading
source: 12. Account Suspension and Termination
ar: 12. تعليق الحساب وإنهاؤه
de: 12. Kontosperrung und Kündigung
es: 12. Suspensión y terminación de la cuenta
pt: 12. Suspensão e rescisão da conta
zh: 12. 账户暂停和终止
