Repository: ahmedd-achour/shnell_android_ios_client
Catalog: lib/l10n/app_*.arb
Languages: ar, de, es, pt, zh

# appTitle
source: Shnell
ar: شنيل

# welcomeMessage
source: Welcome to Shnell!
ar: مرحبا بكم في شنيل!
de: Willkommen bei Shnell!
es: ¡Bienvenido a Shnell!
pt: Bem-vindo ao Shnell!
zh: 欢迎使用 Shnell！

source: Select Language
ar: اختار اللغة
de: Sprache auswählen
es: Seleccionar idioma
pt: Selecionar idioma
zh: 选择语言

source: Logout
ar: تسجيل الخروج
de: Abmelden
es: Cerrar sesión
pt: Sair
zh: 退出

source: Delete Account
ar: حذف الحساب
de: Konto löschen
es: Eliminar cuenta
pt: Excluir conta
zh: 删除帐户

source: Personal Info
ar: المعلومات الشخصية
de: Persönliche Informationen
es: Información personal
pt: Informações pessoais
zh: 个人信息

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
es: Política de privacidad
pt: Política de Privacidade
zh: 隐私政策

# privacyPolicyUpdated
source: This policy was last updated on {date}.
ar: تم تحديث هذه السياسة آخر مرة في {date}.
de: Diese Richtlinie wurde zuletzt am {date} aktualisiert.
es: Esta política fue actualizada por última vez el {date}.
pt: Esta política foi atualizada pela última vez em {date}.
zh: 本政策最后更新于 {date}。

# introHeading
source: 1. Introduction
ar: 1. مقدمة
de: 1. Einleitung
es: 1. Introducción
pt: 1. Introdução
zh: 1. 简介

# introBody
source: Schnell Logistics ("we," "us," or "our") is committed to protecting your privacy and ensuring transparency in how we handle your personal information. This Privacy Policy outlines the practices of Schnell Logistics, a transportation and logistics platform specializing in courier services, residential and commercial moving, heavy load transport, warehousing, international shipping, secure transport, and express delivery. By accessing or using the Schnell Logistics mobile application, website, or related services (collectively, the "App"), you agree to the practices described in this policy. This policy is designed to comply with applicable data protection laws, including but not limited to the General Data Protection Regulation (GDPR) for users in the European Union, the California Consumer Privacy Act (CCPA) for California residents, and other relevant regulations worldwide. We aim to provide clear, detailed, and accessible information about how we collect, use, share, and protect your personal data, as well as your rights regarding that data. The App connects users (both individuals and businesses) with drivers and logistics providers to facilitate efficient and reliable transportation services. This policy applies to all users, including customers requesting services ("Customers"), drivers providing transportation services ("Drivers"), and businesses engaging in B2B logistics services ("Business Partners"). If you do not agree with this policy, please do not use the App. We may update this policy periodically to reflect changes in our practices, technology, or legal requirements. You will be notified of significant changes via email, in-app notifications, or updates on our website at www.schnell.com/privacy-policy. Continued use of the App after such changes constitutes your acceptance of the revised policy. This policy was last updated on **August 22, 2025**. Please review it carefully to understand our practices.
ar: تلتزم شركة شنيل اللوجستية ("نحن") بحماية خصوصيتك وضمان الشفافية في طريقة تعاملنا مع معلوماتك الشخصية. توضح سياسة الخصوصية هذه ممارسات شركة شنيل اللوجستية، وهي منصة للنقل والخدمات اللوجستية متخصصة في خدمات البريد السريع، ونقل المنازل والأعمال، ونقل البضائع الثقيلة، والتخزين، والشحن الدولي، والنقل الآمن، والتوصيل السريع. باستخدامك تطبيق الهاتف المحمول أو الموقع الإلكتروني أو الخدمات ذات الصلة (يُشار إليها مجتمعة باسم "التطبيق")، فإنك توافق على الممارسات الموضحة في هذه السياسة. تم تصميم هذه السياسة للامتثال لقوانين حماية البيانات المعمول بها، بما في ذلك على سبيل المثال لا الحصر اللائحة العامة لحماية البيانات (GDPR) للمستخدمين في الاتحاد الأوروبي، وقانون خصوصية المستهلك في كاليفورنيا (CCPA) للمقيمين في كاليفورنيا، واللوائح الأخرى ذات الصلة في جميع أنحاء العالم. نهدف إلى توفير معلومات واضحة ومفصلة ومتاحة حول كيفية جمعنا لبياناتك الشخصية واستخدامها ومشاركتها وحمايتها، بالإضافة إلى حقوقك فيما يتعلق بتلك البيانات. يربط التطبيق المستخدمين (الأفراد والشركات على حد سواء) بالسائقين ومقدمي الخدمات اللوجستية لتسهيل خدمات النقل الفعالة والموثوقة. تنطبق هذه السياسة على جميع المستخدمين، بما في ذلك العملاء الذين يطلبون الخدمات ("العملاء")، والسائقون الذين يقدمون خدمات النقل ("السائقون")، والشركات التي تشارك في خدمات لوجستية من شركة إلى أخرى ("شركاء الأعمال"). إذا كنت لا توافق على هذه السياسة، يرجى عدم استخدام التطبيق. قد نقوم بتحديث هذه السياسة بشكل دوري لتعكس التغييرات في ممارساتنا أو تقنيتنا أو المتطلبات القانونية. سيتم إعلامك بالتغييرات الهامة عبر البريد الإلكتروني أو الإشعارات داخل التطبيق أو التحديثات على موقعنا على الويب www.shnell.com/privacy-policy. استمرارك في استخدام التطبيق بعد هذه التغييرات يشكل موافقتك على السياسة المعدلة. تم تحديث هذه السياسة آخر مرة في **22 أغسطس 2025**. يرجى مراجعتها بعناية لفهم ممارساتنا.
de: Schnell Logistics ("wir," "uns" oder "unser") verpflichtet sich, Ihre Privatsphäre zu schützen und Transparenz im Umgang mit Ihren persönlichen Daten zu gewährleisten. Diese Datenschutzrichtlinie beschreibt die Praktiken von Schnell Logistics, einer Transport- und Logistikplattform, die sich auf Kurierdienste, private und gewerbliche Umzüge, Schwertransporte, Lagerhaltung, internationalen Versand, sicheren Transport und Expresslieferungen spezialisiert hat. Durch den Zugriff oder die Nutzung der mobilen Anwendung, der Website oder der damit verbundenen Dienste von Schnell Logistics (zusammenfassend die "App") erklären Sie sich mit den in dieser Richtlinie beschriebenen Praktiken einverstanden. Diese Richtlinie wurde entwickelt, um die geltenden Datenschutzgesetze einzuhalten, einschließlich, aber nicht beschränkt auf die Datenschutz-Grundverordnung (DSGVO) für Nutzer in der Europäischen Union, den California Consumer Privacy Act (CCPA) für Einwohner Kaliforniens und andere relevante Vorschriften weltweit. Unser Ziel ist es, klare, detaillierte und zugängliche Informationen darüber bereitzustellen, wie wir Ihre persönlichen Daten sammeln, verwenden, weitergeben und schützen, sowie über Ihre Rechte in Bezug auf diese Daten. Die App verbindet Nutzer (sowohl Einzelpersonen als auch Unternehmen) mit Fahrern und Logistikanbietern, um effiziente und zuverlässige Transportdienste zu ermöglichen. Diese Richtlinie gilt für alle Nutzer, einschließlich Kunden, die Dienstleistungen anfordern ("Kunden"), Fahrern, die Transportdienste anbieten ("Fahrer"), und Unternehmen, die B2B-Logistikdienste in Anspruch nehmen ("Geschäftspartner"). Wenn Sie mit dieser Richtlinie nicht einverstanden sind, nutzen Sie die App bitte nicht. Wir können diese Richtlinie regelmäßig aktualisieren, um Änderungen in unseren Praktiken, Technologien oder rechtlichen Anforderungen widerzuspiegeln. Sie werden über wesentliche Änderungen per E-Mail, In-App-Benachrichtigungen oder Aktualisierungen auf unserer Website unter www.schnell.com/privacy-policy benachrichtigt. Die fortgesetzte Nutzung der App nach solchen Änderungen stellt Ihre Zustimmung zu der überarbeiteten Richtlinie dar. Diese Richtlinie wurde zuletzt am **22. August 2025** aktualisiert. Bitte lesen Sie sie sorgfältig durch, um unsere Praktiken zu verstehen.
es: shnell Logistics ("nosotros," "nuestro" o "nuestra") se compromete a proteger su privacidad y a garantizar la transparencia en la forma en que manejamos su información personal. Esta Política de Privacidad describe las prácticas de shnell Logistics, una plataforma de transporte y logística especializada en servicios de mensajería, mudanzas residenciales y comerciales, transporte de carga pesada, almacenamiento, envío internacional, transporte seguro y entrega exprés. Al acceder o utilizar la aplicación móvil, el sitio web o los servicios relacionados de shnell Logistics (colectivamente, la "Aplicación"), usted acepta las prácticas descritas en esta política. Esta política está diseñada para cumplir con las leyes de protección de datos aplicables, incluyendo, entre otras, el Reglamento General de Protección de Datos (RGPD) para los usuarios en la Unión Europea, la Ley de Privacidad del Consumidor de California (CCPA) para los residentes de California y otras regulaciones relevantes en todo el mundo. Nuestro objetivo es proporcionar información clara, detallada y accesible sobre cómo recopilamos, usamos, compartimos y protegemos sus datos personales, así como sus derechos con respecto a esos datos. La aplicación conecta a los usuarios (tanto individuos como empresas) con conductores y proveedores de logística para facilitar servicios de transporte eficientes y fiables. Esta política se aplica a todos los usuarios, incluidos los clientes que solicitan servicios ("Clientes"), los conductores que prestan servicios de transporte ("Conductores") y las empresas que participan en servicios de logística B2B ("Socios comerciales"). Si no está de acuerdo con esta política, no utilice la Aplicación. Podemos actualizar esta política periódicamente para reflejar cambios en nuestras prácticas, tecnología o requisitos legales. Se le notificará sobre los cambios significativos por correo electrónico, notificaciones en la aplicación o actualizaciones en nuestro sitio web en www.shnell.com/privacy-policy. El uso continuado de la Aplicación después de dichos cambios constituye su aceptación de la política revisada. Esta política se actualizó por última vez el **22 de agosto de 2025**. Por favor, revísela cuidadosamente para comprender nuestras prácticas.
pt: A shnell Logistics ("nós", "nos" ou "nosso") está comprometida em proteger a sua privacidade e garantir a transparência na forma como lidamos com as suas informações pessoais. Esta Política de Privacidade descreve as práticas da shnell Logistics, uma plataforma de transporte e logística especializada em serviços de correio, mudanças residenciais e comerciais, transporte de cargas pesadas, armazenamento, frete internacional, transporte seguro e entregas expresso. Ao aceder ou utilizar a aplicação móvel, website ou serviços relacionados da shnell Logistics (coletivamente, a "App"), concorda com as práticas descritas nesta política. Esta política foi concebida para cumprir as leis de proteção de dados aplicáveis, incluindo, mas não se limitando, ao Regulamento Geral sobre a Proteção de Dados (RGPD) para utilizadores na União Europeia, à Lei de Privacidade do Consumidor da Califórnia (CCPA) para residentes na Califórnia, e outras regulamentações relevantes a nível mundial. O nosso objetivo é fornecer informações claras, detalhadas e acessíveis sobre como recolhemos, utilizamos, partilhamos e protegemos os seus dados pessoais, bem como os seus direitos em relação a esses dados. O App conecta utilizadores (tanto indivíduos como empresas) com motoristas e fornecedores de serviços de logística para facilitar serviços de transporte eficientes e confiáveis. Esta política aplica-se a todos os utilizadores, incluindo clientes que solicitam serviços ("Clientes"), motoristas que fornecem serviços de transporte ("Motoristas") e empresas que utilizam serviços de logística B2B ("Parceiros de Negócio"). Se não concordar com esta política, por favor, não utilize o App. Podemos atualizar esta política periodicamente para refletir mudanças nas nossas práticas, tecnologia ou requisitos legais. Ser-lhe-á notificado de quaisquer alterações significativas por e-mail, notificações na aplicação ou através de atualizações no nosso website em www.shnell.com/privacy-policy. A sua utilização contínua da App após tais alterações constitui a sua aceitação da política revista. Esta política foi atualizada pela última vez em **22 de agosto de 2025**. Por favor, reveja-a cuidadosamente para entender as nossas práticas.
zh: shnell Logistics（以下简称“我们”）致力于保护您的隐私，并确保我们在处理您的个人信息时保持透明。本隐私政策阐述了 shnell Logistics 的业务实践，shnell Logistics 是一个专注于快递服务、住宅和商业搬迁、重型货物运输、仓储、国际货运、安全运输和快速投递的运输与物流平台。通过访问或使用 shnell Logistics 的移动应用程序、网站或相关服务（统称为“应用程序”），您即同意本政策中描述的做法。 本政策旨在遵守适用的数据保护法律，包括但不限于欧盟用户的《通用数据保护条例》（GDPR）、加利福尼亚州居民的《加利福尼亚消费者隐私法案》（CCPA）以及全球其他相关法规。我们的目标是就我们如何收集、使用、共享和保护您的个人数据，以及您对这些数据拥有的权利，提供清晰、详细和可访问的信息。 本应用程序连接用户（个人和企业）与司机和物流提供商，以促进高效可靠的运输服务。本政策适用于所有用户，包括请求服务的客户（“客户”）、提供运输服务的司机（“司机”）以及使用 B2B 物流服务的企业（“商业合作伙伴”）。如果您不同意本政策，请不要使用本应用程序。 我们可能会定期更新本政策，以反映我们业务、技术或法律要求的变化。如有重大变更，我们将通过电子邮件、应用内通知或在我们网站 www.shnell.com/privacy-policy 上进行更新来通知您。在此类变更后继续使用本应用程序即表示您接受修订后的政策。 本政策最后更新于 **2025 年 8 月 22 日**。请仔细阅读本政策以了解我们的做法。

# infoCollectionHeading
source: 2. Information We Collect
ar: 2. المعلومات التي نجمعها
de: 2. Informationen, die wir sammeln
es: 2. Información que recopilamos
pt: 2. Informações que recolhemos
zh: 2. 我们收集的信息
